[
  "Sister called man killed by police ‘ticking time bomb,’ inquest hears",
  "PRINCE GEORGE — The sister of a man who was shot and killed in a standoff with police at a remote cabin south of Valemount described him as a “ticking time bomb” with a “history of violence,” a coroner’s inquest into his death heard Monday.",
  "A recording of a phone call Theresa Hebert made to police was played to a seven-person jury appointed to hear evidence and make recommendations related to the Sept. 17, 2014, death of John Robert Buehler, 51.",
  "Buehler and his then 21-year-old daughter, Shanna, had been found squatting in the cabin near Kinbasket Lake, about 120 kilometres south of Valemount.",
  "The two were known to the RCMP from a June 19, 2017, incident. With six German shepherd dogs in tow, they had set up camp at a recreation area south of Valemount.According to an agreed statement of facts entered during a court proceeding for his daughter, the two got into a conflict with area residents who were being prevented from using the nearby trails.",
  "When RCMP showed up, Buehler used the dogs as a shield and refused to leave the property for several hours. Shanna Buehler co-operated with police, urging her father to surrender.",
  "Ultimately, John Buehler did give himself up and the dogs were seized, as were several firearms, an unlicensed handgun and hundreds of rounds of ammunition.",
  "When Hebert heard the news, she called the Valemount RCMP to warn police about what he was like.",
  "“He’s like a ticking time bomb,” she said.",
  "Earlier in the day, forensic pathologist James Stephen said Buehler was hit by six bullets during the confrontation with police, two of which pierced his heart while a handful of other vital organs were also struck.",
  "In 2016, Crown counsel decided to not pursue criminal charges against members of the RCMP emergency response team involved in the standoff at the cabin.",
  "The inquest began Monday at the Prince George courthouse and is scheduled to last seven days and hear from 28 witnesses, most of them RCMP officers. The jury will be asked to make recommendations to prevent similar deaths in the future."
]