[
  "Teen shot by RCMP handed over weapons and then ran away, investigators say",
  "15-year-old Hoss Lightning from Samson Cree Nation had called 911 for help",
  "A 15-year-old Indigenous boy killed by RCMP in Wetaskiwin, Alta., last week handed a machete and a knife over to police and had run into a field before officers opened fire, Alberta's policing watchdog said Thursday.",
  "In a statement, the Alberta Serious Incident Response Team (ASIRT) provided new details on the final moments leading to the death of Hoss Lightning from Samson Cree Nation.",
  "Lightning died last Friday. According to RCMP, the teen called 911 and told a dispatcher he was being followed by people trying to kill him.",
  "In a statement issued that afternoon, RCMP said officers found the teen with several weapons, which they confiscated. Police said a confrontation then led to two officers shooting the boy, who later died in hospital.",
  "In its own statement Thursday, ASIRT said the call from Lightning came in at 12:28 a.m. and that a lone officer from the Wetaskiwin detachment located the teen in the area of 56th Street and 37A Avenue less than 20 minutes later.",
  "Lightning and the officer spoke, ASIRT said, and the teen handed over a machete and knife that he had in his possession.",
  "\"The officer determined that the youth was at risk and attempted to apprehend the youth and search him as well as his backpack,\" the agency said.",
  "\"While initially co-operative, the youth fled before being apprehended, running a short distance away.\"",
  "ASIRT said the officer followed Lightning in his vehicle and was joined by other officers who were assisting on the call.",
  "The youth was located in a field nearby, ASIRT said. As the officers approached and stepped out of their vehicles a confrontation occurred, ASIRT said.",
  "Two officers discharged their firearms and Lightning fell to the ground, according to the ASIRT statement.",
  "Dashcam video recovered from the vehicles of the officers involved in the response captured video and audio of the incident as it unfolded, ASIRT said.",
  "ASIRT is asking anyone who witnessed the interaction between Lightning and RCMP to contact them.",
  "The RCMP is conducting its own investigation into the shooting.",
  "Indigenous leaders, including Chief Vernon Saddleback of the Samson Cree Nation, have called for a transparent investigation and improved accountability from police as the community continues to grieve.",
  "A candlelight vigil honouring the boy is expected to be held once family members have taken the time to mourn.",
  "Saddleback has said the boy's family will speak publicly, once they have laid him to rest.",
  "Opposition NDP MLAs Brooks Arcand-Paul and Jodi Calahoo Stonehouse issued a joint statement Tuesday calling for a thorough investigation and a commitment to structural police reform.",
  "They said the teen \"began his spirit walk far too young\" and called his death a terrible loss to the community.",
  "\"We reiterate the need for a comprehensive approach to fixing the structural problems with policing in this province,\" their statement said."
]