[
  "Man fatally shot by police in Lachine after pursuit",
  "CTV Montreal: Deadly police shooting A man called 9-1-1 to report his son was at risk, and police shot him following a pursuit. ",
  "A 27-year-old man is dead after he was shot by police following a pursuit Thursday morning.",
  "The incident began around 12:45 a.m., when a man alerted police that his son, Noam Cohen, was in distress and had gotten behind the wheel with intent to do harm.",
  "Cohen was apparently dressed only in his underwear when Cote Saint Luc security agents arrived, but were unable to prevent the man from driving off in his car.",
  "Montreal police then caught up with Cohen as he drove for several kilometres and headed for Lachine.",
  "Police said that Cohen was responsible for at least three collisions as he drove a black SUV with police in pursuit. They say police set up a patrol car as a makeshift barricade, but that Cohen tried to steer into officers at St. Joseph Blvd. near George V.",
  "Montreal police said that officers shot Cohen at least once, although another source has told CTV that Cohen was shot in the back. He was taken to hospital where he died of his injuries.",
  "Police said Cohen has a history of violence and had mental health issues. He pleaded guilty last year to breaking and entering and weapons charges, and was sentenced to three years probation and 240 hours of community service.",
  "This is the second time this year Montreal police have shot and killed a man. On January 6 officers shot and killed Jimmy Cloutier, a frequent patron of the Old Brewery Mission.",
  "Since then the director of the Mission, Matthew Pearce, has been active in training Montreal police officers on how to de-escalate situations involving a person who is believed to be mentally ill.",
  "\"When we see someone who's got a mental illness and they're acting aggressively, their primary feeling is one of fear not one of anger. It looks like it's anger but in fact these are people who are very, very frightened because they are seeing things we're not seeing, they're experiencing things we're not experiencing, and it's frightening for them,\" said Pearce.",
  "So far 75 of Montreal's 4,000 officers have been trained.",
  "Both shootings are being investigated by the independent investigations bureau, the BEI, and the SQ will provide additional assistance under the independent team’s watch.",
  "Anyone who witnessed the event is urged to contact the BEI here.",
  "Read the BEI report here."
]