[
  "Manitoba watchdog clears 2 First Nations police force officers in fatal Long Plain shooting",
  "Ben Richard, 23, was allegedly shooting out the windows in his home, then shot at police, says IIU",
  "The Independent Investigation Unit is clearing a pair of Manitoba First Nations Police Service officers of wrongdoing in the shooting death of Ben Richard, 23, on Long Plain First Nation last spring.",
  "The civilian director of the IIU, Zane Tessler, concluded that the use of lethal force by the two MFNP officers was \"justified, unavoidable and necessary\" to prevent any further death or injury to the public.",
  "Reports of a man shooting out the windows of his home drew officers from the police service, formerly known as the Dakota Ojibway Police Service, to a property in Long Plain, just south of Portage la Prairie, on April 2, 2019.",
  "He allegedly shot at one officer upon arrival, then at two others who returned fire that hit the man in several places, according to the IIU.",
  "Emergency crews pronounced him dead at the scene.",
  "That man was Richard, 23, though the 12-page report by the investigative unit does not mention him by name.",
  "Family members confirmed his identity to CBC News the morning after the incident.",
  "His sister, Patricia Richard, wasn't present for the shooting, but said she could hear her brother \"freaking out\" in the background while she was on the phone with her mother, who lived in the home.",
  "She suggested Richard wasn't threatening anyone and police acted too quickly.",
  "The report from the IIU, which investigates all serious incidents involving police in the province, says a total of 59 spent .22 shell casings and 77 live .22 rounds were found in and around the home.",
  "Investigators interviewed someone who lived in the home and was present during the shooting. The report doesn't reveal who that person is, but says they were related to Richard and told investigators he had been acting \"all weird and strange as of late.\"",
  "That relative also said police visited the home a week prior to speak with Richard, but didn't take him in for an assessment.",
  "\"They [police] felt he was not a danger to himself or others,\" the IIU report states.",
  "The relative said the morning of the shooting, Richard began punching holes in the walls and later began shooting a rifle throughout the home.",
  "Police arrived as the relative pulled away in a vehicle driven by another person, the report states, and shortly after, the officers and Richard began exchanging fire.",
  "The IIU interviewed that other person, who said Richard had \"been depressed for several months because of a friend's sudden passing.\"",
  "The IIU reviewed the notes and statements of the two officers who fired their weapons, though they both refused to be interviewed by the police watchdog.",
  "Investigators interviewed three other officers who were there that day, two civilian witnesses and two emergency crew workers who arrived on scene.",
  "The IIU also went through a report of what happened from Manitoba First Nations Police, scene photographs, audio of the 911 call, MFNP radio communications, an autopsy and toxicology report, and a report by the forensic identification unit.",
  "In addition to finding the officers' use of lethal force was justified, the IIU's Tessler said the toxicology report showed the man had alcohol and cannabis in his system before the incident.",
  "Separate from the IIU investigation, Manitoba's chief medical examiner announced last fall it would launch an inquest into Richard's death.",
  "The provincial Fatality Inquires Act stipulates the examiner must investigate cases where someone dies as a result of lethal force by police or dies in custody.",
  "Inquests are meant to determine circumstances surrounding a death such as Richard's and whether anything could be done differently to prevent similar incidents in the future.",
  "It isn't clear when the inquest will be completed.",
  "The MFNP is headquartered in Long Plain First Nation, located roughly 100 kilometres west of Winnipeg, and polices six Indigenous communities in the province."
]