[
  "UPDATE: Family of B.C. man killed by cop appeals to Attorney General for help",
  "The family of a Maple Ridge man shot and killed by a police officer is asking for help from B.C.’s Attorney General in the hope of having their case forwarded to Crown counsel.",
  "Yin Yin Din and Min Aung are siblings of Kyaw Naing Din, who was killed by a member of the Ridge Meadows RCMP in 2019.",
  "They contend the Independent Investigation Office, (IIO) based their decision not to forward the case on “lies and the incorrect, inconsistent, and contrived statements of the four Ridge Meadow RCMP police officers and the two paramedics,” who were on scene that day.",
  "The siblings and Listen Chen, with Red Braid Alliance, held a press conference Monday where they pointed out what they consider “lies” in the statements made by the police officers, while asking Attorney General David Eby to help them in their efforts, “to get justice for Kyaw.”",
  "“Mr. Ronald MacDonald’s analysis of the incident throughout the IIO’s public report is totally not true at all,” read a letter dated March 7, 2021, and addressed to MacDonald, chief civilian director of the IIO, to IIO investigator Allan Turner, and to the rest of the investigative team looking into Kyaw’s death.",
  "Din, a 54-year-old Burmese immigrant, was shot on Aug. 11, 2019, in his Maple Ridge home, after his family called 9-1-1 for assistance.",
  "His sister maintained they often called for help to transfer him to hospital when he needed to get back on his medications for his mental health. He had been diagnosed at 35 with schizophrenia, said the family.",
  "After reviewing all the evidence, the IIO released a 23-page report on Sept. 24, 2020, saying Din had been violent towards police during the incident and that the officers were justified in the use of force.",
  "The IIO did not recommend criminal charges against the officer who pulled the trigger.",
  "On April 8, MacDonald again denied the family’s request to reconsider.",
  "“Their ask for us to reconsider was based on no new evidence. It was just a repitition of previous commentary,” said MacDonald, adding that Yin Yin has given the agency four different versions of what occurred.",
  "“She also denied, for example, that the weight came flying out of the room when in fact the paramedics saw that happen and it matches the dent in the wall,” he continued.",
  "The evidence is compelling enough to show that, “her reliability is just not there,” said MacDonald.",
  "The Din family is asking Eby to step in and forward the file to the Crown because, “there is enough evidence that the police officer committed a wrongdoing and there are two different versions of events,” said Yin Yin.",
  "However, MacDonald stated, the IIO ruling won’t be overturned because they are an independent office – not only of the police but of government, as well.",
  "The minister, said MacDonald of Eby, cannot tell them what to do in their operational decisions.",
  "Yin Yin said the BC Coroners Service is currently reviewing her brother’s file and the family is waiting to hear when an inquest is going to take place.",
  "“We won’t give up,” promised Yin Yin on Monday, who would like to see first-degree murder charges brought against the officer who killed her brother.",
  "“Every day we miss him too much.”"
]