[
  "Family demands answers after fatal shooting at Morrisburg, Ont., OPP detachment",
  "Babak Saidi was the 'kindest, sweetest, most loving person,' sister says",
  "Ontario's Special Investigations Unit (SIU) is investigating a shooting Saturday at the OPP detachment in Morrisburg, Ont. (Angelina Ouimet)",
  "An eastern Ontario family is demanding answers after a 43-year-old man died Saturday following a shooting at the Ontario Provincial Police detachment in Morrisburg, Ont.",
  "Babak Saidi, who had schizophrenia, was required to check in weekly at the detachment after his 2014 conviction for assault and battery, his sister Elly Saidi told CBC News Saturday evening.  ",
  "He had been visiting the detachment without any incident, she said —  until this weekend, when his check-in went horribly wrong.",
  "\"My brother, he was the kindest, sweetest, most loving person,\" Elly Saidi said. \"He had a mental disability, and we need to know how to deal with a person with mental disability.\"",
  "Ontario's police watchdog, the Special Investigations Unit, invoked its mandate following the fatal shooting Saturday afternoon.",
  "Two shots",
  "Babak Saidi departed for his Saturday morning rendezvous at the detachment with a tin full of freshly baked muffins.",
  "Babak Saidi, 43, was shot to death at the Morrisburg, Ont., OPP detachment on Saturday, Dec. 23, 2017. The province's police watchdog has invoked its mandate and is investigating the shooting. (Submitted by Elly Saidi)",
  "The muffins were a Christmas gift for his father and a family friend who were picking him up from his farm near Cardinal, Ont., and bringing him into town.",
  "They were also a sign, his sister said, that he was in a good mood.",
  "Recounting her father's version of events, Elly Saidi said when they arrived at the police station, they were told to wait about 15 minutes. They went to do some grocery shopping, and when they came back, Babak Saidi got out of the car to go inside.",
  "The next thing her father saw, she said, was her brother on the ground, with two officers on top of him. ",
  "Babak Saidi was taken into the detachment, she said, and then — within two minutes — her father heard two shots ring out.",
  "'Sorry, your son is gone'",
  "A police officer told her father and his friend to go wait at a nearby Tim Hortons, Elly Saidi said, and that someone would come by to explain what happened.",
  "\"They waited for a few hours, and then the police came,\" she said. \"My dad asked the police, 'Where is my son?' And the police officer told my dad that, sorry, your son is gone.\"",
  "Ten hours after the shooting, Elly Saidi said, that remained the only detail the family had been given about what happened inside the detachment — an absence of information that was \"unacceptable.\"",
  "\"I have to be strong for my parents. It's very hard to see my mom and my dad crying and being heartbroken,\" she said.",
  "\"My mom was sitting in a corner of the room, hugging my brother's picture. And all she's saying is, 'I don't know what happened. I don't know where his body is.'\"",
  "Trying to rebuild life",
  "",
  "Elly Saidi said her brother had been trying to rebuild his life at the time of his death, raising sheep and cattle on his farm just west of Morrisburg.",
  "A worker with homeless youth in Ottawa, Saidi said she was speaking out because there had been too many recent incidents where interactions between police officers and people with mental health issues had turned violent — even deadly.",
  "She also said she was certain her brother was unarmed.",
  "\"They have absolutely no tools and no awareness to deal with people with mental disability. Too many people with mental disabilities have died at the hands of the police,\" she said.",
  "\"They need to have education and awareness [of] how to deal with people with mental disability. And not [assume] they're all bad and a menace to society.\"",
  "",
  "",
  "",
  "",
  "",
  "",
  "SIU investigating fatal 'interaction'",
  "In its initial statement, the SIU said that a man entered the OPP detachment on Fifth Street West at around noon and ended up having an \"interaction\"  with the officers there.",
  "One of the officers fired a gun and hit the man, the SIU said.",
  "The man, whom the SIU confirmed Sunday was indeed Babak Saidi, was pronounced dead at the scene.",
  "A post-mortem examination is scheduled to take place Wednesday in Ottawa, SIU spokeswoman Monica Hudon said.",
  "Four investigators and three forensic investigators from SIU assigned to investigate fatal shooting of man at Morrisburg OPP detachment. News release: <a href=\"https://t.co/458N6Kylm5\">https://t.co/458N6Kylm5</a>",
  "In its own statement, the OPP said the man suffered fatal injuries after getting into an \"altercation\" with a Morrisburg police officer outside the detachment.",
  "The officer was also being treated for \"undetermined\" injuries, police said. ",
  "Const. Tylor Copeland, a spokesman for the Stormont, Dundas and Glengarry OPP, referred questions about the shooting to the SIU.",
  "He did say that in more than a decade as an OPP officer, he hadn't heard of any shootings at the Morrisburg police station.",
  "The officer who fired the weapon has not been named.",
  "7 investigators on the case",
  "The SIU probes incidents involving police and civilians that result in serious injury, death or allegations of sexual assault.",
  "Seven investigators have been assigned to the case, the SIU said.",
  "The SIU said Sunday they would be interviewing the officer who is the subject of their investigation, as well as 10 officers who were witnesses.",
  "Anyone with information can call the lead investigator at 1-800-787-8529. ",
  "Morrisburg is approximately 80 kilometres south of Ottawa.",
  "",
  "",
  ""
]