[
  "Family of Tammy Bateman says it took police 2 days to notify them of her death",
  "Sister says Tammy ‘always in good spirits’ but struggled in life.",
  "School photos of Tammy Bateman. Photos courtesy Lori Bateman",
  "A Winnipeg woman says the loss of her little sister was made even more traumatic by the way the family found out about her passing.",
  "Now Lori Bateman is looking for an apology for her family from the Winnipeg Police Service. She says news of the death of her sister Tammy reached them through friends and family and not the police.",
  "“I got a message from my nephew on Wednesday, and he said ‘did you hear about Tammy?’ And I said ‘what?’ And he said, ‘well, Tammy’s gone.’ He said ‘yeah, my mum saw it in the paper some gentleman was saying it was her dad confirmed it,’” Bateman said.",
  "Tammy Bateman, a member of Roseau River Anishinaabe First Nation, an hour south of Winnipeg, had been living in a homeless encampment along Winnipeg’s Red River in Fort Rouge Park. She was struck and killed by a police cruiser around 9:30 p.m. on Sept. 4 in the park.",
  "She was the third First Nations person killed in seven incidents involving city police or RCMP since Aug. 29.",
  "Initially, there was confusion amongst the family because the man claiming to be her dad in Winnipeg media reports had a different last name from their father. Bateman said Tammy’s biological father had passed away. The man confirming Tammy’s death to the media was someone who had taken her under his wing at the homeless encampment where she lived – but he wasn’t her father.",
  "Tammy and Lori aren’t biological sisters. Tammy, along with her biological brother, was adopted from foster care into the Bateman family as infants.",
  "It’s not clear if they ever lived in Roseau River First Nation. The family also adopted Lori who was a young girl when Tammy and her brother were adopted.",
  "Lori said she and Tammy remained close.",
  "“We always kept in contact, through a number of years, even through her adult life where she was on the streets,” Lori said. “We kept in contact and stuff and she would come over and visit.”",
  "She said Tammy suffered from mental health issues and had struggled in school before landing on the streets as a young adult. However, Lori said Tammy was not schizophrenic as was suggested in a comment made to the media.",
  "“Even with the life struggles and the things she had to go through, living on the streets and even struggling through her younger life in school, she was always in good spirits,” Lori said. “It didn’t matter what situation she was in, she always had a smile on her face and made people laugh.”",
  "After hearing from her nephew, Lori said she kept looking for information about the incident online, searching for stories.",
  "“So, I called my dad to confirm it. He didn’t even know either. We were like ‘It’s not the right name [the man reporting to be her “father figure” as reported], it’s not the right Tammy’ and I said ‘ok, thank god,’” Lori said.",
  "However, after looking into the stories online, she came to the conclusion the victim was her sister Tammy and called her dad back. Police eventually arrived on her father’s doorstep on Sept. 6 notifying him of Tammy’s death.",
  "Bateman said her father broke down on hearing the news.",
  "“Losing anybody is hard, but when you find out a couple days after the fact, it just angers you,” Bateman said. “Even though my sister was an adult woman, she’s still my dad’s child that he adopted and raised from a baby, so I was angry that he didn’t know in the first place, and that once again, I had to find out on social media.”",
  "Lori said that she’s gone through this before with police. Three years ago her son was murdered. She said she found out through social media.",
  "Bateman said police knew Tammy was living in the encampment and could have found her family through several routes.",
  "“Obviously, she was involved with Main Street Project, Siloam Mission. They could have called and found out information. They had my dad’s information,” she said. “It really made me angry that we were almost the last to know.”",
  "Emergency debate held over First Nations deaths at the hands of police",
  "Bateman has many questions about the incident that claimed Tammy’s life and wants accountability from the WPS. She said since the day her dad was notified, there has been no communication from the police.",
  "APTN News reached out to the Winnipeg police for comment but has not heard back. In any civilian death involving a police officer, the Independent Investigation Unit of Manitoba is called in to investigate and it is currently looking into the circumstances of Tammy’s death.",
  "Meanwhile, Bateman praised the outreach workers from Main Street Project and Morgan’s Warriors, the group formed after another homeless woman, Morgan Harris, died at the hands of a serial killer.",
  "“They really stepped up for me and they were there for me right from as soon as we did the rally at Portage and Main and they’re still supporting me, checking in and seeing if I’m ok,” she said, “so, I want to thank every one of them that helped my sister, and also myself.”"
]