[
  "Vancouver police officers acted in 'accordance with the law' in 2016 fatal shooting: IIO",
  "Daniel Peter Rintoul, 38, died at the scene after being shot and tasered by the police multiple times.",
  "A report by the Independent Investigations Office released Friday says Vancouver police officers involved in a fatal shooting in November 2016 “acted as required by their duties and in accordance with the law.”",
  "Police had been called to a Canadian Tire store near Grandview Highway and Rupert Street after a large man stabbed a store employee during a robbery that involved firearms.",
  "When the attacker left the store, he grabbed another man and held him hostage at knifepoint before being shot multiple times by police. Daniel Peter Rintoul, 38, died at the scene. A police officer was also hurt.",
  "Start your day with a roundup of B.C.-focused news and opinion.",
  "By signing up you consent to receive the above newsletter from Postmedia Network Inc.",
  "A welcome email is on its way. If you don't see it, please check your junk folder.",
  "The next issue of Sunrise will soon be in your inbox.",
  "We encountered an issue signing you up. Please try again",
  "Interested in more newsletters? Browse here.",
  "The IIO sent investigators to gather evidence and interview witnesses. But the process got delayed because of a difference of opinion between the IIO and VPD. The IIO took Vancouver police Chief Adam Palmer and seven of his officers to court over what it considered a lack of cooperation with an investigation into the fatal shooting. The court favoured the IIO and the investigation was completed in December.",
  "In its report, the IIO details how the incident unfolded from the time Rintoul, described as a large man who weighed over 430 pounds, entered the store on Nov. 10, 2016 around 3 p.m.",
  "He went to the hunting desk, bear-sprayed an employee and then stabbed him. He then broke open a gun case and tried to load a long gun but left with just the bear mace and knife.",
  "Rintoul then grabbed another man at knifepoint and tried to leave the store but was immediately grabbed by two police officers outside. Rintoul tried to spray mace at the officers and then stabbed one of them. More officers arrived.",
  "Police were unable to restrain Rintoul with a Taser or the first few gunshots. He kept trying to use the mace on officers until he was fully down and motionless. He was shot nine times and Tasered four times.",
  "A police officer quoted by the IIO in the report said, “I fully believe he would have been stabbing us, unless if we acted.”",
  "Another officer said if Rintoul “continued to get up in the fashion he was getting up then in my mind the only other way to stop that threat would be to use lethal force.”",
  "The IIO concluded that Rintoul “posed a threat of deadly force to the members of the public” and that the officers acted as required. “The evidence collected does not provide grounds to consider any charges against any officer.”",
  "Postmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
]