[
  "Man shot by police had lengthy criminal record; family says 'he didn't deserve this'",
  "A man police once branded as a “high risk” and “prolific” car thief has been identified as the driver fatally shot by police in northwest Calgary this week — but his family says he didn’t deserve to die this way.",
  "Terrence Weinmeyer, 49, died in hospital after he was shot in a crowded strip mall parking lot in the 5000 block of 16th Avenue N.W. on Tuesday afternoon.",
  "According to the Alberta Serious Incident Response Team, which is investigating the shooting, police officers tried to apprehend a man seen driving a stolen blue Dodge pickup truck.",
  "The vehicle had been driven into the parking lot, where the driver got out and went into a nearby business.",
  "Your weekday lunchtime roundup of curated links, news highlights, analysis and features.",
  "By signing up you consent to receive the above newsletter from Postmedia Network Inc.",
  "A welcome email is on its way. If you don't see it, please check your junk folder.",
  "The next issue of Noon News Roundup will soon be in your inbox.",
  "We encountered an issue signing you up. Please try again",
  "Interested in more newsletters? Browse here.",
  "While police vehicles were being positioned to box in the stolen vehicle, the man came out of the business, got back in the truck and rammed two police cars, ASIRT said.",
  "“During their attempts to contain the man and the vehicle, two officers fired their service weapons,” said ASIRT, a civilian oversight body that investigates incidents involving police that have resulted in serious injury or death.",
  "Court records show Weinmeyer had a long criminal history.",
  "He was released Nov. 8 on $200 cash bail with conditions, including not to be in a motor vehicle without the registered owner, stemming from two charges of possession of stolen motor vehicles.",
  "He had also previously been convicted on charges of possession of a controlled substance, possession of stolen property, theft, breaking and entering, assault and resisting a peace officer.",
  "When Weinmeyer was arrested in 2009 in connection with a stolen vehicle, police called him a “prolific car thief” with a driving pattern that was “a risk to the public.”",
  "“He will flee from police and he has been known to carry weapons, so given his experience with us he was considered high risk,” a police inspector told Postmedia at the time.",
  "But Weinmeyer’s father, William, said his son’s criminal history was the direct result of cognitive issues and addiction to narcotics.",
  "“Terry had mental issues and drug issues, but that doesn’t mean he deserved to die,” Weinmeyer said. “Everyone makes him out to be some sort of gangster, but if they knew him, he wasn’t like that. He didn’t deserve this.”",
  "Tonii Roulston, Weinmeyer’s former lawyer, called this week’s events “an unfortunate and shocking situation.”",
  "“Mr. Weinmeyer had been very respectful in my interactions with him,” Roulston said.",
  "Police gave few details of the shooting Tuesday night, saying that ASIRT had instructed them not to speak to details of the incident until witnesses had been interviewed.",
  "ASIRT executive director Susan Hughson said there was nothing out of the ordinary in her agency instructing police not to release information.",
  "“It’s not anything new,” Hughson said, explaining police are always asked to stay mum while an investigation is ongoing.",
  "“There’s nothing exceptional about this case as opposed to any other case with CPS,” she said. “We need to collect evidence as opposed to hearsay.”",
  "Hughson said for ASIRT to release information at the onset of an investigation would be equally irresponsible.",
  "“It would look like we were prejudging a matter based on who we spoke to first,” she said. “ASIRT’s goal is that at the end of an investigation we will be able to tell the public what happened.”",
  "“The (public’s) need to know what happened has to be grounded in ensuring the integrity of the investigation.”",
  "The incident was the ninth police-involved shooting this year."
]