[
  "Toronto police say no one died from a Taser in 2016 — but a prominent lawyer disagrees",
  "Annual report says no deaths linked to tasers last year, injuries minimal",
  "A prominent lawyer has called into question a Toronto police report that found no one died from Tasers in 2016 — even though the Special Investigations Unit is still looking into the death of 31-year-old Rui Nabico.",
  "Nabico went into medical distress after police fired a stun gun at him in November 2016; he was pronounced dead in hospital, according to an SIU spokesman at the time.",
  "​\"How can the report be filed with that sentence in it?\" Peter Rosenthal asked the board members Thursday. \"There's no question [Nabico] died after being Tasered by a Toronto Police officer. He went into medical distress.\"",
  "Missing critical information",
  "Rosenthal, who has represented the families of those killed by police, said that the report does not provide a full picture of the deaths and injuries associated with stun guns.",
  "The Toronto Police Services Board received the report Thursday, the fifth annual analysis looking at how many times, where, and under what circumstances officers used the stun guns.",
  "The document described Tasters as \"effective tools that have prevented injuries to the public and police officers,\" but did acknowledge that deaths and injuries have occurred in the past.",
  "The report found that an annual average of about three injuries are directly attributed to Tasers, based on data collected for the past five years.",
  "Chief Mark Saunders stood by the report's findings — and the exclusion of Nabico from it.",
  "\"There's no secrecy in what was said and what was measured,\" he said.",
  "Saunder said the SIU has yet to release its findings into the man's death, which is why it wasn't included in the report.",
  "\"We don't know a cause of death, period,\" said Saunders. \"So we don't say that it's caused by a Taser until we are told so.\"",
  "The SIU just released a report Thursday into the 2015 death of Rodrigo Almonacid, which found that he died due to cocaine toxicity, the chief noted, and not because he was Tasered eight times.",
  "But Rosenthal said the investigation into Nabico's death should have been included.",
  "\"Two or three years from now, when it goes to an inquest, are you going to make a correction?\" he asked the chief.",
  "Rosenthal also questioned the report's conclusion that last year there were only six minor injuries directly related to Taser use — cuts to the head, chin and lip as well as a swollen eye were considered secondary injuries, because the subject fell after being stunned.",
  "The report asserts that the weapon was used 324 times during 292 incidents last year. In 98 per cent of those cases there were no injuries, it found.",
  "Field officers for Toronto police carry a collective 568 Tasers, the bulk of which are given to the Emergency Task Force and front-line supervisors."
]