[
  "Who was Sam Maloney? Man killed during standoff with police had been secretly living a double life",
  "A fixture at dorm parties and other student events, Samuel Maloney led a busy social life at his Western University residence.",
  "Though the first-year computer science student was almost twice as old as his teenage friends at Western’s Ontario Hall — he told them he was 21 — Maloney was fitting in well.",
  "But the 35-year-old — the man shot dead by London police in a standoff two days before Christmas — had been secretly living a double life.",
  "While soaking up the campus life during the 2015-2016 school year, he owned a house just a short drive away in London’s Old South neighbourhood, where his common-law wife and their newborn baby lived.",
  "So, who exactly was Maloney?",
  "A Free Press investigation reveals there were many sides to the computer programmer killed during the pre-dawn police raid Dec. 23 at his home at 56 Duchess Ave., after a crossbow was fired at an officer.",
  "Police had arrived at the house with a search warrant.",
  "The fatal shooting — London’s first by police in 17 years — remains under investigation by Ontario’s police watchdog agency, the Special Investigations Unit (SIU), and police aren’t talking.",
  "Maloney, those who knew him say, was a talented computer programmer devoted to building a free open-source data storage system that he touted for its potential to change the world.",
  "He was a father trying to raise his two young kids organically and privately behind closed curtains in the heart of London, where his unkempt property drew the attention of the city’s bylaw enforcement office.",
  "To neighbours, Maloney was an enigma, a mysterious figure rarely seen outside his red-brick bungalow that police also raided in 2007, seizing four weapons and thousands of rounds of ammunition. Charges against Maloney in that case were ultimately withdrawn.",
  "Online, Maloney was an anti-establishment, free-speech promoter whose postings under various handles included rants on topics such as immigration, racial mixing and so-called white genocide.",
  "And then there was Maloney the Western freshmen, an outgoing student who never let anyone step foot inside his dorm room.",
  "Maloney grew up the oldest of four brothers in Newmarket, a commuter town on Toronto’s outskirts, where he met his life-long partner, Melissa Facciolo, in elementary school.",
  "Melissa Facciolo (Instagram)",
  "“They were sweethearts in Grade 7,” said Maloney’s father, Peter, who now lives in St. Thomas.",
  "The elder Maloney said he bought Commodore 64s for his boys, the early 1980s-era home computer that turned a generation onto the unfolding digital revolution.",
  "It was a gift that had a life-changing effect on his oldest son.",
  "“And that was the start of his computer career,” he said.",
  "After graduating high school, Maloney decided to forgo post-secondary school, easily landing a string of jobs and freelance contracts in Toronto’s software industry.",
  "56 Duchess Ave., where Samuel Maloney was shot by police. Craig Glover/The London Free Press",
  "Tired of commuting to Toronto from Newmarket, Maloney and Facciolo moved to London in 2004, buying the red-brick bungalow on Duchess Avenue, a quiet street located just a few blocks from Wortley Village.",
  "Maloney worked various jobs in the tech industry, while Facciolo ran a successful graphic design business from the their home.",
  "From the outside, life appeared to be going well for the young couple until 2007, when police seized the large weapons cache, including four loaded guns and 13,000 rounds of ammo during the raid on their home.",
  "The weapons were legally registered but not properly stored, police said at the time. Maloney, then 26, was charged with five counts of unsafe storage of a firearm and ammunition.",
  "The 2007 seizure came after Canada Border Service Agency officers tipped off London police about two people they arrested trying to bring 22 banned, high-capacity ammunition magazines into Windsor. Facciolo, then 25, was charged with smuggling prohibited goods. After pleading guilty in 2008, part of her sentence was a 10-year ban on owning any weapons or ammo.",
  "Over the past few years, Maloney worked to create an open-source program called MORPHiS, which promised to be the “next generation of the Internet,” available to all and still operating after his death. He also created a spam-free email system available on MORPHiS.",
  "From the 'About' section on morph.is, the open-source web program Samuel Maloney was working on.",
  "“If MORPHiS is successful, I believe it has the potential to connect us all on a trust-based system via the next generation of the Internet, depracating (sic) necessary evil, making mass government surveillance impossible and . . . future possibility of dissolving human conflict into unity,” text on the website reads. “I am doing this all for free for all humanity because I hate evil.”",
  "The idea behind open-source systems is to create communication lines and information sharing and storage capabilities on the Internet that aren’t censored. The instructions for building or working the system — also known as the source code — are open to anybody, unlike that used by Microsoft for instance.",
  "It isn’t uncommon for open-source developers and users to shun government surveillance and authority, according to information technology experts. The very purpose is to share and store information independently without government involvement or knowledge. That said, those who go so far as to dedicate themselves to such projects are more likely to have a fear or concern about Big Brother-style government.",
  "The anti-government stance also appears in online chats with Maloney’s name, talking about life without government surveillance and ranting about racial mixing and white genocide. The comments also come from online aliases that Maloney used, such as MorphisCreator and Thufir.",
  "Suspicion and distrust of government and authority were pervasive in social media accounts linked to Maloney and shine through in a string of recent blog posts to the MORPHiS website detailing the couple’s clashes with city officials.",
  "Neighbours described Maloney as reclusive and said they rarely saw him outside the house, where, they say, the blinds were always drawn, the lawn rarely cut and the garbage always overflowing.",
  "Maloney’s unkempt property drew the attention of city bylaw officials, who paid the house a visit last summer with police backup.",
  "A blog post dated Dec. 17 describes the incident and contains photos of Facciolo with her infant strapped to her chest, surrounded by police and city workers outside.",
  "“I told them they were not allowed to cut the grass and to leave because they were trespassing, but to no avail, because they would not listen to reason the entire time . . . I was outside for hours and hours trying to show them the bylaw, but they were too keen on murdering our grass and harassing my family to see what I was showing them,” the post reads.",
  "Maloney had another run-in with authorities on June 19, when police were called to the Hindu Cultural Centre in London.",
  "An exterior view of the Hindu Cultural Centre, where Samuel Maloney was charged by police after visiting in June. Craig Glover/The London Free Press",
  "Priest Pandit Durgesh Tiwari said a visibly distraught man entered the centre while a study group was in session. The man was offered water and stayed until it was time to lock up the building before the group called paramedics, who alerted police after arriving.",
  "Maloney was charged with one count of obstructing police, two counts of assaulting police, mischief valued at less than $5,000 and failure to leave a premises. Those charges were still before the courts at the time of his death.",
  "Another blog entry dated Dec. 17, apparently from Maloney’s partner, said he went to the east-end cultural centre to learn more about religion, but became dehydrated after jogging there. The entry says Maloney refused treatment from paramedics and was violently arrested by police while returning home. Photos of a bruised Maloney accompany the post.",
  "Maloney’s father said his son’s interest in eastern religions was part of the reason for enrolling at Western in 2015, saying he chose to live in residence to stay focused on his school work.",
  "“He was searching for God,” the elder Maloney said of his son, who was raised Catholic.",
  "Fellow computer science student Katherine Zambrano, who lived in Ontario Hall with Maloney, said she first met him at a party.",
  "Ontario Hall, a residence at Western University where Samuel Maloney lived and passed himself off as a 20-something. Dale Carruthers/The London Free Press",
  "“I never really saw him in class, but I didn’t think that was weird because a lot of people in computer science never go to class,” she said.",
  "Zambrano said she and Maloney once planned to collaborate on a project, but he stopped answering her texts and didn’t answer the door when she went to his room.",
  "Maloney always attended residence parties and social events, said Zambrano, who thought it was strange that Maloney stuck around residence during spring break when most of the other students returned home.",
  "Several people who knew Maloney from his time at Western said he told them he was in his early twenties and never mentioned his family.",
  "His Facebook page, which lists his birthday as Jan. 22, 1994, features photos of Maloney posing with his arms around other students, many of them wearing Western shirts. The account was created on Sept. 22, 2015, and doesn’t appear to have any photos or references to his partner or children.",
  "Maloney’s friends from Western, none of whom were aware of his death, reported seeing him less during the second semester before losing contact with him over the summer.",
  "In the early-morning hours of Dec. 23, residents on Duchess Avenue say they saw around two dozen tactical officers swoop in on Maloney’s house.",
  "As police moved in, Maloney called his lawyer, Nick Cake, who told him to put his hands up.",
  "Cake said he heard shouting from an authoritative male voice and Facciolo screaming before four shots rang out.",
  "Sources say an officer was shot with a crossbow during the confrontation. The officer, who had minor injuries, was struck in the chest but saved by the protective Kevlar vest worn by emergency response team members.",
  "Melissa Facciolo, second from left, leaves the London courthouse after a bail hearing with lawyers Phil Millar, left, and Nick Cake. Morris Lamont/The London Free Press",
  "Facciolo, 35, was arrested on charges of possession of a weapon and ammunition while prohibited, related to the crossbow, and spent Christmas in jail.",
  "Peter Maloney said he and his wife cared for the couple’s young children — a two-year-old son and a six-month-old daughter that Facciolo’s still breastfeeding — until his daughter-in-law was released on bail Dec. 29.",
  "Now staying with her father in Newmarket, Facciolo couldn’t be reached for comment.",
  "London police won’t reveal any details about why they were at Maloney’s house on Dec. 23, citing the SIU investigation.",
  "Police were there to serve a warrant, but no other details are known because the warrant is sealed.",
  "Less than two weeks before the raid, police launched a cyber investigation after the Hyland Cinema’s website and email letter was hacked by someone who posted a racist manifesto and linked to an anti-Semitic video on MORPHiS.",
  "The name at the bottom of the manifesto, which included a rant against the mixing of races, was Sam Maloney.",
  "Theatre co-owner Moira Adlan declined comment on the investigation, but she confirmed Maloney and Facciolo worked for the cinema for the past decade — Facciolo as the graphic designer, Maloney as the web developer.",
  "“We are really, really sad. We worked with them for 10 years and this is a big loss,” said Adlan, whose Whancliffe Road cinema is located around the corner from the couple’s house.",
  "Adlan said she doesn’t know if the police raid on Maloney’s house was linked to the investigation into the Hyland hacking.",
  "“We are really sad about everything. We are sad that our members had to be exposed to hate propaganda. And we are sad about this.”",
  "Adlan said she knew nothing about Maloney’s political views or about the hateful online comments linked to his profiles.",
  "“He programmed our website. It was driven by a database. He created the database website that had a user-friendly back end. It’s quite well done,” she said. “I never met him.”",
  "The SIU, which probes all cases of civilian death or serious injury involving police, remained inside Maloney’s home until earlier this week. The agency has said three officers are subjects in its investigation and 18 others are witnesses.",
  "A hand-written note on the damaged front door of Maloney’s house asks people to use the rear entrance.",
  "Inside, Maloney’s blood stains the walls and contents are strewn about from the police search, said his father, who wouldn’t talk about his son’s mental health.",
  "“I can’t really talk about that,” he said.",
  "But the grieving father said he’s desperate for answers and wants to know why so many officers raided a house with young children inside.",
  "“I’d like to know why there was 21 police. Sounds like overkill, doesn’t it?,” the elder Maloney asked.",
  "“He’s not a terrorist.”",
  "Don't have an account? Create Account"
]