[
  "WINNIPEG — The Independent Investigation Unit (IIU) has finished its investigation into an officer involved shooting that killed 24-year-old Mark Dicesare.",
  "The police watchdog concluded no charges should be laid against any officer involved.",
  "IIU director Zane Tessler said the actions of the police officers were justified and unavoidable.",
  "“It is clear that the affected person was intent on taking his own life,” Tessler said. “At one point he indicated words to the affect of ‘I’m going to have you guys do it for me. I’m so sorry.'”",
  "On Nov. 6, 2015, Dicesare, 24, was shot after a police chase through through Charleswood, River Heights and Tuxedo.",
  "The police chase started at 12:30 p.m. when Dicesare was spotted driving erratically in the Charleswood area and an officer called for backup, police said.",
  "The deputy chief at the time, Danny Smyth, said the pursuit went on for some time before ending in an open field.",
  "Witnesses said the car hopped over a median before continuing into the open field on the northwest corner of Kenaston Boulevard and Grant Avenue.",
  "On Thursday, the 41-page long report confirmed Dicesare took police on a 22 kilometre chase before being surrounded in an open field by 19 cruisers.",
  "You can read the full IIU report below:",
  "That’s when officers engaged in a 23 minute stand off.",
  "The investigation said Dicesare had what appeared to be an Uzi submachine gun. However, afterwards it was found to be a lookalike that was actually an unloaded air gun.",
  "The IIU said he “exited the vehicle, twice; with a firearm pointed under his chin. When he pointed the firearm towards police, five officers fired at the man, causing his death.”",
  "“Police at this point in time had very few options,” Tessler said. “The choices available to them diminished rapidly.”",
  "One officers statement said:",
  "“(Dicesare) then stated ‘I can’t do it’, (he) turned to my partner at the passenger side of the cruiser car and stated ‘buddy, you have a clear shot, so I’m going to make you do it.’ At the same time, (Dicesare) lowered his gun and pointed it directly at my partner. At this time, I recognized that the male completed all components of a threat assessment; weapon, intent and delivery system. Without any hesitation or doubt I knew that if I waited any longer, my partner would be shot and killed by the male. At this time, I recall the metallic sound of the bolt assembly of my rifle compressing and the bolt sliding forward again. Sounds consistent of when the rifle is fired and another round is chambered. I observed the male drop his gun in front of him, his body slowly starting to lose its rigidity and collapse to the ground.”",
  "Officers fired 15 times and Dicesare was hit by nine bullets from carbines, handguns and a shot gun.",
  "The five officers who eventually fired their weapons were all interviewed.",
  "Communications from the stand off revealed Dicesare wanted to end his life by having police shoot him.",
  "The IIU investigation found two video recordings on Dicesare’s cell phone.",
  "“Hey guys, I just want to let you guys know before I go, I um, I had a good life OK? I had fun, I uh … I’m so sorry guys,” Dicesare emotionally said.",
  "Over the course of 32 minutes, Dicesare was asked 33 times by police to drop his weapon and surrender.",
  "Thirty-eight officers and 96 witnesses were identified and interviewed."
]