[
  "2 Ontario police officers charged in death of Indigenous woman",
  "OPP officer involved in Debra Chrisjohn's death is on active duty, according to police force",
  "Two police officers have been charged in the 2016 death of Debra Chrisjohn, of Oneida Nation of the Thames, according to Ontario's police watchdog.",
  "The Special Investigations Unit announced Thursday that Ontario Provincial Police Const. Mark McKillop and London police Const. Nicholas Doering are facing charges of criminal negligence causing death and failing to provide the necessaries of life. Both officers are still on active duty.",
  "The SIU investigates incidents involving police where there has been death, serious injury or allegations of sexual assault.",
  "On the afternoon of Sept. 7, 2016, police were called to Trafalgar Street and Highbury Avenue North in the east end of London.",
  "The SIU said there were reports of a woman obstructing traffic at the intersection.",
  "Chrisjohn, 39, was arrested by London police and then transferred to the Elgin County OPP detachment on an outstanding warrant.",
  "Paramedics took Chrisjohn to St. Thomas Elgin General Hospital at 7:52 p.m. She was pronounced dead almost an hour later.",
  "Her cause of death has not been released.",
  "An SIU team comprised of four investigators and one forensic specialist examined the case.",
  "OPP said McKillop is on active duty with the force, while Doering is carrying out administrative duties with the London police.",
  "\"We're always concerned whenever a member of the OPP finds themselves facing any criminal charges,\" said Sgt. Chrystal Jones, a spokesperson for the provincial force.",
  "Jones directed questions about the investigation back to the SIU, as did the London police.",
  "\"These charges being laid send a strong message that Indigenous lives matter and highlights the treatment of our missing and murdered Indigenous women across Canada,\" said Charity Doxtator, acting chief of the Oneida Nation of the Thames.",
  "Doxtator said the community is hopeful that the investigation leads to changes in the way police services treat Indigenous people."
]