[
  "Met officer Tasered man 'because he feared attack'",
  "PC Imran Mahmood, 36, is accused of causing grievous bodily harm to Jordan Walker-Brown during a patrol in the early months of the first lockdown in 2020.",
  "Mr Walker-Brown, 23, was left paralysed from the waist down after falling backwards over a fence, hitting his head on the footpath behind and breaking his back.",
  "PC Mahmood does not dispute inflicting serious injury, but denies his actions were unlawful.",
  "The trial continues",
  "A Metropolitan Police officer who left a man with \"catastrophic\" life-changing injuries after Tasering him has told Southwark Crown Court he believed the man had a weapon on him and could have attacked him.",
  "PC Imran Mahmood, 36, is accused of causing grievous bodily harm to Jordan Walker-Brown during a patrol in the early months of the first lockdown in 2020.",
  "Mr Walker-Brown, 23, was left paralysed from the waist down after falling backwards over a fence, hitting his head on the footpath behind and breaking his back.",
  "PC Mahmood does not dispute inflicting serious injury, but denies his actions were unlawful.",
  "Giving evidence on Thursday, PC Mahmood described how he was one of a group of nine officers from the Met's territorial support group who were in a police vehicle when they saw Mr Walker-Brown walking down a road in Haringey, north London.",
  "The defendant told jurors he thought Mr Walker-Brown was wearing a small bag around his waist, and his suspicion of Mr Walker-Brown was \"heightened\" because such bags were often used to conceal weapons or drugs and he did not seem to be out for shopping or exercise.",
  "The court heard PC Mahmood and a colleague began following him on foot when Mr Walker-Brown started running away from them, climbing on top of a wheelie bin and scrambling on to an adjacent wall.",
  "The defendant told the jury Mr Walker-Brown reached for his waistband while running and did not respond when asked to stop.",
  "PC Mahmood added he believed Mr Walker-Brown had a knife and was going to attack him, so needed to be \"contained\".",
  "He told the court: \"I saw that imminent threat. I thought Mr Walker-Brown was in possession of a weapon.\"",
  "PC Mahmood said he discharged his Taser because Mr Walker-Brown moved towards him from his high-up position.",
  "On hearing this, Mr Walker-Brown left the courtroom in his wheelchair, returning later.",
  "The defendant continued by saying he had believed Mr Walker-Brown would fall on to the bins, and he denied anticipating the possibility of causing serious injury.",
  "Speaking about the aftermath of the incident, PC Mahmood told the court: \"It has been really hard for me.",
  "\"It has affected me massively - not only myself; my family. I was just trying to do my job.\"",
  "PC Mahmood will continue giving evidence on Friday."
]