[
  "Woman fatally injured during arrest by Gatineau police identified",
  "Nadia Racine, 34, succumbed to injuries Wednesday night",
  "Quebec's Bureau des enquêtes indépendantes is investigating after a woman died following her arrest by Gatineau police Tuesday. (Stéphane Beaudoin/CBC)",
  "Quebec's coroner has identified a woman who died after being critically injured during an arrest in Gatineau Tuesday night.",
  "Nadia Racine, 34, was taken to hospital after police were called to her apartment complex at 24 Rue Charles-Albanel to address a noise complaint.",
  "Gatineau police said officers responded to a noise complaint at 24 Rue Charles-Albanel at 6:14 p.m. Tuesday.  (CBC)",
  "BEI spokesman Martin Bonin-Charron said when police arrived at Racine's apartment there was no answer at the door, so they forced their way in. Once inside, police found Racine in a state of \"mental distress.\"",
  "\"She was banging her head around the apartment,\" said Bonin-Charron. ",
  "Police placed handcuffs on Racine, but Bonin-Charron didn't know the precise series of events leading to the woman's injury. ",
  "\"The police officers, they handcuffed her before realizing she was in [medical] distress,\" he said.",
  "Neighbour called 911",
  "",
  "Shawn Lescard says his downstairs neighbour, Nadia Racine, was quiet and kept to herself. (CBC)",
  "Racine's neighbour Shawn Lescard, who lives in the apartment directly above hers, said he called authorities when he heard screaming and banging coming from below.",
  "\"It sounded like she was getting beaten,\" he said. \"I wanted to save her life. I thought she was getting beaten and that's why I called the cops. Now ... she's passed away.\"",
  "Lescard said he first called 911, but was told to call Gatineau police's non-emergency phone line instead. ",
  "\"She seemed like a good person. Quiet. She [kept] to herself. It's pretty sad the way she went,\" he said.",
  "The BEI has assigned eight investigators to the case and will be receiving assistance from the Sûreté du Québec.",
  ""
]