[
  "Officer in 'imminent danger' when he killed homicide suspect, SIU rules",
  "An Ottawa police tactical officer who fatally shot a fleeing and armed homicide suspect in the head was justified in using lethal force against an “imminent danger,” the civilian police watchdog has found.",
  "The Special Investigations Unit has cleared Const. Aaron Reichert of any wrongdoing in the death of 31-year-old Raymond Alliman in June 2017. Alliman had first shot and injured Bun Sim, then moments later fired again, killing Sim’s best friend, Terrence Phillips, in an early morning shooting spree in the ByWard Market.",
  "SIU director Tony Loparco’s decision, which does not identify any of the injured, dead or the subject officer, was released Friday, nearly one year to the day of the shootings, though the report appears to have been completed in March. It finds that Reichert had no other choice but to fire his gun to save his own life.",
  "Reichert was patrolling the market just after bars closed on the morning of June 3, 2017. In an unrelated event, he saw three men carrying a street sign and approached them when he heard the single gunshot in the area of Dalhousie and Murray streets.",
  "Sim had been shot at the Market Cleaners at 286 Dalhousie St. Sim and his friends were leaving a birthday party when they had an altercation with Alliman on the street.",
  "By the time Reichert got out of his police vehicle, he saw a group of men chasing Alliman on foot. Reichert got back in his vehicle, pursuing the group, who indicated to him that it was Alliman who fired the bullet moments earlier.",
  "Reichert pulled up next to Alliman, drew his gun and tried to arrest him while still inside the vehicle, but Alliman kept running. Reichert chased after him on foot to a city-operated parking garage at 137 Murray St. At that point, the officer heard another gunshot. Alliman had just shot Phillips, who “stumbled out of the parking garage clutching his chest.”",
  "Alliman continued running, going up a ramp to Level 3 of the parking garage.",
  "Reichert, with his gun drawn, continued to shout at the man who had just shot two men, to get down on the ground. Alliman then suddenly turned and pointed his 9 mm semi-automatic pistol at Reichert.",
  "Reichert told the SIU that he could see the barrel of the gun being pointed at him and had “no doubt” that Alliman was prepared to kill him.",
  "Reichert fired nine times and Alliman went down between two parked cars. The officer didn’t know if any of the bullets he fired had struck the suspect. He waited behind a concrete pillar for backup to arrive.",
  "Only 76 seconds had passed from Reichert’s first radio dispatch saying he thought he had heard a gunshot to the officer telling dispatch that Phillips was bleeding out.",
  "Alliman was pronounced dead at the scene, his gun with the serial number ground off nearby, while Phillips, shot while going after the man who had shot his best friend, was taken to hospital. He was pronounced dead at 3:13 a.m.",
  "All Ottawa police officers who were witnesses were interviewed and provided their notes to the watchdog, which they are legally required to do. Reichert volunteered to both be interviewed and turn over his notes, neither of which he had to do.",
  "Loparco found that the officer “had no reasonable option other than to fire at the (suspect) in order to save his own life; no other use of force option at his disposal would have had the ability to save his life in these circumstances.",
  "“I find in all of the circumstances that the (officer) reasonably believed that his life was in danger from the (suspect) and thus he was justified in the use of lethal force,” Loparco wrote. The director found that it would have been “foolish and reckless” for Reichert to have waited to see what Alliman would do “when it was clear that he had already fired on one, if not two, men in the preceding minutes.”"
]