[
  "All charges were dropped against a Black man after bodycam footage released earlier this week shows two Phoenix police officers shouting orders at him as he’s lying face-down on the ground – with one officer repeatedly punching him and another officer tasing him.",
  "Tyron McAlpin, 34, is deaf and no longer accused of an alleged crime that prompted officers to physically confront him in a parking lot the morning of August 19. The Maricopa County Attorney’s Office decided to drop an initial charge of theft against him, the office told CNN Tuesday.",
  "But until Thursday evening, McAlpin faced two counts of aggravated assault and one count of resisting arrest after Phoenix police said he took a “fighting stance” when first approached by an officer. The local police union said the officers came “under immediate attack” – a notion disputed by others who watched the footage.",
  "Maricopa County Attorney Rachel Mitchell said she reviewed the case against McAlpin and “convened a large gathering of senior attorneys and members of the community” to get their opinions, and decided to drop “all remaining charges,” according to a statement from her office Thursday.",
  "“On behalf of Tyron and his family, we are overjoyed,” McAlpin’s attorney Jesse Showalter told CNN by phone. “Rachel Mitchell has done the right and just thing after an independent review. These were unjust charges brought against Tyron and we are deeply saddened that the City of Phoenix and its officers allowed the case to progress as far as it did.”",
  "“This case highlights continuing issues with the city of Phoenix, Phoenix police and its police culture. We look forward to obtaining accountability and justice from the City of Phoenix,” he continued. CNN has reached out to a city spokesperson and the Phoenix Police Department for comment.",
  "Police were trying to question McAlpin after a man said he was punched by someone who tried to steal his bike, according to an incident report. The man directed police to McAlpin, and officers followed him to a nearby parking lot.",
  "As McAlpin walks across the parking lot, one officer calls out to the deaf man from his police car, the bodycam footage shows.",
  "“Hey buddy, stop where you’re at,” the officer says. “Have a seat.”",
  "The officer then gets out of his car, and within seconds, a scuffle ensues.",
  "“His hands raised to deliver targeted punches at my face/head, and multiple swings with closed fists at my head,” the first officer who confronted McAlpin wrote in an incident report.",
  "Surveillance footage from a nearby business shows the police car driving up to McAlpin. Within seconds, an officer gets out of the car and lunges toward McAlpin.",
  "Body camera footage shows the officer was the first to outstretch his arms toward McAlpin while McAlpin’s arms remained by his side.",
  "Almost instantly, McAlpin raises his arms up. Less than a second after that, both the officer and McAlpin are tangled in a brawl.",
  "A second officer comes to help pin McAlpin on the ground, face-down. But McAlpin’s right hand is still in front of his body.",
  "“Put your hands behind your back!” the first officer shouts to the deaf man. “Hand behind your back, now!”",
  "When McAlpin doesn’t comply and lifts his head slightly, the other officer punches his head down.",
  "One officer tases McAlpin several times before he is handcuffed and taken away. At one point, the officers describe their injuries from the confrontation:",
  "“I think I broke my hand,” the first officer says. “Did he bite you?”",
  "“Yeah,” the second officer replied.",
  "Shortly afterward, a woman arrives at the scene identifying herself as McAlpin’s wife, the bodycam footage shows.",
  "“That’s my husband. He was on the phone with me,” said the woman, later identified in a police incident report as Jessica Ulaszek.",
  "“Well, he’s under arrest for assault on a police officer,” an officer tells her. “He assaulted somebody at the Circle K. If you can wait over there, I’ll tell you right about it, in a little bit.”",
  "Ulaszek tells officers her husband is disabled, and the two were communicating on the phone via sign language.",
  "“He’s deaf and he’s got cerebral palsy. And I’ve been on the phone with him since Circle K,” Ulaszek said.",
  "“I’ve been on the phone with him the whole time. He didn’t assault nobody.”",
  "The body camera footage shows fire department medics responding and assessing McAlpin while he lay on the ground. The police incident report indicated he was taken by ambulance to a hospital “for precautionary measures.”",
  "The two officers have not been placed on administrative leave pending an internal investigation and are actively working, the Phoenix Police Department told CNN Tuesday.",
  "“This incident is the subject of an ongoing internal investigation and was assigned to the Professional Standards Bureau on August 30, 2024,” Phoenix Police said in a statement.",
  "Attorney: Police rushed McAlpin so quickly, ‘Nobody could have avoided their attack’",
  "It took less than two seconds for the first officer to get out of his police pickup truck and put his hands on McAlpin. The officer later acknowledged he had already decided to detain McAlpin before getting out of his truck.",
  "After the officer drove toward McAlpin in the parking lot, gave a “loud verbal order” and used the truck to block McAlpin’s path, he wrote in an incident report. “Tyron changed direction 90 degrees with a quick step,” the officer said.",
  "“Having reason to contact Tyron as a suspect of an assault I decided to detain him,” the officer’s report states. “I quickly exited my vehicle to take hold of Tyron’s left arm, and he immediately engaged in active aggression by swinging punches at my head, beginning with his left arm.”",
  "But surveillance video shows McAlpin was looking down at his phone while walking across the parking lot. He appears to look up only when he notices the pickup truck driving right in front of him and turns to walk around the truck.",
  "Less than two seconds after McAlpin turns to his right, the officer rushes McAlpin and grabs his shoulders. The impact knocks off an article of clothing that was draped over McAlpin’s shoulder. The two tussle for several seconds before another officer helps pin McAlpin on the ground, face-down.",
  "Related article Phoenix police violated the rights of homeless residents and minority communities, DOJ report finds",
  "The first officer “gave multiple commands to put his hands behind his back and the suspect continued to not comply to commands,” the second officer wrote in an incident report.",
  "“I struck the suspect with a closed right fist in the center of his back, and gave him an opportunity to present his right arm. After there was no response I struck the suspect one time with a closed right fist to the right side of his face.”",
  "The deaf man repeatedly tries to lift his head up. He moans and screams as one officer tases him and the other officer punches him in the back of the head.",
  "“Tyron did nothing to warrant police contact of any kind,” his attorney Jesse Showalter told CNN.",
  "He said the officers violated McAlpin’s Fourth Amendment rights, which protect against unreasonable search and seizure.",
  "“The officers advanced on Tyron so quickly that nobody could have avoided their attack.”",
  "In addition to his deafness, which prevented McAlpin from understanding the officers’ commands as he lay face-down, “Mr. McAlpin’s cerebral palsy affects his ability to control his limbs and his fine motor skills,” his attorney said.",
  "Showalter said police misinterpreted a symptom of cerebral palsy – contracture in the hands – as aggression when the first officer “attacked” McAlpin “without warning.”",
  "“A careful review of the video shows that his hands are contracted throughout and that he was not making fists at any point,” he said.",
  "Police union: The officers were ‘under immediate attack’",
  "The Phoenix Law Enforcment Association defended the officers and urged the public to not jump to conclusions.",
  "“While some in the media are making this incident about race and discrimination, it is really about 2 police officers in full Phoenix Police uniform driving fully marked police cars coming under immediate attack by someone who was alleged to have committed a crime,” the union said in a statement to CNN affiliate KNXV.",
  "The union said McAlpin “resisted arrest after immediately becoming combative with our officers who wanted to question him.”",
  "“Our officers have the right to defend themselves against attack by utilizing reasonable and necessary force based on the circumstances presented at the time,” the union said.",
  "“We stand behind our officers and would caution the community on making judgments about the incident until all evidence is reviewed rather than a snippet of body cam footage.”",
  "CNN has reached out to the Phoenix Law Enforcement Association for comment on the charges against McAlpin being dropped.",
  "Earlier this year, the Department of Justice released a report saying the Phoenix Police Department violated the constitutional rights of homeless people and disproportionately enforced laws – negatively impacting minorities, including those with behavioral health disabilities.",
  "“Tyron McAlpin’s story shows that change is necessary, that the DOJ’s findings were true,” his attorney said.",
  "The county’s top prosecutor takes a fresh look at the charges against McAlpin",
  "Critics of the officers’ behavior prompted calls to drop the charges against McAlpin, which the district attorney’s office did Thursday evening.",
  "“The continued demands to comply and follow commands was not being heard,” J.J. Rico, CEO of Disability Rights Arizona, told KNXV. “So now to raise allegations that he was not complying, you have to consider the disability.”",
  "“Disgust is probably the best way I can say it,” Sarah Tyree, president of the NAACP’s Arizona conference, told KNXV. “It’s just another stark reminder of where we are.”",
  "The public outcry prompted Maricopa County’s top prosecutor to personally review the case.",
  "Related article This police chief’s reforms could be a model for other communities",
  "“Last Friday, a leader of the local chapter of the NAACP shared his concern with me regarding the prosecution of Mr. Tyron McAlpin. I promised I would personally review the case including a large volume of video recordings, police reports, and other materials that have been forwarded to my office,” Maricopa County Attorney Rachel Mitchell said in a statement Thursday.",
  "“On Tuesday of this week, I also convened a large gathering of senior attorneys and members of the community to hear their opinions as they pertain to this case,” she said. “I have now completed my review and have made the decision to dismiss all remaining charges against Mr. McAlpin.”",
  "Mitchell did not specify why she decided to drop the charges.",
  "During a preliminary hearing on McAlpin’s case, both officers involved in the scuffle said they don’t recall much training on how to handle hearing-impaired subjects, KNXV reported.",
  "“That’s about seven years ago. I don’t really remember much of it,” the first officer testified.",
  "“Have you received any training in dealing with members of the public who have disabilities?” McAlpin’s attorney asked the second officer.",
  "“Maybe briefly, but nothing that I recall,” he replied.",
  "CNN’s Josh Campbell and Taylor Romine contributed to this report."
]