[
  "Winnipeg police officers cleared in fatal shooting of carjacking, robbery suspect",
  "Wooden fake gun looked real, Manitoba's police watchdog rules",
  "Shooting a suspect brandishing a replica gun was \"justified and unavoidable,\" Manitoba's police watchdog has ruled.",
  "The Independent Investigation Unit was called in to probe the death of Adrian Lacquette, 23, on Sept. 13, 2017.",
  "The police helicopter located Lacquette as he got out of a vehicle, which had been reported stolen, near Powers Street and Alfred Avenue.",
  "\"When officers moved in, he pointed the gun at his own head, refused repeated commands to drop his weapon, and then pointed the gun at officers, resulting in two members of the tactical team discharging their firearms,\" the IIU said in a release. Laquette was also intoxicated by alcohol and cocaine.",
  "Two police officers fired 13 bullets in total at Laquette, according to the IIU report.",
  "Lacquette suffered at least nine gunshot wounds, including three shots to the chest that perforated major organs; others hit his shoulder, pelvis and legs. He had cuts on his scalp and finger that could have been caused by being grazed with a bullet, the report states.",
  "He was taken to the Health Sciences Centre, where he was pronounced dead.",
  "It was later determined he had been carrying a replica firearm.",
  "An extensive investigation by the IIU included interviews with 18 civilian witnesses and 11 witness officers, statements from the subject officers, a review of police radio transmissions, and video from various sources.",
  "\"His action of pointing his weapon at a police officer is consistent with a person who wishes to instigate a police shooting to accomplish that purpose,\" IIU civilian director Zane Tessler wrote in his report on the matter. \"This is an unfortunate yet all too familiar circumstance seen across Canada and the United States in situations similar to this.\"",
  "Laquette's mother, Jo-Anne Malcolm, previously told CBC News she found out about the shooting when she answered a knock on her door around 6 a.m. IIU investigators were there to tell her that her son had been shot by police.",
  "\"My son is well-known to police, but they don't have to treat him like that,\" she said.",
  "Court records show Lacquette was convicted of possession for the purpose of trafficking in 2013 and had a lifetime weapons ban."
]