[
  "Man suffers third-degree burns while being held on hot pavement by Phoenix police",
  "WARNING: This report contains graphic images. Viewer discretion is advised.",
  "As Phoenix police deal with the fallout of the violent beating of a deaf man and face the threat of federal oversight, the department is now set to face a lawsuit after a man suffered third-degree burns across much of his body during a detainment.",
  "Michael Kenyon, who has not been charged with a crime for the incident, spent more than a month hospitalized with burns on his face, arms, chest, and legs.",
  "Some chunks of flesh are now missing from above his knees.",
  "“Phoenix police are demonstrating an utter disregard for human life over and over again,” said Bobby DiCello, one of Kenyon’s attorneys. “This young man was burned to the third degree because his skin was cooked on asphalt.”",
  "When asked again if he believed officers “cooked” Kenyon, DiCello said, “There’s no doubt.”",
  "Phoenix police said Kenyon struggled with their officers and added that the incident is still the subject of a criminal and internal investigation.",
  "The incident happened on the afternoon of July 6, 2024, when the temperature reached 114º in central Phoenix.",
  "See surveillance video of the incident in the player below.",
  "Surveillance video shows Kenyon was stopped by officers and questioned in a parking lot near 7th and McKinley streets. After both sides began pulling against each other, a handful of officers took Kenyon down to the blacktop and kept him there for more than four minutes.",
  "A witness from a nearby balcony began recording in the middle of the incident.",
  "The cell phone video shows Kenyon yelling out, “please… please… I can’t move. I didn’t do anything.”",
  "See the cell phone video provided to ABC15 in the player below.",
  "“The lady across in the high-rise said she thought an animal was dying. That’s why she looked out her window,” Kenyon said during an interview. “And that’s when she started recording me.”",
  "Kenyon and his attorneys provided ABC15 with the surveillance and cell phone videos, but they have not been able to obtain a copy of the incident report from Phoenix police.",
  "Through a public records request, ABC15 also requested the incident report and any body camera footage to hear what happened during the incident.",
  "At the time of reporting, those requests have not been completed.",
  "In an interview with ABC15, Kenyon said he believes officers stopped him because his roommate had recently reported a theft from their home, which is across the street. Police later determined Kenyon was not the suspect in the theft.",
  "Below is Kenyon’s account of the initial interaction.",
  "“So, I walked up to them with my phone in my hand and said, ‘Hey what happened?’ or ‘What’s going on?’… One officer grabbed my one wrist, and the other officer grabbed my other wrist… They said to me in a mean hostile way, ‘You’re being detained.’ But I said, ‘I’m on the phone. What do you mean? I didn’t do anything. Please explain to me.’ And they were like, ‘Why are you getting antsy? Why do you seem like you’re nervous?’ I said, ‘I’m not. You’re scaring me. Can you please explain to me? Let me sit down. Let me sit down.’ I sat down on the back of some random person's truck tailgate.”",
  "Kenyon also described his version of what was happening as he was taken down to the ground.",
  "“They said, ‘Give me your arms. Stop resisting.’ And I think that’s when like five people were on me… And I’m just screaming for help. And I’m scared. And I’m thinking this is literally [how] George Floyd was literally like… And that’s when I’m like this is it, this is me, this is where I guess I’m going to stay at… This is the end.”",
  "Kenyon said he thought of George Floyd because officers were kneeling on his head, neck, and back.",
  "Video does appear to show an officer kneeling on his head or neck during the incident.",
  "Kenyon said the pain was unbearable.",
  "“Like going through hell and hades… Feels like your skin is melting off,” he said.",
  "“Deep down I think to myself, I’ve had a bad past, I don’t deserve a lot of good things in my life. So, I’m like maybe I did deserve this, you know,” he said.",
  "Kenyon added that he wouldn’t wish the pain on his worst enemy.",
  "“No, no I wouldn’t,” he said.",
  "At the time of the incident, Kenyon had an outstanding warrant for failing to appear on a drug charge, court records show. He claims he didn’t know about the warrant, and the department confirmed officers didn't know either at the time.",
  "Medical records show Kenyon spent several weeks in the burn unit at Valleywise Medical Center and then more time in a rehabilitation facility.",
  "He and his attorneys told ABC15 that officers were stationed at the hospital for several days, possibly a week, and often kept him handcuffed.",
  "“They were just outside the room,” Kenyon said. “They had this little clicker thing with the blinds [where they would look through].”",
  "ABC15 is committed to finding the answers you need and holding those accountable.",
  "Submit your news tip to Investigators@abc15.com",
  "He added, “They wouldn’t let me use my phone and contact my family… It took certain cops to break the rules to let me use my phone.”",
  "Kenyon said the officers finally left after a friend called some lawyers and they showed up at the hospital.",
  "“He committed no crime, he’s never been charged with a crime,” DiCello said. “And he spent over a month in a burn unit with police peeping through the windows to see what he was doing.”",
  "Kenyon is now represented by a team of local and national law firms.",
  "The attorneys, including DiCello and Steve Benedetto, also represent dozens of protesters who were falsely charged by Phoenix police – some as members of a fake gang invented by officers and prosecutors.",
  "Those lawyers said Kenyon’s case continues to prove that Phoenix is incapable of policing itself, especially since the incident happened after the Department of Justice released the findings into the city.",
  "The exposure of Kenyon’s incident also comes weeks after Phoenix police faced backlash for the violent arrest of Tyron McAlpin.",
  "The Phoenix Police Department released the following statement to the media regarding this incident:",
  "\"On July 6, 2024, Phoenix police officers responded to the area of 7th Street and McKinley Street regarding a theft in progress. When responding, officers observed an adult male, later identified as Michael Kenyon, who matched the suspect description given for the suspect of the theft.",
  "Officers made contact with Kenyon, telling him he was being detained so they could understand what may have occurred. The man struggled with police, which result with him being taken to the ground on the hot asphalt. The man sustained burns to different parts of his body from the time he was on the ground.",
  "Kenyon was determined not to be the suspect of the theft. He was taken to the hospital and officers learned he had a felony warrant out for his arrest. This incident is the subject on an on-going criminal investigation. An investigation is also being conducted by the Professional Standards Bureau, which began July 9, 2024.\"",
  "UPDATE: After ABC15 reached out to Phoenix police for comment on the burn case, the Maricopa County Attorney’s Office filed criminal charges against Michael Kenyon for a separate incident.",
  "A direct complaint was filed in Maricopa County Superior Court on October 28 at 3:17 p.m.",
  "ABC15 reached out to Phoenix police for comment on Kenyon’s burn case hours earlier – at 6 a.m. the same day.",
  "“We’re still investigating this allegation,” said Stephen Benedetto, one of Kenyon’s attorneys. “The timing of the charges is certainly suspicious, particularly given Phoenix PD’s history. But we’re reserving judgement until we complete our own investigation.”",
  "The new charges are related to an alleged domestic violence incident from March, involving Kenyon and his brother.",
  "The direct complaint, which did not include specific details of the incident, included charges of Aggravated Assault, Assault, and Disorderly Conduct.",
  "In an email to ABC15, the Maricopa County Attorney’s Office responded to the timing of the new charges.",
  "“The incident involved in this case came to MCAO’s attention in March 2024. More specifically, the submittal was processed on March 21, 2024. The prosecutor who is currently assigned to the case received it on October 2, 2024. There was no conversation yesterday between MCAO and PPD regarding this matter,” according to a spokesperson.",
  "Contact ABC15 Chief Investigator Dave Biscobing at Dave@ABC15.com.",
  "Latest ABC15 investigations:",
  "5:01 PM, Jun 16, 2025",
  "5:11 PM, Jun 13, 2025",
  "6:17 PM, Jun 12, 2025",
  "10:50 PM, Jun 11, 2025",
  "Report a typo"
]