[
    "Plainclothes Chicago police officers fired nearly 100 gunshots over 41 seconds during a traffic stop that left one man dead and one officer injured, according to graphic video footage a police oversight agency released Tuesday.",
    "Five officers from a tactical unit who were in an unmarked police vehicle surrounded an SUV last month driven by Dexter Reed, allegedly for failing to wear a seatbelt. Video shows the 26-year-old Black man briefly lowering a window and then raising it and refusing to exit the vehicle as more officers arrived, yelled commands and drew weapons.",
    "The Civilian Office of Police Accountability said preliminary evidence showed Reed fired first, injuring an officer in the Humboldt Park neighborhood on the city’s West Side. Then four officers returned fire, shooting 96 rounds.",
    "The gunshots continued even after “Reed exited his vehicle and fell to the ground,” COPA said in releasing the body-worn camera footage, 911 calls and police reports.",
    "The videos released offer a fuller perspective than what police initially offered last month.",
    "Police Superintendent Larry Snelling previously said the shooting on March 21 began with a traffic stop and described it as an 'exchange of gunfire.'",
    "Family members have questioned authorities’ account of the shooting, looking for answers about why Reed was pulled over. Andrew M. Stroth, an attorney for the family, said Reed’s mother, sister, uncle and father saw the video Tuesday and were emotionally distraught. He said they remember the young man as a talented high school basketball player with ambitions of being a sports broadcaster.",
    "I really can’t explain the pain that me and my family is going through, but I just hope there are people out there who understand he was a son, he was a brother, he was an uncle, he had loved ones,” Reed’s sister, Porscha Banks, told reporters. 'He was somebody very important.'",
    "Banks and other family members joined a demonstration Tuesday night outside the 11th District Police Station, where protestors demanded the firing of the officers who shot Reed. One person was hospitalized after some of the demonstrators clashed with a heckler, the Chicago Sun-Times reported.",
    "Stroth called it an unconstitutional police stop with plainclothes officers who did not announce they were police. He said the family wants to see a swift investigation and for the department to better comply with a court-supervised reform plan.",
    "'Nothing is going to bring Dexter back, but certainly efforts should be taken to make sure this doesn’t happen to another family,' he said.",
    "On Tuesday, police spokesperson Thomas Ahern said the department was cooperating with the investigation.",
    "'We cannot make a determination on this shooting until all the facts are known and this investigation has concluded,' he said.",
    "The videos show multiple perspectives, including from the officer who was shot. But there isn’t clear footage of Reed shooting. A gun was later recovered from the vehicle.",
    "The tactical unit drives up to the scene with multiple officers screaming profanity-laced commands for Reed to first lower the window and then open the door.",
    "Then gunshots erupt. A man calling 911 to report the shooting described it as 'shooting like they’re having a Vietnam War.'",
    "Reed exits the vehicle and slumps to the ground, ending up facedown with his head near the rear passenger wheel and wearing only one shoe. Blood trails into a nearby gutter. Footage of the car shows dozens of bullet holes. The other shoe sits just outside the driver’s door.",
    "“Don’t move! Don’t move!” the officers scream at Reed, lifting up bloody slumping hands in search of a gun but not finding one. They handcuff him as he remains facedown and unmoving.",
    "“I don’t know where the gun is,” an officer says. They later use a flashlight to look into the vehicle and locate the weapon on the passenger seat.",
    "“He started shooting at us,” another officer says.",
    "Afterward more officers and an ambulance arrive on scene.",
    "“All of us were shooting,” one officer says repeatedly.",
    "Mayor Brandon Johnson vowed a full investigation, saying Tuesday’s release was part of an effort to be more transparent.",
    "“Attempts to withhold or delay information are mistakes of the past,” he said at a news conference with COPA and the Cook County state’s attorney’s office. “As mayor and as a father, raising a family, including two Black boys on the West Side of Chicago, I’m personally devastated to see yet another young Black man lose his life during an interaction with police.”",
    "He said the city doesn’t condone shootings against police officers and noted that the officer, who is also Black, suffered a wrist injury but could have fared far worse. Had the bullet gone a few inches in another direction, Johnson said he would be here “talking about the death of another Black man.”",
    "The officers were placed on 30 days of administrative leave amid the investigations from COPA and the Cook County state’s attorney’s office.",
    "State’s Attorney Kim Foxx said her office will determine whether the officers’ use of force was warranted or necessitated criminal charges.",
    "“Let me assure you that our pursuit of justice will be relentless, guided by the facts, grounded in evidence and the law,” she said.",
    "The Cook County medical examiner’s office classified Reed’s death as a homicide and reported that he died of “multiple” gunshot wounds.",
    "COPA was created in 2016 after the city was forced to release dashcam video of then-officer Jason Van Dyke shooting 17-year-old Laquan McDonald, contradicting officers’ account that the teen had lunged at police with a knife. Its responsibilities include investigations of shootings by police.",
    "The police department has been under a consent decree since 2019, handed down after the U.S. Justice Department found a long history of racial bias and excessive use of force following McDonald’s death.",
    "The independent monitoring team overseeing the department’s compliance has repeatedly found it falling behind on deadlines and specific goals and last year called on Snelling as the incoming superintendent to 'address challenges that have disproportionately delayed progress.'"
]