[
  "Man killed by police was facing eviction and distressed, neighbours say",
  "A distressed man shot dead by Montreal police in his subsidized housing unit Tuesday night was facing eviction from his apartment on July 1 and appeared to have mental health problems, his neighbours said.",
  "The Quebec rental board issued an eviction order against Pierre Coriolan on June 1 because he had been disturbing the peace in the complex and tried to start a fire in his studio apartment, said Claudine Laurin, director general of la Fédération des OSBL d’habitation de Montréal, an organization of subsidized housing apartments.",
  "Coriolan had lived in the apartment in the Gay Village since 2008, but began having behavioural issues last fall, Laurin said. “He was unstable and it became a problem for the neighbours,” she said. “He wasn’t well.”",
  "The rental board decision says Coriolan was constantly yelling and screaming and on one occasion last September, firefighters discovered thick smoke in his kitchen after he had left a pot of boiling water on his stove. On another occasion, a neighbour testified that he saw Coriolan sneak out of his apartment after the fire alarm sounded.",
  "On Tuesday night, neighbours called the police after Coriolan began destroying his apartment and breaking windows, Laurin said.",
  "When police arrived, they found him wielding a screwdriver in each hand, according to the Bureau des enquêtes indépendantes — the Quebec’s police watchdog group that is investigating the fatal shooting.",
  "Police tried and failed to subdue him using a Taser and plastic bullets, the BEI said. It’s unclear what then prompted them to fire multiple shots with their service revolvers.",
  "Laurin said her staff tried to get Coriolan help last fall, but she said he refused their offer. “We tried to work with him and get him help but if a person doesn’t want help, we can’t force him to take it,” she said, adding that she doesn’t think he was being followed by social services.",
  "Coriolan is of Haitian origin and lived alone in his third-floor studio apartment on Robillard Ave.",
  "Neighbours also complained that Coriolan frequently opened and closed his apartment door at all hours. At a rental board hearing in May, Coriolan testified that he had a medical condition that forced him to leave his apartment many times during the night, even as late as 3 a.m.",
  "Lawrence Dulac said he heard his neighbour screaming in the corridor shortly after police arrived Tuesday evening.",
  "Officers told the man several times to calm down and to get on the ground, he said. Dulac said he shut his door and then heard police fire five or six shots. “It’s sad,” he said. “He is someone we have known for several years even if we didn’t talk to him.”",
  "When Urgence-Santé arrived on the scene at around 7:30 p.m., Coriolan was in cardiac arrest. Paramedics attempted to perform CPR. Coriolan was taken to a hospital and died around 9:45 p.m.",
  "Dulac said he often heard his neighbour screaming in his apartment and on the balcony.",
  "“When people are sick, they sometimes scream,” Dulac said. “He may have bothered other people but he didn’t bother me. I didn’t say anything to him when he screamed because I knew the man was ill. He screamed everyday.”",
  "Dulac said he did not recall the police ever having been called to the apartment before to deal with Coriolan.",
  "Sylvie Dauzois, who lives one floor below Coriolan’s apartment, described him as stressed, anxious and introverted, and said he was difficult to converse with. “He was reserved and didn’t talk about himself,” she said.",
  "Dauzois said she heard commotion coming from his apartment Tuesday evening and was saddened to learn the next morning that he had died.",
  "“I heard three shots, but my door was closed so I didn’t hear anything else,” she said. “It makes you think; you don’t know who it can happen to.”",
  "Another neighbour who lives on the same floor as Coriolan said he would break plates in his kitchen when he was in distress. “He wasn’t doing very well,” said the neighbour, who gave his name only as Guy.",
  "He said he heard three loud bangs from the apartment after police arrived Tuesday.",
  "A resident who lives in a condo beside the subsidized housing block said “the cops are called there a lot because there is always something going on.”",
  "Two years ago, a 54-year-old man died after being stabbed in a basement unit in the same apartment building. The 36-unit apartment is governed by Montreal’s subsidized housing organization.",
  "The resident said he didn’t hear any commotion coming from the building on Tuesday evening. “I have kids and I am trying to sell my condo,” he said. “It’s time to get out.”"
]