[
  "Port Perry shooting victim, Gerald Rattu, 59, not a threat to anyone but himself, says girlfriend",
  "\nBowmanville woman says Woodville man fatally shot by Durham cop responding to call about a ‘distraught” man\n",
  "\nDurham police shooting in Port Perry claims life of Woodville man, Gerald Rattu",
  "PORT PERRY -- Gerald Rattu, 59, of Woodville, was shot and killed by Durham police responding to a call about a \"distraught\" man on January 16. He was with his girlfriend, Bowmanville's Laurie Bailey, in Port Perry at the time of the shooting. January 19, 2016 - Submitted photo ",
  "SCUGOG — Laurie Bailey can’t shake the images from her head.",
  "A Durham cop with an unholstered gun and yelling demands. The sound of gunfire piercing the stillness of a Port Perry subdivision on a Saturday night. And then her boyfriend, Gerald Rattu, lying fatally wounded on the ground after being shot.“I can’t get it out of my mind — the cop pointing the gun at him and then him laying on the ground,” recalled Ms. Bailey of the actions on the evening of Jan. 16 that left the 59-year-old Mr. Rattu, of Woodville, dead.",
  "“They could have Tasered him, they could have shot him in the leg, but they didn’t have to shoot him in the chest and kill him,” said a sobbing Ms. Bailey on Tuesday morning.",
  "Durham police have remained tight-lipped about the incident that took place around 9 p.m. on Waterbury Crescent in the Canterbury Common subdivision, just north of Port Perry. In a brief release on Sunday, police said only that officers were called to deal with a “distraught” man who was ultimately shot by a responding officer.",
  "Ms. Bailey, 52, acknowledges that her boyfriend of almost three years had been drinking that night and was trying to harm himself with a knife inside the home. But, stressed the Bowmanville woman, he wasn’t a threat to anyone but himself.",
  "“He was a big teddy bear,” said Ms. Bailey. “He didn’t deserve this.”",
  "Ms. Bailey was staying at the home at the request of her sister, who had taken a trip out of the country with her husband. Ms. Bailey arrived on Jan. 11 to look after the home and cat, as well as keep an eye on her twenty-something niece. Ms. Bailey’s boyfriend, Mr. Rattu, joined her at the Port Perry home on Jan. 13 with her sister’s blessing, contrary to neighbourhood rumours that an unknown man showed up at the doorstep the night of the fatal shooting.",
  "The Bowmanville woman had an inkling her boyfriend was in an unhappy mood on Saturday when she called him that afternoon from the Oshawa hospital, where she works. Mr. Rattu worked at General Motors and had worked overtime the previous night, she said.",
  "When she called Mr. Rattu that afternoon, he seemed “agitated,” said Ms. Bailey.",
  "He then started posting comments on Facebook that made her worry, she added.",
  "When Ms. Bailey got to her sister’s home in Port Perry on Saturday evening, around 7:30 p.m., she noticed Mr. Rattu had been drinking and offered to make him some dinner. In the basement of the home were Ms. Bailey’s niece and her boyfriend.",
  "A conversation between Ms. Bailey and Mr. Rattu after the meal took a sour turn and he began calling Ms. Bailey names and questioned their relationship, recalled the Bowmanville woman.",
  "“I was getting scared when he started calling me names,” said Ms. Bailey, adding she took Mr. Rattu’s truck keys at one point in the evening to stop him from driving away impaired.",
  "The evening, however, got worse when a “very distraught” Mr. Rattu grabbed a butcher’s knife from the kitchen and tried to stab himself in the chest, she said. Ms. Bailey managed to wrestle the knife away from him, slicing her thumb during the altercation.",
  "Undeterred by Ms. Bailey’s actions, Mr. Rattu then rummaged through the kitchen in search of another knife, grabbing one from an overturned butcher’s block.",
  "“When he grabbed the knife, I screamed at my niece to call 911,” said Ms. Bailey. “We needed help. I knew he was going to hurt himself, but he wasn’t going to hurt anyone else.”",
  "The struggle between the two continued in the living room where Mr. Rattu tried once more to stab himself before he ended up outside in front of the home — and in a confrontation with Durham police, Ms. Bailey said.",
  "Watching from the front porch, Ms. Bailey saw her boyfriend then walk towards an officer with a knife in his hand.",
  "The cop said, “ ‘Drop it now, drop it now’ and then there was a pop-pop and he went down and was laying on the ground,” said Ms. Bailey.",
  "“They knew he was intoxicated and he was trying to hurt himself. They didn’t have to shoot him.”",
  "Ms. Bailey was then whisked away by other responding officers back into her living room where she grabbed some shoes and was taken to a neighbour’s home.",
  "At one point after the shooting she asked a cop why they had to shoot Mr. Rattu.",
  "“He came at us with a knife, that was their answer,” said Ms. Bailey.",
  "She was later taken to Port Perry hospital, where paramedics had rushed Mr. Rattu, but was taken in a side entrance and not allowed to go near the emergency room. Later that night, a doctor visited Ms. Bailey to tell her that her boyfriend did not survive his encounter with Durham police.",
  "“I wasn’t scared (for her own safety), I was scared he was going to kill himself,” said Ms. Bailey. “I got one of the knives away from him and he didn’t try to hurt me.”",
  "Following the shooting, the Province’s Special Investigations Unit was called in to investigate the incident. The SIU is called in to investigate when police are involved in an incident where someone dies, is seriously injured or is sexually assaulted.",
  "On Monday, both Durham police and SIU officials refused to release the victim’s identity or any other personal details. The SIU has designated one cop as a subject officer, along with five witness officers.",
  "On Sunday, one neighbour reported hearing “two sharp pops” before he looked through his window to see what was happening.",
  "“I saw a police man over there pointing his gun and there was a body flipped over the snow bank where you can see the blood,” said the neighbour, who declined to provide his name.",
  "He said the officer walked over and flipped the man on his back and checked for a pulse.",
  "The neighbour said it was dark and he couldn’t tell if the man who was shot had a weapon, but he said the officer approached him cautiously.",
  "“When the police approached the body, (the officer) was still holding his gun aiming at him.”",
  "At the time, the neighbour saw only one officer, but more police and ambulance arrived shortly after.",
  "Late Sunday morning the area was cordoned off while Durham police continued to gather evidence from the scene and yellow markers noted critical areas, including red-tinged snow.",
  "Around 11 a.m., officers grabbed shovels and cleaned up the blood-soaked snow and began to remove the yellow police tape marking the site.",
  "On Monday afternoon, there was no sign of police or SIU activity at the home, with three vehicles — a pickup truck and two cars — parked in the driveway of the grey brick home.",
  "As part of the SIU investigation, six investigators and three forensic investigators were assigned to look into the shooting.",
  "No formal funeral for Mr. Rattu is planned, said Ms. Bailey. Instead, a celebration of life will be held sometime in the spring."
]