[
  "Teen who killed 3 before being shot dead by police taunted about family tragedy, coroner finds",
  "Illutak Anautak, 19, told 'he wasn't doing anything good in the village' before his drunken killing spree",
  "A man who stabbed eight relatives, killing three, in Akulivik, in Quebec's Inuit territory of Nunavik, before being shot dead by police had been confronted about tragedies in his life earlier that day, according to a Quebec coroner.",
  "Coroner Steeve Poisson filed four separate reports on the events of June 10, 2017, on the deaths of Illutak Anautak, 19, and the three relatives he killed: his uncle, Lucassie Anautak, his aunt's partner, Eli Qinuajuak, and his cousin, Putulik Anautak, 12.",
  "Illutak Anautak was shot six times by police and died from a bullet wound to the abdomen, the coroner said.",
  "Despite offering new details into the police shooting and the attacks that preceded it, Poisson did not come to a definitive conclusion as to what motivated Anautak's actions.",
  "However, on the morning of the attacks, police received a call complaining that Anautak was drunk and that someone in the house with him had told the teenager that he \"didn't have a mother or a father, and that he wasn't doing anything good in the village,\" the coroner reported.",
  "\"According to members of Mr. Anautak's family, he committed his actions in reaction to those comments,\" Poisson said.",
  "Police found Anautak with 'bloody knives'",
  "The Kativik Police Service, which serves all the communities in Nunavik, received a call just after 8 a.m. on June 10, 2017, about a fight at one home in Akulivik and another call about a person being injured in front of a second home in the village of 600.",
  "Officers found Anautak at that second home, where the assailant's cousin, Putulik Anautak, 12, was lying outside in his own blood, according to the report.",
  "Anautak \"had a bloody knife in each hand,\" the report said, and he threatened police. He then made his way toward his grandmother's home.",
  "\"Despite orders from police to drop his knives, Mr. Anautak continued to threaten police, and he threw a knife in their direction. The officers opened fire on him,\" the coroner wrote.",
  "At 8 a.m. that morning, Anautak had posted on Facebook that he had killed five people \"and was ready to kill others if he had to,\" the coroner reported.",
  "The coroner confirmed that Anautak was under the effects of alcohol at the time of the incident.",
  "His blood alcohol level was 141 milligrams per 100 millilitres, nearly twice the legal limit for driving a vehicle (80 mg per 100 ml).",
  "Anatauk's medical records did not indicate that he'd had any documented psychological problems.",
  "None of the four coroner's reports made any recommendations about how to prevent future tragedies."
]