[
  "Manslaughter charges stayed against two RCMP officers in death of Dale Culver in 2017",
  "Prosecution service says disagreement among pathologists on cause of death make conviction unlikely",
  "Manslaughter charges were stayed Friday against two RCMP officers in the 2017 killing in Prince George of Dale Culver, an Indigenous man from the Wet’suwet’en and Gitxsan Nations in northern B.C.",
  "Const. Paul Ste-Marie and Const. Jean Francois Monette had earlier pleaded not guilty to the charges.",
  "“There is no longer a reasonable prospect of conviction regarding charges that had previously been approved against two members of the Prince George RCMP involved in the arrest of Dale Culver on July 18, 2017, in Prince George,” the B.C. Prosecution Service said in a written statement.",
  "The service said Crown prosecutors were unable to resolve questions about the evidence of the cause of death.",
  "An independent opinion from a reviewing pathologist found a different cause of death than the first pathologist, who had attributed the death to very small blood clots in the lungs, and that other factors had contributed including methamphetamine toxicity, use of pentazocine which is a synthetic opioid, exposure to pepper spray, asthma and blunt force head trauma.",
  "The second pathologist, described as a prominent forensic pathologist in Toronto, found Culver’s death to be a result of acute and chronic adverse effects of methamphetamine following a struggle. The mechanism of death was sudden cardiac death, the pathologist found.",
  "“Although his condition was exacerbated by the struggle with police, Mr. Culver was vulnerable to such a death at any moment,” says the B.C. Prosecution Service statement.",
  "The reviewing pathologist found that during the police struggle with Culver, 35, “no fatal injuries occurred.”",
  "As a result of the most recent pathology findings, there is no longer a reasonable prospect of convicting the two officers for manslaughter, the prosecution service said.",
  "There will also be no lesser charges against the officers, as the Crown counsel concluded they could not prove beyond a reasonable doubt the two officers committed any criminal offence during their arrest of Culver.",
  "Culver was arrested after police were called about a man allegedly casing vehicles.",
  "The prosecution statement says that Culver was pulled from a BMX bike by an officer when he would not stop for police, a struggle ensued, more officers joined, including Ste-Marie and Monette, and that punches and kicks or knees were used to subdue him. He was also pepper sprayed. Culver had complained about not being able to breathe, the prosecution service statement said.",
  "After he was handcuffed and put in the back of a police car, Culver again complained about not being able to breathe and said he needed air. Paramedics attempted to assess his condition, and he was initially responsive, but less than a minute later he died.",
  "The prosecution service said that a report on the police’s use of force was “highly favourable” to the defence and capable of raising doubt of whether an assault was even committed given the two officers were responding to a call for help from the first officer.",
  "The B.C. Independent Investigations Office, which investigates deaths resulting from use of force by police, had found there were grounds to believe an officer may have committed an offence in Culver’s death and sent a report to the B.C. Prosecution Service in 2020 asking for charges.",
  "On Feb. 1, 2023, the two officers were charged with manslaughter.",
  "Culver’s family has long been critical of the judicial process and the length of time it has taken.",
  "On Friday, they reacted angrily to the decision to stay the manslaughter charges against the two officers.",
  "“Our family has endured seven years of delays, waiting for the day Dale’s killers would be held accountable. Today our worst fears were confirmed. There is no justice,” said Raven Culver, sister to Dale.",
  "Grand Chief Stewart Phillip, president of the Union of B.C. Indian Chiefs, said he was outraged the charges were dropped.",
  "“Officers must be held accountable for each and every death of an Indigenous person at the hands of police. We are not dispensable. This has to stop,” said Phillip.",
  "First Nations and human rights and public advocacy groups — including the Union of B.C. Indian Chiefs, the B.C. Civil Liberties Association and Pivot Legal — have decried the treatment of Indigenous people by police for years, including interactions with police that resulted in death.",
  "In B.C., Indigenous people accounted for 14.5 per cent of 146 deaths after interactions with police between 2000 and 2022, according to data compiled by the Tracking (In)Justice group, which includes the Canadian Civil Liberties Association and the Institute of Criminology and Criminal Justice at Carleton University.",
  "The rate of Indigenous people in such deaths is nearly 2.5 times the proportion of non-Indigenous people in the population in B.C., according to Statistics Canada figures."
]