[
  "No ‘universally accepted’ way to prevent ‘suicide by cop,’ say experts",
  "Inquest underway into fatal police shooting of Jeremy Nuvviaq at his Sanirajak home in 2017",
  "An inquest into the the 2017 death of Jeremy Nuvviaq, 39, continued Wednesday with testimonies from experts in police use of force and suicide prevention. Nuvviaq had been threatening “suicide by cop” in a Facebook livestream and later confronted police who came to his home with a pellet gun. (File photo)",
  "There is no “universally accepted” guide for resolving a “suicide by police” call, according to an expert in police use of force who testified on the third day of an inquest into the shooting death of Jeremy Nuvviaq.",
  "Nuvviaq, 39, was shot by one of two RCMP officers who responded to a call in 2017 in Sanirajak after he threatened “suicide by cop” on Facebook and confronted police with what looked like a gun.",
  "Sgt. Brad Fawcett of the Vancouver Police Department said it is challenging for officers to respond to possible suicide-by-cop attempts because of the “cognitive load” they feel when responding to stressful calls where there is a possible public safety risk.",
  "“We have lots of suggestions based on anecdotal evidence on different calls and how they were resolved, but there’s no universally accepted step-by-step way to consult,” he said.",
  "While the RCMP does provide training for its officers in dealing with people in crisis and de-escalation, “there is no magic pixie dust that is going to make an intoxicated person sober, that is going to make a mentally ill person… cooperate voluntarily with whatever the goal is.”",
  "“You have to remember that when you’re doing scenarios, you’d have a role player that’s following a script, and the real world doesn’t,” he said.",
  "“The subject you’re dealing with in the real world gets a vote — they can decide to follow the directions of the officers or not.”",
  "An Ottawa Police Service investigation revealed that Nuvviaq actually had two different guns — a brightly-coloured toy handgun that he held under a towel in the Facebook livestream, and a black-and-yellow airsoft pellet gun he carried outside when the police arrived at his home.",
  "The RCMP officers who responded therefore saw Nuvviaq aiming at them with a rifle that did not match the description of the toy gun witnesses had seen in the Facebook video.",
  "Fawcett said police are trained to “treat all firearms if they’re real until you prove they’re not,” he said.",
  "“You don’t trust your life to somebody else’s assessment, whether a firearm is real or a replica. I wouldn’t even take the word of another police officer that it’s a toy gun, unless I had significant trust in that officer.”",
  "Another challenge in preventing suicide-by-cop scenarios is recognizing in the first place when a person is at risk of dying by suicide, said Victoria Madsen, assistant deputy minister of the GN’s mental health and suicide prevention programs.",
  "“It’s difficult because the type of suicide move movies talk about [is] about suicide notes, about people getting their affairs together before they take their own lives. But in actuality, in real life, a fair number of suicides occur in the moment.”",
  "On Tuesday, the inquest jury heard testimony from community mental health worker Kirsty Williams that Nuvviaq seemed “forward-thinking” and did not appear to have any suicidal ideations when he met with her several times before his death.",
  "“He was doing well. His relationship was going well, he was avoiding alcohol and he really wanted to turn over a new leaf,” Williams said, adding that Nuvviaq told her he had bought some self-help books and was enjoying his classes at Nunavut Arctic College.",
  "She testified that in March 2017, however, Nuvviaq asked her to write a letter to the housing committee to help his family secure better housing. At the time, there were nine people living in a two-bedroom home, Williams said.",
  "“Housing needs are definitely one of the underlying causes of people who attempt to take their life,” Madsen said. “Often counsellors will go to their supervisors and say, if my client had a better housing situation, they would be much better off in their mental health. It is one of the most frustrating things we experience as mental health and addiction staff.”",
  "In 2017, the GN introduced a five-year action plan for suicide prevention, which Madsen said led to “an increased acceptance that suicide prevention should be on everybody’s agenda,” but also highlighted shortcomings for the government to address.",
  "The next action plan will focus on helping communities in Nunavut establish professional mental health resources and offer better, more “realistic” suicide prevention training programs to RCMP officers.",
  "There also needs to be more community groups targeting men under 40 to help with suicide prevention, Madsen testified.",
  "“Right now, we look at the number of programs being offered and we notice a lot of sewing and cooking. We don’t see a lot of programs for men.”",
  "She said men’s groups can help participants get the tools and knowledge to “pull themselves out of that moment.”",
  "The four-day inquest is expected to conclude Thursday with the jury’s verdict and recommendations."
]