[
  "ASIRT clears officer in 2017 shooting of wanted man",
  "The RCMP officer who shot and killed an armed man wanted in relation to a homicide has been cleared by the Alberta Serious Incident Response Team.",
  "A search warrant was executed by the RCMP Emergency Response Team to arrest three men on Jan. 7, 2017, in two neighbouring homes on the Stoney Nakoda First Nation. Officers successfully arrested Deangelo Powderface and John Stephens, while Stephens’ brother, 27-year-old Ralph Stephens, was shot and killed.",
  "The men were wanted in connection with the homicide of Lorenzo Bearspaw, 27, six days earlier.",
  "Officers entered the homes, successfully arresting both Powderface and John Stephens before learning Ralph Stephens was with a woman in the basement of the home his brother was in.",
  "Aware that Ralph was in possession of a firearm — violating a court-ordered prohibition in effect until 2025 — the officers treated the execution of the warrants as a high-risk scenario, ASIRT executive director Sue Hughson said.",
  "Get the latest headlines, breaking news and columns.",
  "By signing up you consent to receive the above newsletter from Postmedia Network Inc.",
  "A welcome email is on its way. If you don't see it, please check your junk folder.",
  "The next issue of Calgary Sun Headline News will soon be in your inbox.",
  "We encountered an issue signing you up. Please try again",
  "Interested in more newsletters? Browse here.",
  "When officers entered the basement, announcing they were police with a search warrant, a single shot was fired through a wall, narrowly missing the officers, Hughson said.",
  "Officers deployed tear gas before evacuating the residence.",
  "One officer took shelter behind an old washing machine approximately 12 metres from the house, Hughson said.",
  "As the officer took position, another shot was fired from what was believed to be the southwest corner of the basement, closest to the officer. Almost immediately, the woman climbed out of the window as the officer yelled commands for her to walk toward him.",
  "Ralph subsequently exited the same basement window, carrying a shotgun at waist level pointed in the direction of the officer and the woman, Hughson said.",
  "Hughson said the officer then fired a single shot from his rifle, which struck the man in the torso and he collapsed to the ground. Ralph was loaded into an RCMP vehicle and transported to an ambulance stationed nearby.",
  "He was declared dead at hospital.",
  "The shotgun was recovered from the scene and found to be loaded with three unfired shells, with its pump action in the forward firing position, Hughson said.",
  "The gunshot wound damaged internal organs along with Ralph’s spinal cord, causing substantial hemorrhage and death, Hughson said, adding a toxicology report came back positive for methamphetamine.",
  "Hughson said Ralph “presented a risk of imminent grievous bodily harm or death to the officer, and potentially to the woman who would have been in the line of fire,” thus, no charges were laid in the shooting.",
  "Postmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
]