[
  "'I believe he intended to kill me,' Edmonton police officer told ASIRT",
  "Fatality inquiry told constable who fired four fatal shots was in fight for his life",
  "As he wrestled on the road with a drunk man with a knife, Const. Ian Wood thought he was about to die.",
  "In a fight for his life, the Edmonton police officer pulled his gun and fired four shots that killed Vitaly Savin.",
  "Wood was cleared last October of any wrongdoing by the Alberta Serious Incident Response Team.",
  "His written statement to ASIRT was entered as evidence on Tuesday at a provincial court fatality inquiry into Savin's death.",
  "\"I have been a police officer for almost 15 years and I have been in many dangerous situations during my career,\" Wood wrote. \"But I can honestly say that I have never felt this certain that a person intended to cause me grievous bodily harm or death.\"",
  "On March 9, 2017, police fielded 911 calls about a possible impaired driver in west Edmonton.",
  "One caller followed a blue Pontiac van as it left Whitemud Drive. Wood was sent alone to respond to that call at 1:30 p.m.",
  "He pulled his police car in front of a stopped van in the Hodgson neighbourhood and ordered the driver to stay in his vehicle.",
  "Savin, 55, got out of the van and stood by the driver's door while the officer approached him.",
  "\"I immediately looked at his hands and saw that he was not holding anything at that time,\" Wood wrote. \"I also observed that he was swaying from side to side and that his eyes were glazed and vacant.\"",
  "Wood suggested Savin was drunk. In a slurred voice, the man insisted he had not been drinking. The officer decided to arrest him for impaired driving. He pulled out his handcuffs and tried to grab Savin's left arm.",
  "The constable became concerned when Savin kept rummaging for something on his right side.",
  "\"I sensed something was wrong, and so I took a step backward and used my police radio to request another unit attend the scene,\" Wood wrote.",
  "He ordered Savin to show his hands. That's when Savin pulled out a knife.",
  "\"He produced what I would describe as a hunting type knife from his right side and took a step toward me, while raising the knife ... and pointing it in my direction,\" Wood wrote.",
  "The officer admitted he was scared. He said he tried to run but it was icy and he fell.",
  "\"I tried to get up but [he] was immediately behind me and fell on top of me,\" Wood wrote. \"I saw the knife still in his right hand. I shouted things like 'get back' and 'drop it.' At that time I was laid on my back with him on top of me.\"",
  "The constable tried to push Savin away with his feet. He kicked at the right hand holding the knife.",
  "He said Savin began to thrust the knife repeatedly toward his chest. He was not wearing body armour.",
  "\"He had what I would describe as a maniacal look on his face,\" Wood wrote. \"His eyes were very wide and he was gritting his teeth. The look was one of determination.",
  "\"I believed at that time that [he] intended to kill me, and I feared there was a strong likelihood of him succeeding.\"",
  "Wood pushed Savin far enough away to draw his service pistol. Still on his back, he fired four shots. Savin died at the scene.",
  "\"He was involved in a fight for his life,\" ASIRT investigator Peter Draganiuk told the fatality inquiry on Tuesday. \"It's not unreasonable to see a member, faced with a knife, go immediately to a firearm.\"",
  "Wood described Savin's behaviour as \"bizarre.\" In his written statement, he noted the 250-pound man quickly became \"a rage-fuelled armed assailant who was focused and determined to cause me harm.\"",
  "ASIRT confirmed that later testing showed Savin's blood-alcohol content was three-and-a-half times the legal limit.",
  "Savin's wife is attending the fatality inquiry and is allowed to ask witnesses questions with the assistance of a Russian interpreter.",
  "After two days of hearing evidence, the inquiry will sit for one more day next month.",
  "Provincial court judge Janet Dixon cannot find fault but can issue recommendations to try to prevent similar deaths in the future."
]