[
  "'Policing in Nunavik is broken': Inuit group wants change after latest fatal shooting",
  "MONTREAL — A political organization that represents Inuit in Quebec says policing in the Far North is “broken” after an officer shot and killed an Inuk man on Tuesday.",
  "The shooting by the Nunavik Police Service is the second officer-involved death in the northern region since November, and has reignited anger and trauma in Nunavik. The Quebec coroner’s office identified the victim as Mark R Annanack, 35, of Kangiqsualujjuaq.",
  "Makivvik, a group that represents the Inuit of Nunavik, said in a scathing statement this week there is a pattern of police using excessive force in the region. “Makivvik is calling for immediate and exceptional measures,” the organization said, adding that while an independent investigation is necessary, other actions must follow.",
  "“This crisis demands substantial structural change in the way policing is delivered across Nunavik, we cannot wait for another report while more lives are put at risk.”",
  "Makivvik head Pita Aatami asked how many families must suffer before the province “understands that policing in Nunavik is broken?”",
  "“This latest tragedy is not isolated: it reflects a systemic failure in the way policing is delivered in Nunavik,” Aatami said. “Despite repeated warnings, commitments, and investigations, police interventions continue to fail our communities. We condemn this fatality, and we demand immediate and measurable accountability.”",
  "Quebec’s police watchdog — Bureau des enquetes independantes _ said members of the Nunavik Police Service had planned to arrest someone who was inside a tent in the Inuit village on the eastern shore of Ungava Bay. The police force said in its own statement that officers had a warrant for the man, but the force said he resisted when two officers tried to arrest him about 10:30 p.m. on Tuesday.",
  "The police force said officers used pepper spray on the man, who they say emerged from the tent with a knife. An officer tried to subdue the man with a stun gun, but as the situation evolved an officer opened fire and the victim was later declared dead at a regional health centre.",
  "Quebec’s police oversight agency announced Wednesday it was investigating the shooting in Kangiqsualujjuaq. Nunavik Police Service has declined to comment further.",
  "Nunavik officers are equipped with body cameras, and the police service confirmed video has been shared with the watchdog agency.",
  "Makivvik said the latest death reflects a failure of the police force to de-escalate a situation or employ a level of cultural understanding.",
  "In November 2024, an officer shot and killed Joshua Papigatuk and seriously injured his twin brother Garnet after police responded to a call about alleged impaired driving in Salluit, about 1,850 kilometres north of Montreal. The Quebec police watchdog is also investigating that killing.",
  "Following Papigatuk’s killing, Makivvik said it has worked with the Kativik Regional Government to create the Nunavik public safety committee, tasked with reforming policing practices, ensuring better accountability and engaging with local community leaders in the region.",
  "“The committee’s mandate includes reviewing use-of-force policies, advancing Inuit-led oversight, and co-ordinating with communities directly impacted by police violence,” the organization said.",
  "Kativik Regional Government said in its own statement the police watchdog needs to move faster on investigations in Nunavik, with a “firm agreement to produce complete final reports within six months.” They also want the watchdog agency to convene public meetings with communities and review investigation results with them. They should also publish reports in Inuktitut.",
  "A spokesman for Quebec Indigenous Affairs Minister Ian Lafreniere said he was in contact with Makivvik’s president. “I offered him my support in these very difficult times for everyone,” the minister said in a statement, adding he would keep close tabs on the watchdog agency’s investigation.",
  "Jake Lamotta Granato, a spokesman for the coroner, said coroner Francine Danais will investigate Annanack’s death."
]