[
  "Quebec prosecutors clear police in 2017 death of Nunavik man",
  "Officers shot David Sappa, 22, after he threatened people with knives",
  "The KRPF’s detachment in Umiujaq. Quebec’s prosecutor’s office has cleared KRPF police officers of any wrongdoing in the 2017 death of an Umiujaq man. (Photo by Sarah Rogers)",
  "Quebec’s Crown prosecutor’s office has cleared police officers of any wrongdoing in the 2017 death of a Nunavik man.",
  "Kativik Regional Police Force officers shot and killed David Sappa in Umiujaq on Dec. 28, 2017, after the armed man was found to have threatened police and community members.",
  "According to an independent investigation into the incident, the KRPF responded to a disturbance at Sappa’s home on the afternoon of Dec. 28.",
  "When the 22-year-old man refused to cooperate with police, one officer returned to the local police detachment to get a warrant to enter the home.",
  "Before the second officer returned, Sappa came out of the home brandishing two large knives, threatening the police officer and community members.",
  "For the next few hours, the investigation found that Sappa moved through the village on foot, threatening people and yelling at police officers to “shoot me.”",
  "Three KRPF officers followed Sappa, trying to get him to surrender. At one point, the officers used cayenne pepper spray to subdue the man, unsuccessfully.",
  "When one of Sappa’s family members approached him from behind to try and disarm him, Sappa became more aggressive and lunged at one of the officers, the investigation found.",
  "At this point, the officers fired at Sappa, hitting him with three bullets and more pepper spray.",
  "Sappa was taken to the local health centre, where he was declared dead.",
  "As is standard when police are involved in a civilian’s death, the investigation was taken over by the Bureau des enquêtes indépendantes, Quebec’s independent investigation agency. The agency then in turn hands over its findings to Quebec prosecutors.",
  "In a decision published June 20, Quebec’s Director of Criminal and Penal Prosecutions, or DPCP, concluded that the police intervention was legal and that officers did not use excessive force in shooting at Sappa.",
  "“The officers involved had reasonable grounds to believe that the use of their gun was needed to protect themselves or their colleagues death or grievous bodily harm,” the DPCP wrote in its French-language decision.",
  "Since the BEI was launched in mid-2016, Quebec prosecutors have cleared officers in every case of a civilian injury or death in Nunavik, a total of 11 incidents."
]