[
  "The province’s police watchdog has cleared Hamilton police officers of wrongdoing in connection with the fatal shooting of Erixon Kabera on Nov. 9, 2024.",
  "Officers were dispatched to an apartment building on Main Street West in Hamilton at around 5 p.m. that day, after a resident told police they had been threatened by a man, according to the Special Investigation Unit’s report.",
  "The SIU report says that after officers arrived, a man pointed a replica firearm at them as he walked towards them.",
  "Two officers opened fire on him, shooting as many as 24 bullets in his direction as his approach continued, according to the report.",
  "Get breaking BC news",
  "After being hit a number of times, the man was taken to an area hospital by paramedics and was pronounced dead shortly before 1 a.m. the following day.",
  "The SIU was then called in to investigate the matter.",
  "In the report, SIU director Joseph Martino said there were “no reasonable grounds” to lay charges against the officers in connection with the shooting, noting that they used “reasonable force.”",
  "“The officers honestly believed they were looking at an actual gun in the Complainant’s possession. Though mistaken, their misapprehension was a reasonable one. The object looked like a gun, the Complainant brandished it as a gun,” Martino wrote.",
  "The man’s family identified him as Kabera, a father of three, who they said dedicated his life to his family and community.",
  "There was some confusion surrounding the incident as the SIU initially reported that there was an exchange of gunfire but later announced it had found a replica firearm at the scene.",
  "One of the officers told SIU investigators he believed the man had been the first to open fire, but it appears he mistook the other officer’s initial gunfire for shots coming from the man, Martino wrote, describing it as “an honest but mistaken belief in the highly charged atmosphere that prevailed.”",
  "The SIU is an independent agency that investigates incidents involving police that have resulted in death, serious injury or allegations of sexual assault."
]