[
  "‘Went straight for their gun’: family questions teen’s death by police",
  "A family member of a 17-year-old boy who was shot and killed by police on Norway House Cree Nation Friday is calling the death a senseless act of violence and questioning how the shooting can be justified.",
  "Brian Rowden identified the victim as his cousin, Elgyn Muskego, who he described as gentle, soft-spoken and small at around five feet tall.",
  "“I know who the kid was and I know that he couldn’t be that big of a threat, even with a knife in his hand,” Rowden told the Free Press Saturday.",
  "In a news release Friday, RCMP said officers were called around 1:45 a.m. to a house in Norway House, also known as Kinosew Sipi Cree Nation, located 450 kilometres north of Winnipeg.",
  "Manitoba’s police watchdog, the Independent Investigation Unit, which has taken over the investigation, said a resident of the home reported a male was high, agitated and armed.",
  "When officers arrived, they found the youth outside armed with an edged weapon, RCMP said.",
  "He refused “numerous orders to drop the weapon” and advanced towards officers, Mounties said. An RCMP officer then shot him.",
  "But Rowden questioned why police couldn’t find another way to de-escalate the situation.",
  "“Is that not what combat training is for? Isn’t that what Tasers are for? Isn’t that what all these other methods of apprehension are for, before they utilize their gun?” Rowden said. “But they didn’t. They just went straight for their gun.”",
  "The death has sent shock waves through the northern Manitoba community already struggling with grief, Rowden said.",
  "A 23-year-old woman was found dead in her Norway House home on Nov. 14. Derek Bruce Forbister, 35, also a Norway House resident, has been charged with manslaughter.",
  "Rowden, who said Elgyn was struggling with his mental health, called on RCMP officers stationed in the community to do more to understand the issues people in the community are facing.",
  "“If cops even knew a little bit of that, maybe they might have had some sort of compassion, but they don’t even try to know anything, the details like that, about our people,” he said.",
  "Rowden said there have been other deaths related to violence in Norway House in the last few weeks, which he called a close-knit First Nation, a community of 8,000-plus members.",
  "“You can feel it in the community right now, everyone’s hurting, everyone’s in pain, everyone’s angry.”",
  "Norway House Chief Larson Anderson declined to comment Saturday, but said an update would be coming from the community’s leadership next week.",
  "On Friday, a statement issued by Norway House’s chief and council said the recent violence in the community had brought “immense grief” to its members. It said the government is considering declaring a state of emergency due to issues of drugs and violence.",
  "At least six people have been fatally shot by police in Manitoba this year — three involving the RCMP and three involving the Winnipeg Police Service.",
  "The IIU has asked witnesses or anyone with information or video related to Friday’s shooting to call toll-free at 1-844-667-6060."
]