[
  "Questions emerge about level of force used in Montreal police intervention that preceded man’s death",
  "Family and friends of Abisay Cruz want answers after the 29-year-old man died following a Montreal police intervention on March 30 in Saint-Michel.",
  "“You killed someone for nothing,” said Cruz’s friend Pierre Petit-Frère. “In any case, we want justice for him now.”",
  "Petit-Frère called Cruz “a really good kid” who’s “never done anything wrong.”",
  "Quebec’s police watchdog, the BEI, has launched an investigation.",
  "In a statement, it says SPVM officers were responding to a person in crisis. Once officers arrived, there was reportedly a physical altercation with Cruz. After police restrained him, the BEI says he became unwell and lost consciousness. First aid was provided, and Cruz was taken to hospital, where he was later pronounced dead.",
  "A video of the incident posted to social media seems to show police officers restraining a man on a balcony while applying force to his back while he’s on the ground. The footage has led to calls for justice.",
  "“The police need to stop doing this,” Petit-Frère. “When you come to areas where there are immigrants and all that, you need to try to understand people before you act like that.”",
  "Concordia University professor Ted Rutland, who studies violence in policing, calls into question the amount of force used, and believes not enough attention was paid to the fact that Cruz was struggling.",
  "“One wonders why it was necessary to handcuff him in the first place,” Rutland said. “One wonders why it was necessary to pin him on the ground with a knee when apparently he had not committed a crime. Certainly was not posing danger to three police officers on hand. So there are huge questions about the level of force that was used.”",
  "Added Petit-Frère: “We don’t believe in the police anymore, because it’s nonsense. The police no longer protect us. We have to protect our own heads.”",
  "Rutland adds that police should not be responding to these types of distress calls. Instead, he says, there should be a civilian team in place to prevent these types of deaths.",
  "“If this was indeed a call for a person to distress, we know that the police are not the right response to those situations,” the professor said. “We’ve seen cities across North America respond to those situations by introducing civilian teams that are trained in de-escalation.”",
  "Rutland says among the calls for justice are simple demands to be recognized – from police and officials.",
  "“The overwhelming sentiment is that people feel ignored,” he said. “They feel like the SPVM has not made any statement. Our elected officials notably Valérie Plante have not expressed any condolences to the family who lost their loved one, have not promised anything in terms of ensuring the justice will be served.”",
  "On Sunday, a large crowd marched though Saint-Michel to honour Cruz.",
  "Many protesters wore balaclavas and black hoodies emblazoned with a photo of Cruz smiling on his 29th birthday, just days before his death.",
  "Cruz’s family were present at the event but chose not to speak publicly due to the ongoing investigation."
]