[
  "Yellowknife jail guard attacker shot dead by Winnipeg police on weekend",
  "A Nunavut-born man shot dead Sunday by Winnipeg Police after police say he stabbed a cop in the neck was the same person who viciously assaulted a corrections officer inside Yellowknife’s North Slave Correctional Complex in 2019.",
  "Twenty-four-year-old Jordan Charlie’s violent life came to a quick end Sunday at a outside a bus shelter near a west-end Winnipeg shopping mall, after police say he stabbed an officer in the neck.",
  "He had just completed a six-month jail sentence days earlier for assaulting hospital security staff with a knife, reported the Winnipeg Free Press.",
  "Charlie, who was from Iqaluit, ran afoul of the law after a troubling childhood that saw him apprehended from his parents at age one due to alcoholism and violence in the home, the situation blamed on the legacy of the residential school system.",
  "Charlie was diagnosed with borderline personality disorder, anger towards authority figures, and fetal alcohol spectrum disorder.",
  "Charlie’s stints in youth jails, foster-care placements and hotels in multiple communities ended when he eventually landed in Yellowknife.",
  "As CKLB reported in 2019, Charlie, then 19, was sentenced to four-and-a-half-years in a federal prison after he nearly stabbed a drug dealer to death, stole his marijuana and later beat up a jail guard while being escorted back to his cell.",
  "Court documents show he punched the officer in the face over 20 times and slammed his head into a wall.",
  "Charlie was stuck sleeping rough for the most part in Winnipeg after being released from Stony Mountain Institution last year for his NWT crimes.",
  "When deciding to release Charlie into a Winnipeg half-way house, instead of making him serve his full NWT sentence, the National Parole Board stated: “Given your violence history; your impulsivity; your vulnerability and the constant display of a lack of restraint/desire in managing your mental health … the board has little confidence that your behaviour in the community will be any different but unmanageable.”",
  "That warning proved correct, as Charlie subsequently stabbed a hospital security guard in Winnipeg.",
  "During a sentencing hearing, court heard it was expected Charlie would initially stay in a Winnipeg shelter before any plans could be put in motion to return him to Nunavut.",
  "Two people who knew Charlie told the Winnipeg Free Press he struggled with drug addiction while homeless in Winnipeg.",
  "They, too, said he told them he wanted to return to Nunavut.",
  "“He has been trying to get back for a while now… but he had no money or means to go back home,” said a friend. “He had nothing out here. He missed his family.”",
  "Jordan Charlie’s unprovoked attack of a Yellowknife jail guard prompted a review of the facility’s operations. (Still from video courtesy of Public Prosecutions of Canada)"
]