[
  "Windsor officer who shot Matthew Mahoney tells inquest he had to take a life to save a life",
  "Constable says he first saw 33-year-old carrying butcher block of knives on March 21, 2018",
  "A visibly emotional Windsor, Ont., police constable testified before a coroner's inquest jury Tuesday about the moments he shot Matthew Mahoney in the downtown area four years ago.",
  "Const. Andre Marentette said he first saw Mahoney, 33, carrying a butcher block full of knives at the intersection of Ouellette and Wyandotte around 8 a.m. ET on March 21, 2018. The officer of 11 years testified Mahoney wasn't responding to him as he tried to understand his intentions.",
  "Mahoney walked east, into the Shoppers Drug Mart parking lot. Const. John Paul Karam, who is scheduled to testify Wednesday, arrived first. Marentette was right behind him.",
  "Again, Marentette said he tried to get Mahoney to speak with him. No response.",
  "\"He had a smirk, a smile,\" Marentette testified, pausing as he appeared to get emotional recalling that interaction.",
  "Pedestrians, vehicles and a busy morning rush at McDonald's made Marentette more alert to the potential risk to the public, he said.",
  "The situation escalated quickly.",
  "Marentette said Mahoney began slashing at Karam with a knife in a figure eight motion, moving quickly toward him. Karam deployed a Taser, he said, but it didn't connect to Mahoney's body.",
  "While Karam was walking backward quickly, away from Mahoney's constant slashes, Marentette saw him trip over a curb. A telephone pole next to Karam obscured his face, Marentette unable to see the other officer.",
  "\"I could hear him yelling,\" Marentette said.",
  "But he could see Mahoney \"directly over top of him,\" still slashing the knives.",
  "It all happened \"so quick,\" he said.",
  "At that point, Marentette said, he fired one shot. Mahoney then started to walk toward him with a knife \"clenched in his hand.\"",
  "\"I repeatedly told him to drop the knife. He did not. I believe I fired one more round. He closed the gap faster. I fired two more rounds and he fell to the ground,\" said Marentette.",
  "Officer was with man till paramedics arrive",
  "Then, he started thinking about the other officer who he still couldn't fully see.",
  "\"At that point I couldn't see if my partner was dead. I couldn't tell if he was bleeding out. I couldn't see anything. I couldn't tell what he had just done to my partner,\" said Marentette.",
  "Once another officer approached and Marentette knew he wasn't alone, he kicked the knife away from Mahoney, the jury heard.",
  "He said he kneeled down next to Mahoney, who was bleeding from the multiple gunshot wounds. Marentette remembered telling him to stay awake, that an ambulance was coming.",
  "\"He was taking gasps of air,\" said Marentette, who testified he stayed with Mahoney until paramedics arrived.",
  "\"Unfortunately in order to save a life, I had to take a life that day,\" Marentette said, getting emotional and then asking for a brief recess.",
  "Officer stabbed, shots fired",
  "Audio from police and dispatchers was also played for the jury Tuesday, highlighting how the events unfolded.",
  "Karam can be heard using his radio, asking for help.",
  "\"I need EMS to step it up please. I've been stabbed in the hand,\" Karam is heard saying on the audio recording played for the jury.",
  "During the 28-minute dispatch recording, there aren't any audible portions where someone indicated a man had been shot, only that an officer had been stabbed and shots were fired.",
  "When paramedics arrived, Marentette said, it didn't appear they were aware \"somebody had been shot, just by the way they were moving.\"",
  "Marentette remembers approaching paramedics, telling them there's a man with gunshot wounds and possibly without vital signs.",
  "\"I need you guys over here,\" Marentette recalled telling EMS. \"Based on how fast they were moving, they were not aware that someone had been shot and that there was a more critical patient that needed tending to.\"",
  "Mahoney's death is now being examined by a five-member jury that has the ability to make recommendations to prevent future deaths. The inquest started Monday, and is expected to last 10 days and include 20 witnesses.",
  "A Starbucks shift supervisor who worked at the old location at Ouellette Avenue and University Avenue the day Mahoney was killed also testified.",
  "Natalie Vriesen can be heard on a dispatch recording, first alerting police to Mahoney who was seen carrying a butcher block of knives in downtown Windsor. She called the non-emergency number after hearing some customers were uncomfortable by Mahoney's \"strange\" behaviour, Vriesen testified.",
  "Witness didn't want to call 911",
  "Inquest counsel Brian White asked Vriesen why she called the non-emergency number and she said \"because I know that police hurt people. That sounds really bad.\"",
  "\"But if I cannot call 911 on anybody, I'm going to not. It didn't seem like the person was being violent or anything, but it was definitely odd behaviour.\"",
  "On Monday, Mahoney's brother, Michael, said his brother complained of being ignored by the system tasked with helping his mental illness. Mahoney was diagnosed with schizophrenia, the jury heard, and had been violent in the past.",
  "Michael Mahoney said he struggled with the system in trying to get his brother back on his medications.",
  "The province's Special Investigations Unit cleared the officers of any wrongdoing."
]