[
  "Alberta RCMP justified in killing murder suspect during 'harrowing' highway shootout, ASIRT says",
  "21-year-old was wanted for March 2018 murder of Calgarian Nadia El-Dib, 22",
  "A 21-year-old murder suspect killed during a \"harrowing\" shootout with Alberta RCMP on a highway west of Edmonton more than two years ago was solely responsible for his own death, ASIRT says.",
  "In a report issued Thursday, the Alberta Serious Incident Response Team said the 11 officers involved were justified in using lethal force during a shootout that lasted for two minutes and saw police fire a total of 202 rounds.",
  "The Calgary man, identified in a police warrant as Abderrahmane \"Adam\" Bettahar, led police on a 140-kilometre chase through west-central Alberta on March 29, 2018, that culminated in a gunfight on Highway 16 near Evansburg.",
  "\"It would be fair to describe this event as harrowing,\" ASIRT said in a news release. \"It is a shocking example of the risks police can face at any time.",
  "\"While the man was extremely young and had no criminal record ... his choice to open fire on officers was deliberate and immediate, and there can be no question that he presented a lethal risk. He was shooting to kill, not just to provoke a police response.\"",
  "Murder in Calgary",
  "The drama that ended that evening began four days earlier, when Nadia El-Dib, 22, was found dead behind a home in Calgary.",
  "An autopsy confirmed that she had been the victim of what ASIRT called \"a particularly violent attack\" involving the use of an edged weapon and a firearm.",
  "Calgary police quickly identified a suspect, a 21-year-old man who had briefly dated El-Dib, and issued a warrant for his arrest on a charge of first-degree murder.",
  "On the morning of March 29, Calgary police advised RCMP that evidence had placed the fugitive in the Evansburg area. He was thought to be armed with a Czech-made CSA VZ.58 semi-automatic rifle and driving a dark-blue 2004 Ford Explorer.",
  "\"The man had made statements to the effect that he would not go down without a fight,\" ASIRT said.",
  "At 5:13 p.m., a uniformed officer in a black Chevrolet Tahoe with RCMP markings spotted the Ford Explorer and followed it north on Highway 22.",
  "Efforts to conduct a traffic stop were not successful.",
  "The pursuit continued for about 70 minutes and covered about 140 kilometres, ASIRT said, travelling north on Highway 22 onto Highway 16. The pursuit travelled east and west on Highway 16 as the Ford changed direction several times. More officers and police vehicles joined in.",
  "RCMP placed other officers at intersections ahead of the pursuit to keep civilians off the highway and to prevent the man from escaping onto rural roads.",
  "\"The man evaded four separate attempts to deploy spike belts during the pursuit,\" the news release said.",
  "A fifth spike belt on Highway 16 damaged the SUV's tires and the Ford finally became inoperable and stopped in the highway's eastbound lanes, just east of Range Road 83.",
  "The driver made a 45-degree turn and stopped, angled across a highway lane, exposing the passenger side to the pursuing police vehicles.",
  "\"The placement of the vehicle provided a tactically advantageous position, providing cover and protection while the man fired upon police,\" ASIRT said.",
  "Shootout on highway",
  "The closest police vehicle halted about 60 feet away. Other RCMP vehicles stopped in a staggered pattern on the highway.",
  "'He tried to ram some cops and ended up getting in a gunfight'",
  "Civilian witnesses saw the man step out of the Ford holding what was described as a rifle or \"machine gun,\" ASIRT said. He dropped to one knee to take a firing stance, pointing at police, a witness said, \"like he knew what he was doing.\"",
  "The man fired a shot at the closest RCMP vehicle, then another shot that grazed the officer's head. Other police at the scene knew an officer had been shot and appeared to have a head injury that was bleeding profusely.",
  "Officers took cover and 11 of them returned fire, eventually firing 202 rounds.",
  "\"During the firefight, independent witnesses saw that the man appeared to be reloading his firearm as he sheltered behind his disabled vehicle. He fired additional rounds at the RCMP officers/vehicles from a position of cover behind the driver's side of the Ford Explorer. One minute and 12 seconds after the start of the gunfire, one of the officers near the front waved his arm, directing officers to cease fire.\"",
  "By then the injured officer had crawled toward the back of his police vehicle and been pulled to safety.",
  "At 6:28 p.m., an officer travelling in the westbound lanes confirmed that the man was down. Based on the available evidence, ASIRT said, he had fired 10 rounds.",
  "Every window of the Ford Explorer was shot out and the SUV's body was dotted with bullet holes.",
  "An autopsy determined the man died of multiple gunshot wounds. One of the most serious wounds severed his spine and lacerated his carotid artery and internal jugular vein. A toxicology report determined he had no drugs or alcohol in his system at the time of death.",
  "He had one bullet left",
  "A CSA VZ.58 semi-automatic rifle, the gun thought to have been used in the Calgary murder four days earlier, was recovered at the scene with an empty magazine and one remaining round in the chamber. The gun and its ammunition had the capacity to penetrate police soft-body armour, ASIRT said.",
  "A receipt found in the man's wallet showed the gun had been purchased on March 10, 2018, along with a membership to a Calgary gun club.",
  "\"The injured officer suffered what would turn out, miraculously, to be only a grazing wound across the top of his head, leaving his skull intact, with shrapnel in his scalp and a concussion,\" ASIRT said.",
  "He was stitched up and spent a few days in hospital as a precautionary measure.",
  "Another officer suffered several lacerations on his arm and neck caused by bullet shrapnel.",
  "\"The relatively minor nature of the officers' injuries was a reflection of good fortune rather than a lack of intent on the part of the man,\" the news release said. \"There can be no doubt that he had been firing on police with the intent to kill or seriously injure as many officers as possible.\"",
  "ASIRT said it interviewed all the police and civilian witnesses and watched high-quality video from several RCMP vehicles.",
  "\"There is no question that all involved officers were acting in the lawful execution of their duties,\" said ASIRT, which has a mandate to investigate incidents involving Alberta's police that result in serious injury or death, and serious or sensitive allegations of police misconduct.",
  "Factoring in the homicide, his stated intentions to evade apprehension and his behaviour, ASIRT said, the man \"presented a high risk to public safety.",
  "\"Having reviewed the investigation in its entirety, there are no reasonable grounds, nor reasonable suspicion, to believe any of the involved officers committed any offences.",
  "\"While the loss of life is never the desired outcome, the man placed the officers in a situation where lethal force was necessary. Indeed, it is difficult to conceive of a situation that would be a better example of the necessity for the use of lethal force.\""
]