[
  "MANDEL: 'It felt like a torpedo,' says Toronto cop who survived shootout",
  "Toronto Police Const. Arjuna Raveendran looked death in the eye that night.",
  "Don't have an account? Create Account",
  "On June 7, 2018, Raveendran and partner Const. Jason Crocker were responding to a “person with a gun” call outside a Scarborough bar — a white male in a hoodie had shown patrons he was packing a black semi-automatic in his right pocket. “Advised to use caution,” the dispatcher said.",
  "The 911 call had come in at midnight from Kevin Marshall, an off-duty officer who happened to be at the Muckish Irish Pub that night near Warden and St. Clair Aves. There’d been an altercation and before leaving the pub, the man had flashed a gun and warned, “Let’s take it outside.”",
  "“He’s just left in a car,” Marshall told the 911 operator.",
  "Raveendran activated his lights and sirens as they raced to the scene, but he was expecting the gunman to be long gone, or GOA, “gone on arrival.” They don’t usually stick around after the police are called, he explained.",
  "Your noon-hour look at what's happening in Toronto and beyond.",
  "By signing up you consent to receive the above newsletter from Postmedia Network Inc.",
  "A welcome email is on its way. If you don't see it, please check your junk folder.",
  "The next issue of Your Midday Sun will soon be in your inbox.",
  "We encountered an issue signing you up. Please try again",
  "Interested in more newsletters? Browse here.",
  "They pulled into the parking lot and Raveendran was walking toward two civilians standing outside the back door of the bar when Marshall pointed out the suspect in a white Mercedes: “That’s him.”",
  "Everything changed, Raveendran said. It was “game on.”",
  "He headed over to the car, saw the driver matched the suspect description, and that he was trying to reach for something in the console.",
  "“What is this all about?” the driver asked Crocker.",
  "“Get out of the car,” the police shouted in return. “Show us your hands.”",
  "They didn’t know they were about to have a shoot-out with Robert Morfitt, a 36-year-old drug dealer who had just finished a nine-year prison term in October 2017 for multiple gun offences and was under a weapons ban. Seven years earlier, his statutory release for previous gun crimes was revoked after he was arrested pointing his firearm at police.",
  "Morfitt dropped his gun on command in 2011. But not this time.",
  "Raveendran said he decided the man posed enough of an immediate threat that he pulled his Glock out of its holster and opened the driver’s door with his other hand.",
  "And then he looked into the barrel of a gun.",
  "“In seeing the firearm pointed at me, I can’t remember who shot first. It was instantaneous, the exchange of gunfire,” he told the mandatory inquest into Morfitt’s death on Tuesday.",
  "Miraculously, one of the four shots from Morfitt’s pistol hit the cellphone in the pocket of Raveendran’s Kevlar vest, shattering the screen and bruising his heart. A few inches higher and he would have been dead.",
  "“It felt like a torpedo had hit me,” the officer recalled, growing emotional as he watched the footage of the shootout played for the jury. “I was in shock. I didn’t know if I’d been hit.”",
  "He immediately heard more gunfire. His colleagues were coming to his aid.",
  "“I see PC Raveendran grabbing his chest,” Crocker testified. “I take aim with my rifle and discharge my rifle.”",
  "Hit by a hail of 15 police bullets, Morfitt was later pronounced dead at Sunnybrook hospital. Following an investigation, the SIU cleared all officers of any wrongdoing.",
  "“Nothing would have prepared me for that,” Raveendran insisted. “There was nothing that could have helped it go the other way.”",
  "In Morfatt’s Mercedes, police found two fully-loaded Glock 9mm magazines in a bag, another large capacity 9mm magazine capable of dispensing 50 rounds of ammunition on the floor of the driver’s seat and a “large amount of cash” and drugs.",
  "Raveendran was asked why he chose to open the suspect’s car door, putting himself in the line of fire, rather than taking cover. A representative from the Morfitt family wanted to know why there was no effort at de-escalation and why it was all over within 23 seconds.",
  "It was a dynamic situation, the officer explained, where he felt public safety was at risk from a gunman who wasn’t obeying commands to step out or show his hands. There were bystanders in the parking lot, officers exposed, and it looked like the man was trying to access his weapon.",
  "He would later bear a wound to his heart to confirm he was right.",
  "“I did the best job I could under the circumstances,” maintained Raveendran, now with the guns and gangs task force. “If I had more time, I would have taken additional steps.”",
  "The inquest continues.",
  "Postmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
]