[
  "SiRT clears RCMP officers in Westphal fatal shooting",
  "By Meghan Groff",
  "Posted Nov 21, 2018 02:29:00 PM.",
  "This article is more than 5 years old.",
  "The province's Serious Incident Response Team says there will be no charges for Halifax District RCMP officers after a man was fatally shot by police earlier this year.",
  "The deceased was identified at the time as Bradley Thomas Clattenburg, 24, of Truro.",
  "Mounties were called to a home in Westphal just before 8 a.m. on May 26 after getting a report that a man with a gun threatened to kill another man.",
  "SiRT believes Clattenburg was “suffering from some serious mental health issues.”",
  "According to their report, he believed the man he threatened to kill had kidnapped his pregnant girlfriend and had planted an audio chip in his head, which allowed him to hear her “having sex with all kinds of different men.”",
  "The SiRT report says he “pointed the sawed-off shotgun he had brought with him at the head of his intended victim and ordered him to release his girlfriend.”",
  "Investigators do not believe Clattenburg had a girlfriend.",
  "After being in the home for 18-minutes, SiRT says Clattenburg ran off into a wooded area, taking the gun with him. He was tracked down with the help of an RCMP dog.",
  "Officers then saw him walking between the Titans Gymnastics building and the Mariner Auction and Liquidation Centre building on Broom Rd.",
  "Felix Cacchione, director of SiRT said he was still brandishing a loaded sawed-off 12-gauge shotgun. He was ordered to stop and drop the weapon several times, but he ignored police.",
  "“He had the weapon pointed under his chin, then looked at the officers, lowered the firearm and pointed it in their direction,” he explained. “At that point the officers discharged their weapons.”",
  "Four shots were fired by three officers. Three of the bullets hit the suspect, two in the abdomen and one in the leg.",
  "Police and EHS, who had already been called the scene, immediately began first aid, but Clattenburg soon died of his injuries.",
  "“The police are entitled to use lethal force if they are protecting themselves from imminent death or grievous bodily harm … they were forced to make a split second decision and they relied on their training and experience,” Cacchione said. “They had reasonable grounds to believe they were in danger.”",
  "Because of that, SiRT has concluded there are no grounds for charges against the officers."
]