[
  "Montebello man shot by Quebec police was armed with a knife: investigators",
  "The man shot and killed by police in Montebello had a lengthy criminal record, and according to acquaintances at the scene of Thursday’s shooting was hiding out from the law in the sleepy west Quebec village.",
  "Danny Lafrance-Godmer, 29, has 41 entries in Quebec’s criminal database, including a 2009 conviction on assault with a weapon and criminal harassment, and 2015 sexual assault charges against a minor under 16, distribution of sexually explicit material to a minor and disorderly conduct.",
  "He was due in Montreal court Friday on charges from June 2015 of uttering threats and intimidation.",
  "On a Facebook profile bearing a similar name, the user posted an urgent request for a ride from Hull to Montreal the day before the shooting.",
  "Lafrance-Godmer, known to his associates as Dany Godmer, was living in a rented house at 215 Saint Francois Xavier, just off Montebello’s main street, where he moved in with a girlfriend about five months ago, according to a relative of the girlfriend who spoke to the Citizen on the condition of anonymity. Police did not release the girlfriend’s name, and as the victim of a domestic incident, her name is not being reported.",
  "The relative suggested there were previous domestic incidents, and suggested police were already searching for Godmer, saying Godmer moved in to the Montebello home needing to “hide out from the cops.”",
  "According to the girlfriend’s account, Godmer awoke Thursday evening in a rage, and began threatening his girlfriend. She barricaded herself in a room while he allegedly threatened to kill her and himself.",
  "Godmer collapsed on a bed at one point, and the girlfriend quietly left, saying she needed to go buy smokes.",
  "She phoned police when she got outside.",
  "Sûreté du Québec responded Thursday to calls of a suicidal man alone at the home, according to a release by the Bureau des enquêtes indépendantes (BEI), the provincial police watchdog investigating the shooting.",
  "Police entered and searched the two-storey home, and noises in the attic led police to confront Godmer, who allegedly charged at them wielding a large kitchen knife.",
  "“He attacked them” with the knife when he was shot, according to the girlfriend’s relative.",
  "The BEI report says an unspecified number of officers drew their weapons and fired. Godmer was listed in critical condition, and later succumbed to his injuries in hospital.",
  "Nine investigators with the BEI have been assigned to the case. The arm’s-length agency investigates all incidents of police shootings in the province.",
  "The BEI said it has also enlisted the support of the Montreal Police Service."
]