[
  "UPDATED: Mother of man shot by Summerside police calling for coroner's inquest, wants answers",
  "Jeremy Stephens, 32, was shot on May 27. He died later that day of his injuries",
  "– The mother of the man shot by Summerside police during a confrontation on May 27 is calling for a coroner’s inquest.",
  "Julie Kirkpatrick, counsel for Gilda Stephens, mother of Jeremy Stephens, released a statement on Monday.",
  "“My son Jeremy Stephens was shot six times on the morning of May 27 by police officers employed by the Summerside Police Department. Jeremy died at approximately 1 p.m. on the same day after undergoing two surgeries at Prince County Hospital.”",
  "Jeremy, 32, was believed to have been involved in a robbery at the Quality Inn on Water Street in Summerside. He was later located at a Duke Street residence, and after observing the property, police attempted to apprehend him and another suspect. Police say Jeremy ran back into the residence and used violence while police tried to apprehend him.",
  "In her statement, Stephens says she is grateful for the work of the doctors and nurses at the hospital that day.",
  "“With the utmost of respect for the position occupied by the Chief of Police and his officers in our small community, it is surely too soon to draw any conclusions about what exactly happened on May 27. The Serious Incident Response Team (SiRT) in Halifax is in the midst of its independent investigation and I have been told that their investigation will take months.”",
  "Stephens says she has not been contacted by the investigating coroner but has instructed her lawyer to request an inquest.",
  "“I am deeply troubled by the following information:",
  "The Summerside Police Department has a gun for every police officer, but only four tasers which are not routinely carried by police;",
  "In the altercation that occurred between Jeremy and the police it appears that after Jeremy was shot, he was laid on the floor and then handcuffed;",
  "It appears that after Jeremy was handcuffed he was then marched or dragged up the stairs and put into a police cruiser;",
  "The police officers who shot Jeremy transported him to the hospital themselves.”",
  "In addition, Stephens says she has asked police and SiRT for written confirmation of dash-cam evidence from the police cruiser that was used to transport Jeremy to the hospital.",
  "In her statement Stephens says she has also requested documentary evidence of all 911 call recordings, any video or audio recordings including police station cameras, body cameras and dashboard cameras, and all text messages, emails and incoming or outgoing phone calls from the involving officers.",
  "“Jeremy struggled his whole life with addiction and mental health difficulties, and was frequently in trouble with the law, largely because of his addictions. He was not a stranger to police. In fact, many police officers throughout Prince Edward Island knew Jeremy, and understood who he was and what his struggles were.",
  "“I cannot imagine any situation in which shooting Jeremy six times at close range was the only option available to police,” said Stephens in the statement.",
  "Kirkpatrick added, “It’s important to note his struggles with mental health and addictions began as a young person. Sometimes he was able to get the support necessary. Other times he wasn’t.”",
  "Kirkpatrick has represented cases in other provinces similar to Stephens’s, including the family of Matthew Hines, who died while in custody at Dorchester penitentiary in May 2015.",
  "Stephens continued, “So far, the information that I have received about Jeremy’s death has been confusing. I will be very relieved once a thorough and independent investigation has been completed by the Serious Incident Response Team. I need to know the truth.”",
  "Monday afternoon, Stephens and other family members attended a court appearance for one of the suspected robbers in the May 27 incident.",
  "“Gilda is taking things step by step. She has a lot of questions. I’ve sent out letters to all of the relevant agencies like police, ambulance, hospital and SiRT for answers,” said Kirkpatrick.",
  "“It’s been three weeks since Jeremy’s death. You can imagine the pain and grief. It’s something that’s impossible to describe.”",
  "Fighting tears, Stephens added, “Jeremy was a good kid. Everybody that knew him loved him.”",
  "Summerside Police Chief David Poirier declined to comment while the Serious Incident Response Team continues with their active investigation into the shooting.",
  "Julie Kirkpatrick, counsel representing Gilda Stephens, mother of the man who was shot by police and later died in hospital, is asking the Island’s coroner to use their discretion and call for an inquest into the death of Jeremy Stephens.",
  "He, was shot on May 27 after “using violence” while police tried to apprehend him.",
  "“Under the provincial coroner’s act, the coroner’s office has to be notified when a death occurs in custody or while detained in or by an institution.”",
  "An inquest can be called for deaths that occurred while the deceased was detained or in custody or occurred while the deceased was detained by or in the custody of a police officer.",
  "“But it is not mandatory to hold an inquest for a death which occurs in police custody. It is mandatory in section 18 where a death occurred while a person is an inmate,” she concluded.",
  "In Canada, the coroner’s act can vary in each province.",
  "She added, “on P.E.I., why isn’t an inquest mandatory for a case like this? It’s in the discretion of the coroner to call an inquest into a death that raises questions or is of public concern.”",
  "My son, Jeremy Stephens was shot six times on the morning of May 27 th , 2018 by police officers employed by the Summerside Police Department on Prince Edward Island. Jeremy died at approximately 1:00 p.m. on the same day after undergoing two surgeries at the Prince County Hospital. I am grateful for the work of the doctors and nurses at the hospital that day and I know that they all tried very hard to save Jeremy’s life. The Summerside Police Department has spoken out in the media saying that the two police officers’ jobs will be waiting for them when they are “ready and willing” to return to work. With the utmost of respect for the position occupied by the Chief of Police and his officers in our small community, it is surely too soon to draw any conclusions about what exactly happened on May 27 th , 2018. The Serious Incident Response Team (SIRT) in Halifax is in the midst of its independent investigation and I have been told that their investigation will take months. I also strongly believe that an inquest into Jeremy’s death should be called under the Coroners Act . I have not been contacted by the investigating coroner and have instructed my lawyer to reach out to him to request an inquest. I am deeply troubled by the following information:",
  "1.The Summerside Police Department has a gun for every police officer, but onlyfour tasers which are not routinely carried by police;",
  "2.Despite conducting “surveillance” on the residence where Jeremy was for over anhour before Jeremy came out of the building to have a cigarette, police did notarrange for a taser to be made available to them;",
  "3.In the altercation that occurred between Jeremy and the police it appears thatafter Jeremy was shot, he was laid on the floor and then handcuffed;",
  "4. It appears that after Jeremy was handcuffed he was then marched or dragged up the stairs and put into a police cruiser;",
  "5. The police officers who shot Jeremy transported him to the hospital themselves;",
  "6. The information that was received by Prince County Hospital, which was then relayed to me upon my arrival, was that the police had “found” Jeremy and saved his life by bringing him to emergency. This was not true;",
  "7. The police cruiser in which Jeremy was transported had a dash-cam. I have asked the police and SIRT for written confirmation that the following documentary evidence has been retrieved and preserved:",
  "(a) all 911 call recordings;",
  "(b) any video or audio recordings, including police station cameras, body cameras and dashboard cameras;",
  "(c) all text messages, emails and incoming or outgoing phone calls involving the involved officers.",
  "Jeremy struggled his whole life with addiction and mental health difficulties, and was frequently in trouble with the law, largely because of his addictions. He was not a stranger to police. In fact, many police officers throughout Prince Edward Island knew Jeremy, and understood who he was and what his struggles were. I cannot imagine any situation in which shooting Jeremy six times at close range was the only option available to police.",
  "So far, the information that I have received about Jeremy’s death has been confusing. I will be very relieved once a thorough and independent investigation has been completed by the Serious Incident Response Team. I need to know the truth.",
  "I will not be speaking with the media while the SIRT investigation is ongoing and ask that all queries be directed to my lawyer, Julie Kirkpatrick at 416-274-8996."
]