[
  "ASIRT clears RCMP, Edmonton police officers in deaths where controversial 'excited delirium syndrome' was a factor",
  "Alberta’s law enforcement watchdog has cleared police in two separate incidents in which suspects went into “medical distress” and died following rough arrests.",
  "On Friday, the Alberta Serious Incident Response Team released its findings on two police-involved deaths: the 2018 death of Emroy Cardinal, and the 2019 death of an unidentified Edmonton man.",
  "Cardinal, 38, died after being repeatedly shocked with a Taser while RCMP attempted to arrest him at a St. Paul hotel. The Edmonton man, 43, was taken to the ground by police after setting a series of small fires. He told police he was “suffocating” minutes before officers noticed he had stopped breathing.",
  "Autopsies attributed the Edmonton man’s death to “struggle with/restraint by police combined with methamphetamine use,” while Cardinal’s death was chalked up to “excited delirium syndrome as a result of cocaine toxicity.” Both men had signs of underlying heart disease.",
  "Amanda Hart-Dowhun, a lawyer representing the Edmonton man’s family, said both cases were examples where police involvement in a mental health crisis escalated the situation.",
  "“We have this situation where it started as essentially as a mental health call, and then within 10 minutes it escalated from a mental health call to a death,” she said of the Edmonton case. “There has to be a better way.”",
  "Cardinal, a member of the Whitefish Lake First Nation, began behaving strangely after checking into the Hampton Inn in St. Paul. Just before 2 a.m. on July 31, 2018, the desk clerk noticed him damaging cars and smashing windows in the parking lot. Cardinal told his wife “that people were there to shoot him.” The woman later told the clerk that Cardinal did not have his medication and that he was “acting schizophrenic.”",
  "Cardinal eventually entered the lobby and continued to damage property. Two RCMP officers arrived and tried unsuccessfully to arrest him, after which he retreated to a storage room. He later grabbed a pair of scissors and, according to the officers, continued to resist, swinging at them and even pinning one of them to a wall. One of the officers was struck several times and was bleeding from her mouth, ASIRT said.",
  "Cardinal’s wife told ASIRT she thought she could have talked him down, but police “just told her to go away.”",
  "During the struggle, officers fired their Tasers four times, at least one of which hit Cardinal. He eventually dropped to the floor, where officers used kicks, punches and a “lateral neck restraint” to subdue him.",
  "Officers later noticed Cardinal was in “medical distress” and began CPR until an ambulance arrived. He was pronounced dead on arrival at the local hospital.",
  "In a report released Friday, ASIRT executive director Michael Ewenson concluded the officers involved in Cardinal’s death followed the law and had done everything possible “to resolve the situation without serious injury or death.”",
  "“Unfortunately, excited delirium syndrome as a result of cocaine toxicity was not something the subject officers could control.”",
  "Edward and Emilene Blood, Cardinal’s parents, questioned the excited delirium finding, made by Dr. Mitchell Weinberg of the Edmonton medical examiner’s office. He said his family is “very disappointed” with the outcome and said the presence of police only escalated the situation.",
  "In 2021, the American Medical Association criticized the concept of excited delirium as a medical diagnosis, saying it “has been misapplied and diagnosed disproportionately in law enforcement-related deaths of Black and Brown individuals.”",
  "A nearby resident captured video of the arrest of the unidentified Edmonton man, who was seen burning paper near 114 Street and Jasper Avenue after dark on June 28, 2019.",
  "The first officer on scene said the man refused to stop when told he was under arrest for arson. The officer told ASIRT he worried the man might flee or assault him, so he grabbed him by the arm, attempted to lock it behind his back, then took him to the ground when he tried to pull away.",
  "Two of the officers speculated the man might have been experiencing “excited delirium.”",
  "Summarizing the officer’s interview, ASIRT said the man was “unrelenting in his struggle on the ground,” such that two officers were unable to get him in handcuffs. He later “made a sudden and explosive movement” to escape the officers.",
  "Eventually, police were able to handcuff the man and use a “hobble” strap to secure his feet. A spit mask was attached to his face. A few minutes after the resident started filming, the man can be heard to say “I’m suffocating,” to which one of the subject officers replied “no, you’re not.” Officers later transferred him to a police van but removed him when they noticed he stopped breathing. The man’s head struck the pavement as officers carried him to perform CPR.",
  "In his report, Ewenson said the victim’s “suffocating” comment was concerning, but noted the medical examiner’s findings “remove such concern.”",
  "“As was previously noted, the cause of death was found to be struggle with/restraint by police combined with methamphetamine use,” Ewenson wrote, adding the victim’s enlarged heart and history of schizophrenia were contributing factors. “Importantly, the medical examiner found the mechanism of death to be unstable electrical activity in the heart.”"
]