[
  "Man shot and killed by Edmonton police fired rifle at officer, sources say",
  "Sterling Ross Cardinal, 29, was killed by police on Aug. 18 after a confrontation involving a stolen vehicle",
  "After he was ordered to surrender, the driver of a stolen vehicle involved in a hit-and-run Saturday evening fired a rifle at police before he was shot and killed by an officer, CBC News has learned.",
  "Sterling Ross Cardinal, 29, was driving a stolen vehicle that was involved in a collision with another vehicle in the area of 66th Street and 123rd Avenue just before 10 p.m. Saturday.",
  "Two police officers approached the vehicle and ordered the suspects to come out with their hands up, according to the Alberta Serious Incident Response Team​ (ASIRT).",
  "The passenger, Clifford Johnathan Gladue, surrendered and was not injured.",
  "But then a confrontation occurred during which Cardinal shot at police, sources say.",
  "One of the officers fired at Cardinal, who was killed.",
  "A sawed-off, lever-action .30-30 rifle was found in the stolen vehicle. ASIRT is now investigating the circumstances that resulted in Cardinal's death.",
  "Gladue, 29, is in custody and faces seven charges related to the Aug. 18 incident including possession of a firearm without a licence, possession of stolen property, possession of a prohibited firearm, hit and run and disqualified driving.",
  "He appeared for a bail hearing in an Edmonton courtroom Wednesday via closed-circuit TV from the Edmonton Remand Centre. His hearing was adjourned until Sept. 19 to allow him time to obtain legal counsel.",
  "Both Cardinal and Gladue were wanted on Canada-wide warrants for statutory release violations, and have a lengthy history of criminal charges and convictions related to drugs and violence.",
  "Cardinal had previously served three years in prison for aggravated assault and was prohibited from owning firearms.",
  "The stolen vehicle involved in Saturday's confrontation had been chased by police a week or two prior, sources say.",
  "ASIRT executive director Susan Hughson said the agency is still interviewing witnesses of Saturday night's fatal shooting.",
  "\"There's no doubt in my mind, based on the information that we have, that this was a very high-risk situation,\" she said.",
  "Cardinal was an Indigenous man from Calling Lake and a father of three, including a two-month-old baby boy.",
  "Jocelyn Coutrie, that boy's mother, said she was in a common-law relationship with Cardinal but were recently on a break. She said he was a good father and she called him the love of her life.",
  "\"He always had a smile on his face,\" Coutrie said in a Facebook message. \"And he will be missed very much by me and his family.",
  "\"It hurts to think that he's never coming home to me and our baby boy.\"",
  "Craig Louis was helping to make funeral arrangements on Tuesday for Cardinal, who he said was his best friend.",
  "He said they had gone to the Kainai Powwow together last month in Stand Off, Alta. Louis said he was working toward changing his life for the better.",
  "At the end of the day, he said, Cardinal was a human being who could have been anyone's little brother.",
  "Cardinal's sister, Angelina Merkle, said her big brother's funeral will be held Thursday.",
  "She said loved his family — and especially his kids.",
  "\"Regardless of who anyone is involved with and chooses to allow in their life, [it] doesn't mean they are bad people,\" she said.",
  "\"Life is not fair most times. Nobody is perfect. We, the family, lost a good, respected person. That will be sadly missed.\""
]