[
  "News Sep 5, 2018 – 6:15 pm EDT",
  "Nunavik man killed following overnight standoff",
  "Inukjuak man releases three hostages, continues shooting",
  "By NUNATSIAQ NEWS",
  "A Nunavik man was killed Sept. 5 after he fired his weapon at police officers, who shot back, fatally wounding the 40-year-old in Inukjuak, a community of about 1,700 along the region’s Hudson coast. (FILE PHOTO)",
  "(Updated Sept. 6)",
  "A man was shot and killed on Wednesday, Sept. 5 following an overnight standoff with police in the Hudson coast community of Inukjuak, in Nunavik.",
  "Quebec’s independent investigation agency, the Bureau des enquêtes indépendantes, has now taken over the investigation of the incident, in which the 40-year-old man died in an apparent gun fight with officers from the Kativik Regional Police Force and the Sûreté du Québec provincial police force.",
  "In a news release, the BEI said the incident began on the evening of Sept. 4, when the armed man is alleged to have taken three hostages and barricaded himself and the hostages inside an Inukjuak home, while threatening suicide.",
  "KRPF and SQ officers surrounded the home, while the man fired a rifle a number of times from inside the residence, the BEI said.",
  "Following overnight negotiations, the BEI said the man released the three hostages early Sept. 4, though the man did not surrender.",
  "Later the same morning, just after 11 a.m., the man reportedly fired his weapon again, this time directly at police, the BEI said.",
  "Police officers fired back, killing the man. The BEI has identified him as Tommy Ningiuk, of Inukjuak.",
  "Six investigators from the BEI are now en route to Inukjuak to verify how the incident unfolded. The BEI is called in to investigate any incident in which a civilian is injured or killed during a police intervention.",
  "Anyone who witnessed the event should contact BEI investigators at www.bei.gouv.qc.ca.",
  "The bureau is also investigating other police-involved violent deaths and injuries in Nunavik:",
  "• An Umiujaq woman seriously injured by a police car.",
  "• A man who died day after KRPF handled a domestic abuse complaint in Inukjuak.",
  "• The death of a man in Umiujaq.",
  "• The death of a man in Puvirnituq.",
  "• The death of a man in Akulivik.",
  "• The death of a man in Inukjuak."
]