[
  "Edmonton man fatally shot by police identified as construction worker",
  "Vitaly Savin came at Edmonton police officer with knife before fatal shooting, CBC told",
  "Vitaly Savin, shown here in an undated photo, was shot and killed during a confrontation with an Edmonton police officer Thursday. (Facebook)",
  "The man shot and killed by a police officer at a traffic stop in southwest Edmonton Thursday has been identified as Vitaly Savin, sources tell CBC News. ",
  "An employee of an Edmonton home construction company where he had worked, confirmed he worked there as a subcontractor.",
  "Savin's LinkedIn page says he's worked for more than eight years in Edmonton as a drill operator with the company, called Great Canadian. Prior to moving to Edmonton, he worked as a mining engineer in Russia. ",
  "",
  "On his Facebook page, Savin, 55, is still connected to family and friends in Russia.",
  "Vitaly Savin's LinkedIn page says he worked for more than eight years in Edmonton as a driller with a construction company called Great Canadian. (Facebook)",
  "A court check shows Savin as having no criminal record.",
  "At around 1:30 p.m. Thursday, Edmonton Police Service received two 911 calls from citizens reporting a possible impaired driver.",
  "A patrol officer, driving a marked police vehicle, located the suspect vehicle in a cul-de-sac near Hollands Landing in the Hodgson neighbourhood in southwest Edmonton.",
  "The officer pulled over the driver. Both got out of their cars. There was a confrontation, the Alberta Serious Incident Response Team (ASIRT) said.",
  "The officer shot the man, who was pronounced dead at the scene.",
  "An officer-involved shooting Thursday in southwest Edmonton is under investigation by the Alberta Serious Incident Response Team. (Phil Laplante/CBC)",
  "Witnesses to the shooting in southwest Edmonton Thursday have told police the driver came at the officer with a knife, sources told CBC.",
  "",
  "ASIRT, which is investigating the shooting, reported in a news release Friday a large hunting knife was recovered near the driver's body.",
  "While ASIRT has not identified the shooting victim, the release said he was 55 years old.",
  "ASIRT is investigating the circumstances surrounding the confrontation that resulted in the officer firing his police-issue firearm and is encouraging anyone with information or who witnessed the incident to call them. ",
  "An autopsy is scheduled for Friday.",
  "",
  "ASIRT's mandate is to investigate incidents involving Alberta's police that have resulted in serious injury or death to any person, as well as serious or sensitive allegations of police misconduct."
]