[
  "Report breaks down what happened between Timmins Police, Joey Knapaysweet",
  "EDITOR'S NOTE: This article contains graphic content that some readers may find disturbing.",
  "More than a year after Joey Knapaysweet died, a Special Investigations Unit (SIU) report has cleared Timmins Police of wrongdoing in his death.",
  "The 21-year-old was shot four times by a Timmins Police officer at Gillies Lake on Feb. 3, 2018.",
  "Today, SIU director Tony Loparco's report on the investigation was released and determined there are no reasonable grounds to lay criminal charges in relation to the shooting death.",
  "The SIU is an arm's-length agency that investigates police-involved incidents where there has been a death, serious injury or allegations of sexual assaults.",
  "In the report, the SIU refer to the officer who discharged his weapon as the subject officer (SO) and Knapaysweet as the complainant.",
  "According to the report, the incident played out in seven minutes.",
  "That’s how long there was between a call being put into police asking for help at the ambulance bay to a police officer radioing that shots had been fired.",
  "At 10:09 a.m. Feb. 3, paramedics asked for Timmins Police’s help after a man walked into the ambulance bay.",
  "When he started telling paramedics “he wanted someone to shoot him in the head”, police were called a second time to report he was hallucinating and to relay the statements.",
  "“While the paramedics were trying to communicate with the Complainant, he put two knives to his throat and asked if he should do it himself,” reads the report.",
  "Paramedics convinced him to take the knives away from his throat and directed him to leave the bay. He complied and went to the back parking lot.",
  "According to the report, the first officer on scene got out of his vehicle and tried to talk to Knapaysweet.",
  "The report says he lunged at the officer while holding the two knives. The officer got back into his vehicle and drew his Conducted Energy Weapon (CEW). The man backed away from the cruiser and ran northbound to Gillies Lake. While running, he discarded his backpack and one of the knives.",
  "The first officer on scene radioed other officers to alert them that the man was armed and heading to Gillies Lake. The subject officer heard the call, drove to the Gillies Conservation Area parking lot and saw the man running through the parking lot to the snow-covered lake.",
  "“The SO exited his police vehicle and chased after the Complainant, and out onto the frozen lake. There was a significant amount of snow on the lake, making it difficult to manoeuvre. The Complainant is seen on Closed Circuit Television (CCTV) footage from the ambulance base to stop and turn to face the SO; unfortunately, the footage is poor due to the great distance between the camera and the incident, and a tree partially obstructs the view,” reads the breakdown.",
  "The subject officer drew his CEW and pointed it at Knapaysweet, while telling him drop the knife. The CEW was used, but appeared to be ineffective.",
  "Knapaysweet moved towards the officer with the knife still in his hand.",
  "The officer dropped his CEW and drew his service pistol, which the SIU says is captured on the CCTV footage, and fired “a volley of four shots”.",
  "“The Complainant then fell forward into the snow, about two metres in front of the SO. The Complainant remained conscious and continued to hold onto the knife, while in a partially seated position in the snow. The SO continued to repeat commands to drop the knife, while he maintained gunpoint coverage of the Complainant until other police units arrived,” reads the report.",
  "Once there were four officers on scene, the four carried Knapaysweet across the lake to an ambulance. He was pronounced dead at the hospital at 10:45 a.m.",
  "A post-mortem was done Feb. 5, 2018. The cause of death was multiple gunshot wounds, which lead to blood loss and hemorrhagic shock.",
  "There were four gunshots wounds: the upper back (the direction of the bullet was back to front, slightly downward and slightly right to left), pelvis region (the direction was front to back, downwards, left to right), right thigh (the direction was front to back, slightly downwards, left to right), upper arm (the direction was front to back).",
  "The toxicology report showed the presence of a ‘variety of drugs’, most significantly methamphetamine, cocaine and THC.",
  "Loparco addresses the shot that entered from the back to front in the analysis of his decision.",
  "“While at first blush this may raise some suspicions as to the position of the Complainant in relation to the SO when the SO discharged his firearm, it is without dispute, based on both the video evidence and that of the independent CWs, that the Complainant was both facing, and advancing toward, the SO when the SO discharged his firearm,” he wrote.",
  "“While this may seem inconsistent with the forensic evidence, I can only surmise that while the SO was discharging his firearm, after the first, or more, of the bullets struck the Complainant, his body either twisted or turned, or he leaned forward causing the last bullet to enter through his back. I find, on all of the evidence, that the SO did not initially discharge his firearm when any part of the Complainant’s back was turned towards him. While I am not an expert in this area, I note that there is some literature which supports the conclusion that during the time that it takes to discharge a firearm, a body can change direction resulting in a bullet entering from the back. I find further support in this conclusion from the fact that the bullet which entered from the back did so on a downward angle, which would appear consistent with the Complainant bending forward after being initially struck, causing the last of the projectiles to enter through his left upper back and exiting through the left chest wall.”",
  "The knife removed from Knapaysweet’s hand was a kitchen knife with a five-centimetre blade. The second knife found near his knapsack was a paring knife with a 5.9-centimetre blade.",
  "Loparco’s analysis also talks about why the knife is described as a deadly weapon, even though it looks small in size.",
  "“While there may be some who believe that this small of a knife was not a serious threat to the life or safety of the SO, I wish to indicate that I have no hesitation whatsoever in finding that the Complainant was quite capable of inflicting serious bodily injury, if not death, had he been allowed to continue to advance upon the SO to a point where he could use the weapon against the SO,” he said.",
  "As evidence, he referenced a case where a constable was murdered with a small pen knife. To avoid body armour, he was stabbed in the thigh, nicking his femoral artory.",
  "Aside from the CCTV footage from the Cochrane District Social Services Administration Board, the incident is also partially captured by cameras on the police vehicles.",
  "A civilian witness took cell phone video, although it doesn’t capture the shooting, he relays what he had seen seconds before in it.",
  "The report says that version of events is consistent with evidence another civilian witness provided to SIU investigators.",
  "“I find this evidence, recorded within seconds of the events occurring, to be extremely compelling as there was no opportunity for memories to fade or facts to become confused. In his narrative, he is heard to say, “Shots were fired. They Tasered him first, he didn’t move, he didn’t stop, so…. I heard three shots. I can’t see that much from here. I’m on the other side of Gillies. Suspect started running across, he stopped, then he started to run at the officer.”",
  "In total, 16 civilian witnesses were interviewed. Members of the complainant’s family declined to be interviewed by SIU investigators.",
  "Three witness officers were interviewed, and their notes were reviewed. Five witness officers had their notes reviewed, and it was determined an interview wasn’t necessary as they arrived at the scene after the event happened.",
  "The subject officer waived his rights under the Police Services Act to give a statement to SIU investigators. He declined to give copies of his notebook, which the SIU says is his legal right.",
  "Four Nishnawbe-Aski Police Services officers were interviewed to allow the SIU to get background information on their past interactions with Knapaysweet in Fort Albany. “While the NAPS does not fall within the SIU’s jurisdiction, they were not obligated to submit to interviews, as were the TPS officers,” reads the report.",
  "A list was also found in Knapaysweet’s backpack. The first item on the list is to “kill every cop in town”. It also includes taking over the town, rob dealers, get really high, kill everyone on my hitlist, hit people on the road with at truck, lock someone in a cop truck then burn alive.",
  "You can read the full report here."
]