[
  "Calgary police committed ‘serious breaches’ of policy in fatal traffic stop: ASIRT",
  "Officers failed to properly box in the suspect's vehicle, leading to the fatal shooting of the 30-year-old woman on Dec. 25, 2018, an investigation has concluded",
  "Serious breaches of Calgary police policy occurred during a high-risk traffic stop that ended with the fatal shooting of a 30-year-old woman on Christmas Day 2018, an investigation has concluded.",
  "The driver — later identified by family as Stacey Perry — was shot three times at close range while trying to flee police who had boxed in her car following repeated attempts to stop her.",
  "However, an Alberta Serious Incident Response Team (ASIRT) investigation released Friday found that the officer who shot Perry, fearing for the safety of a female officer pinned between vehicles, did not commit any offence.",
  "“The subject officer reacted to the immediate risk of serious injury or death to his fellow officer,” the ASIRT report states.",
  "“There were serious breaches of CPS policy that led to that dire situation. However, the blame for those breaches does not rest with the subject officer, who was following the directions of his superiors and not trained in the technique used, and they do not give rise to any criminal liability for him.”",
  "Several CPS vehicles surrounded Perry’s car around 2:30 a.m. in response to 911 calls about three hours after she was first seen driving erratically on Blackfoot Trail S.E.",
  "CPS policy states only officers trained in low-speed, box-in techniques are authorized to execute the manoeuvre. Of those directly involved in the Dec. 25 encounter, only one, a sergeant, was properly trained.",
  "The ASIRT investigation found an acting staff sergeant authorized officers to surround and stop the vehicle, even though vehicle intervention training wasn’t offered to patrol officers at the time.",
  "“While the box-in manoeuvre initially appeared to be succeeding and the woman’s vehicle was brought to a stop, any success quickly disappeared,” the report states.",
  "A sergeant positioned his vehicle in front of Perry’s while three others moved to both sides and the rear. The police vehicle on the driver’s side, positioned by the officer who ultimately became trapped, was not close enough to Perry’s car, the investigation found.",
  "Several officers exited their vehicles and three approached.",
  "One of the three told the driver to turn off the vehicle before smashing the driver’s side window with a baton and trying to remove her from the vehicle. A second opened the passenger-side door while the third stood between the vehicles.",
  "Perry accelerated her vehicle, moving her car into the gap on the driver’s side and forcing the passenger door of that police vehicle closed, pinning the female officer, who was lifted off her feet by the force.",
  "“The trapped officer was in serious and immediate danger. The woman was heavily applying the gas in her vehicle, to the point that rubber was flying off the tires,” the report states.",
  "The officer who had tried to remove Perry from her car then fired three times at close range. All three shots struck Perry in the head, an autopsy showed.",
  "Only 40 seconds elapsed between police stopping Perry and the fatal shots.",
  "“Using high-risk techniques with untrained officers directly led to the trapped officer being put in a situation of the immediate risk of death or grievous bodily harm, and this directly led to the reasonable use of lethal force by the subject officer,” the report states.",
  "The female officer was not injured. ASIRT investigators said she should have remained in the police vehicle with her foot on its brake.",
  "“It is not the fault of the subject officer or the trapped officer that they did not follow training that they did not and could not have. They followed the direction of their superior officers,” the report states.",
  "Perry first drew officers’ attention shortly before midnight on Dec. 24 when she was seen driving very slowly and erratically on Blackfoot Trail S.E. Suspecting she might be impaired, officers attempted to pull over the vehicle but it accelerated away. Officers opted not to pursue the vehicle.",
  "A second traffic stop minutes later was also unsuccessful as the driver sped away.",
  "Callers to 911 reported a vehicle being driven recklessly on Falconridge Boulevard N.E. Officers located the vehicle minutes later when the driver ran a red light and was on the wrong side of the road prior to the box-in on McKnight Boulevard near Stoney Trail.",
  "Perry had no criminal record or involvement with police before December 2018.",
  "A toxicology report showed she had cocaine and prescribed benzodiazepine medication in her system.",
  "ASIRT said it’s for CPS to determine next steps in dealing with the policy breaches."
]