[
  "Saskatoon police officer pleaded with Steven Rigby not to harm himself",
  "In the final moments of the call, Cst. Jordan Lapointe heard Rigby fire shots then the sound of what he believed to be returned fire. He heard Rigby hit the ground and moan.",
  "A Saskatoon police officer spent more than an hour on the phone begging his friend not to harm himself before hearing gunshots and Steven Rigby’s final moments.",
  "Cst. Jordan Lapointe shared the story Monday during the opening day of what’s expected to be a four-day inquest into Rigby’s death.",
  "Lapointe told the inquest that he’d been on patrol the night of Dec. 22, 2018 when he got calls from people who were concerned about 27-year-old Rigby.",
  "One call came from Rigby’s mother, Carey Rigby-Wilcox, who said she had seen Rigby, that he had a gun and that he fired two rounds into the air. Lapointe told her to get back into her vehicle and call 911. He went back to the police station and called Rigby.",
  "Rigby told Lapointe he had a 9-mm handgun and 21 rounds, Lapointe said. Rigby apologized and told him it would be their last conversation. Lapointe pleaded with him not to hurt himself.",
  "Rigby wouldn’t say where he was, but told Lapointe he was near the landfill.",
  "He came across an RCMP road block while talking to Lapointe and asked Lapointe to get the officers to let him through. Lapointe heard RCMP officers tell Rigby to show his hands.",
  "“He seemed different, almost like he was scared or something like that,” Lapointe said.",
  "Rigby stayed in the car, kept driving and continued to talk with Lapointe on the phone.",
  "Saskatoon police responded and used a tire deflation device to disable Rigby’s car, but Rigby kept driving.",
  "A crisis negotiator tried to assist over the phone, and the two friends continued to talk.",
  "Lapointe heard Rigby fire shots on three occasions. In the final moments of the call, Lapointe heard Rigby fire shots then the sound of what he believed to be returned fire. He heard Rigby hit the ground and moan.",
  "At that point, another officer at the station took Lapointe’s phone away.",
  "Lapointe said Rigby was one of the greatest guys and had been dealing with anxiety and depression.",
  "He had previously told Lapointe and their friends if he were to “go out” it would be in a shootout with police.",
  "Rigby had been hospitalized for an attempted suicide a couple days before his fatal encounter with police and released the next day. Lapointe doesn’t think that Rigby should have been released so soon.",
  "“He had some serious trauma going on with him,” Lapointe said.",
  "Rigby’s family said they were able to watch video footage of Rigby’s final moments before the inquest began. Police video footage from Dec. 22, 2018 shows Rigby shooting a firearm into the air before the deadly confrontation, his mother said.",
  "“We were relieved to see that the video never showed him shooting in the direction of police or attempting to do so. It was obvious to us he only wanted to hurt himself as he shot directly into the sky,” Rigby-Wilcox said in a statement before the inquest began.",
  "Trauma team physician Dr. Jon Witt testified that paramedics who attended the scene of the shooting found Rigby without a pulse. EMS attempted life-saving measures — including CPR — for more than 18 minutes before arriving at Royal University Hospital.",
  "Witt said Rigby was completely unresponsive and never regained a pulse. He had injuries to his abdomen, arm and thigh, with the most significant blood loss resulting from the abdominal wound.",
  "Witt said it was “not a survivable injury” and, after consulting with his team, he pronounced Rigby dead at 9:57 p.m. that night.",
  "Dr. Andreea Nistor, a forensic pathologist, testified that Rigby was struck by three bullets. The most serious wound was to his abdomen, where the bullet struck two large blood vessels and fractured his pelvis, Nistor explained.",
  "Nistor said toxicology results showed Rigby had alcohol in his system that was “multiple times” the legal limit for driving, she said.",
  "Shelly Martin, a friend of Rigby’s who worked with him at a SaskTel store in North Battleford, told the inquest that Rigby was normally a happy, positive person, but she noticed a change in him in the summer of 2018",
  "“To say he wasn’t himself is an understatement,” she said.",
  "She said Rigby would come to work shaky and clammy and would isolate himself in his office. He told her of a suicide attempt and she said he argued with someone on the phone before locking himself in his office. Martin broke in and Rigby told her he had taken about 30 of his prescription pills. He was taken to Battlefords Union Hospital.",
  "An inquest is a fact-finding, not fault-finding, process that establishes when and how someone died. The process may also highlight dangerous conditions or practices and the jury can make non-binding recommendations to prevent future deaths.",
  "The inquest is expected to run until Friday with lawyer Tim Hawryluk presiding as coroner.",
  "If you or someone you know is in immediate danger of self-harm or experiencing suicidal thoughts, please contact: Crisis Services Canada (1-833-456-4566), Saskatoon Mobile Crisis (306-933-6200), Prince Albert Mobile Crisis Unit (306-764-1011), Regina Mobile Crisis Services (306-525-5333) or the Hope for Wellness Help Line, which provides culturally competent crisis intervention counselling support for Indigenous peoples at (1-855-242-3310)."
]