[
  "Newly hired RNC officer fatally shot Jorden McKay in Corner Brook, sources say",
  "Sources say McKay, 27, approached officers with edged weapon prior to shooting",
  "The Royal Newfoundland Constabulary officer who shot and killed a man in Corner Brook during a confrontation late last month was new to the police force, sources tell CBC.",
  "The male officer who discharged his sidearm, killing Jorden McKay, was sworn in at a graduation ceremony in October.",
  "He and the senior female police officer who was also at the scene have been placed on administrative duties while the shooting is investigated.",
  "The RNC said it is procedure to place an officer on administrative duties after an incident such as this, adding it does not speak to any wrongdoing or guilt.",
  "The Ontario Provincial Police were called in to investigate the shooting, which happened late in the evening on Nov. 27 at McKay's Carriage Lane apartment in Corner Brook.",
  "There has been little information released on what led to McKay, a father of two with a criminal record, being shot by the officer. The RNC and OPP have declined comment.",
  "Sources did, however, tell CBC the shooting happened after McKay approached the two officers with an edged weapon.",
  "External investigations ongoing",
  "The OPP arrived in Corner Brook to take over the case shortly after the shooting.",
  "The OPP finished conducting interviews and gathering information in Corner Brook over the weekend, and have returned to Ontario to continue the investigation.",
  "The Alberta Serious Incident Response Team will conduct an independent, external review of the OPP's investigation.",
  "According to the RNC, the officers were responding to a criminal complaint. When they arrived, a confrontation between the officers and McKay took place, resulting in the male officer discharging his sidearm, say the police.",
  "McKay was taken to Western Memorial Regional Hospital in Corner Brook, where he was pronounced dead.",
  "McKay had a four-page criminal record, including charges of assault, unlawfully being in a dwelling, and breaches. The most serious incidents were convictions of assault with a weapon.",
  "He had been charged, three days before the shooting, with assault and breaching a court condition.",
  "Lisa McKay-Greening, McKay's sister, previously told CBC she had bailed him out, and was on the phone with him that night when officers knocked on the door of his rental apartment.",
  "She said she heard the voice of two officers, and \"they were angry.\" Her brother then hung up the phone.",
  "Sources said the officers had arrived at McKay's apartment earlier in the day, and had returned a second time after he allegedly broke a court condition.",
  "MacKay's sister told CBC News that, despite his criminal history, her brother was upbeat after spending the day filing an application to go back to school in an effort to turn his life around.",
  "About 45 officers work at the RNC's Corner Brook detachment.",
  "Recruits partnered with more experienced officer",
  "RNC Chief Joe Boland declined an interview on the fatal shooting, citing the ongoing OPP investigation.",
  "The RNC did, however, answer CBC's questions about how recruits work in the field.",
  "New officers are partnered with experienced officers when they are first assigned to patrol, an RNC spokesperson said in an email.",
  "The more senior officer would provide guidance to the recruit for the first year on the job.",
  "All patrol officers, regardless of their years of service, are trained and certified on the Use of Force Continuum — a guide that determines what level of force is appropriate in certain situations facing police officers.",
  "\"All recruit constables who graduate from the RNC's police cadet training program undergo extensive training in all of the competencies of a police officer and are equipped with the same standard use of force equipment as any other front line police officer,\" reads an RNC statement."
]