[
  "Girlfriend of man shot to death by Edmonton police claims officers used excessive force",
  "'I had to watch someone I love gunned down,' says Melissa Dumais",
  "The girlfriend of a wanted man killed by police on Boxing Day in an Edmonton parking lot believes police used excessive force.",
  "Buck Evans, 34, was shot by multiple officers around 2 p.m. last Wednesday after the truck he was riding in was stopped by police in the parking lot of the Urban Village condo complex.",
  "\"I had to watch someone I love gunned down, when literally there could've been different ways of going about it,\" ​ Melissa Dumais said in an interview with CBC News. \"I just don't see how it's fair. We all bleed the same. We all feel the same.\"",
  "Dumais said she has been consulting with a lawyer and plans to pursue litigation against the officers involved.",
  "\"I hope that I can get the cops that did this to him, because I am going to be taking it to court,\" Dumais said. \"I have enough evidence that this was excessive force.",
  "\"It may make my life a living hell, in the end. So be it.\"",
  "In a statement released last week, ASIRT said Evans refused to get out of the truck when ordered to by police. ASIRT said Evans fired a gun before he was shot by the officers.",
  "At the time, Evans was wanted in connection with an ongoing investigation and had outstanding warrants against him. Police believed he was armed and dangerous, and a tactical unit had been following the truck.",
  "\"Independent evidence gathered to date would suggest that the man was in possession of a firearm and that the firearm was, in fact, discharged by the man,\" the ASIRT release said.",
  "Man killed by police on Boxing Day fired gun, ASIRT says",
  "Dumais said she was in the truck with Evans and a friend on the day of the shooting. She said police stopped them and ordered her and their friend to get out of the truck.",
  "After speaking to Evans, she got out and was arrested. Dumais said Evans had tears in his eyes when he spoke to her.",
  "Fatal shooting under investigation",
  "She said when she got out of the truck, Evans was sitting in the backseat with his hands up.",
  "\"The gun was nowhere near his hands,\" she said. \"The driver had his hands up, I had my hands up. And Buck had his hands up.\"",
  "Dumais said she knew Evans had a gun when she got into the truck earlier that day.",
  "\"He knew what was coming,\" said Dumais, who had been dating Evans for about two months. \"He knew he was going to die that day.\"",
  "She said the gun was on the floor when she got out of the truck.",
  "Video of the incident shows police vehicles surrounding a truck near the Urban Village condo complex in southeast Edmonton. A barrage of gunfire can be heard on the video.",
  "\"The amount of gunshots that I heard go off, it just goes to show that either way he was going to die that day,\" Dumais said. \"Whether he complied or he didn't.\"",
  "Dumais was in handcuffs across the parking lot when the police began firing. The last time she saw Evans, he was being loaded into a stretcher.",
  "She said she knew he was dead.",
  "\"Being handcuffed, there was nothing I could do,\" she said. \"You want to be there for the person you love. You want to be beside them when they take their last breath.\"",
  "Change in behaviour",
  "Dumais said Evan's demeanour had changed in the days leading up to his death. He seemed frantic and was constantly looking over his shoulder.",
  "\"He told me that he felt like something bad was going to happen,\" she said.",
  "When she saw the gun in the truck, Dumais said, she questioned Evans about it. She described it as an SKS, a type of semi-automatic rifle.",
  "\"I seen that, and I instantly knew something was wrong.\"",
  "Dumais, who shared an apartment with Evans in the west end, said she did not know that he was wanted on outstanding warrants.",
  "\"I just want people to know that Buck wasn't a monster that they portrayed him out to be. He had a good heart. He's gone through a lot, but he's still a good person at the end of it all.\"",
  "ASIRT did not respond to an inquiry from CBC News. It is not known when their final report on the shooting will be released."
]