[
  "Knife-wielding woman shot to death by cops under provincial probe in Ontario",
  "More than six years after she was shot and killed by Hamilton police, the province has set a date for the inquest into the death of Robyn Garlow.",
  "Garlow, who also went by Bobbi, was shot and killed by a Hamilton Police Service officer on the evening of Oct. 18, 2018, according to reports.",
  "Ontario’s Special Investigation Unit says officers were called to an apartment building on King Street in Hamilton shortly before 1 a.m. after receiving a call about “a suicidal female who was armed with a knife.”",
  "When officers arrived they found a male who had called 911 and told police he had been cut by the woman.",
  "Police found Garlow in a bedroom standing on the bed with a knife in her right hand, the SIU says. Two officers ordered her to drop the knife but she refused, and one of the officers fired his conductive energy weapon also known as a Taser.",
  "But two hits with the Taser had no effect, and that’s when the woman made a move and “lunged aggressively” towards the officers.",
  "The officer pulled his service weapon and fired four times, striking Garlow twice. She was transported to hospital where she was pronounced dead shortly before 3 a.m., the SIU says.",
  "And while no charges were laid against officers, the province has set a date for an inquest into the shooting death.",
  "Inquests are public hearings conducted by a coroner before a jury of five community members. Regional Supervising Coroner Dr. Karen Schiff announced on Thursday that the inquest will go ahead starting on March 31.",
  "The hearings are held to inform the public about the circumstances of a death, and while the jury’s conclusions are not binding, the province says it hopes “that any recommendations suggested, if implemented, will prevent further deaths.”",
  "In 2019, SIU Director Joseph Martino called the incident a “tragic loss of life.”"
]