[
  "Quebec officer convicted of manslaughter in 2014 fatal shooting of teenager",
  "MONTREAL – A Quebec court judge convicted a provincial police officer Friday of manslaughter in the fatal shooting of a teenager in 2014.",
  "The ruling triggered a strongly worded condemnation from the union representing provincial police officers, who called the decision “incomprehensible and unacceptable.”",
  "Judge Joelle Roy said in his ruling that officer Eric Deslauriers was guilty of manslaughter for intentionally discharging a firearm without regard to the life or safety of others.",
  "The charge goes back to January 2014, when Deslauriers stopped 17-year-old David-Hughes Lacour in a parking lot after a short car chase in the town of Sainte-Adele Que., about 80 kilometres north of Montreal. Lacour had been driving a stolen vehicle.",
  "Deslauriers testified Lacour hit him with his car and, fearing for his life, he discharged his weapon. But Roy found that video evidence proved the car never struck the officer.",
  "“The young man had nothing in his hands and the accused had no information that could lead him to believe the teenager was dangerous,” Roy wrote in his ruling.",
  "“Was it necessary to shoot twice? The court does not believe so,” he continued. “Video (evidence) is unambiguous … the car did not touch the accused.”",
  "The provincial police union released a statement saying its members and the police community were “dumbfounded that a decision like this could be rendered.”",
  "It said the “excellent” officer acted in good faith, and he had “barely a few seconds to react.”",
  "“It is foreseeable that this event will cause a deep uneasiness in the police community,” the statement continued. “And is likely to provoke in some a disengagement of their professional actions in order to protect themselves from similar circumstances.”",
  "Deslauriers is due back in court in January for sentencing arguments and faces a minimum term of four years in prison, but could face the maximum sentence of life in prison.",
  "His lawyer said she will contest the constitutionality of the four-year minimum sentence."
]