[
  "Driver shot dead by police had been 'awake for days' on meth, passenger wanted to be killed by police: ASIRT",
  "When a driver was shot dead by police in February 2014 after leading officers on a dangerous chase through southeast Calgary, he had been awake for days from methamphetamine use and was in “the worst condition” his female passenger had ever seen him.",
  "The pair — identified by sources as Jason Gary Roy and Ashley Jennifer Silver — had been in a stolen Ford F350 driving erratically, travelling over sidewalks and crashing into vehicles, before they were finally stopped by police while going the wrong way in the southbound lanes of Deerfoot Trail.",
  "As Silver sat in the truck beside the fatally wounded Roy behind the wheel, she held her black sunglasses in front of her pointing them at the officers hoping they would mistake them for a weapon and shoot her dead, according to an investigation by the Alberta Serious Incident Response Team, a police watchdog tasked with reviewing the case.",
  "Police opened fire — striking Silver in the face — and she was taken to hospital with critical injuries which she survived. No firearms were found in the vehicle.",
  "Following an investigation spanning more than a year, Susan Hughson, executive director of ASIRT, confirmed the officers involved would not be charged with any criminal offences.",
  "“The finding in no way diminishes the sad fact that a family has lost their loved one,” Hughson added in a statement.",
  "The tense events unfolded around 9:15 p.m. on Feb. 28 when police responded to a complaint of shots being fired in the 1400 block of Copperfield Boulevard S.E.",
  "Officers spotted a dark grey Ford F350 truck making a U-turn on 130th Avenue S.E., heading east.",
  "The truck was seen driving on sidewalks, medians, curbs, pathways and through a fence, the ASIRT report said, prompting police to deploy their HAWCS helicopter. The vehicle continued to travel in a “very erratic and dangerous fashion,” including speeding, running red lights and making illegal turns.",
  "“The suspect vehicle was observed to intentionally ram multiple civilian vehicles causing injuries to innocent bystanders. It also attempted to sideswipe a marked police vehicle,” ASIRT said.",
  "The truck then got onto Deerfoot Trail, with police following in unmarked vehicles, heading south at a high rate of speed.",
  "Suddenly, the Ford made a sharp left turn, drove across the southbound lanes and intentionally smashed into the concrete barrier dividing the north and southbound lanes, causing the vehicle to face north in the southbound lanes, ASIRT said.",
  "The truck continued to drive the wrong way down Deerfoot Trail, and was rammed repeatedly by police vehicles until it was stopped at the McKenzie Lake overpass.",
  "In a news conference held shortly after the incident, then police Chief Rick Hanson told reporters the driver refused to surrender, instead stepping on the gas in an effort to escape, ramming police vehicles and heading toward an officer who was approaching him to make an arrest.",
  "Two officers — both experienced members of the tactical team — opened fire. Roy, 34, died at the scene. Silver, 27, was taken to hospital with critical injuries.",
  "“Our officers made a split-second decision based on the circumstances as they rapidly unfolded in order to prevent further serious risk to innocent members of the public,” Hanson had said at the time.",
  "He added the couple, who were “very well-known to police,” were out on conditions prohibiting them from associating with each other and were connected to a similar event in another jurisdiction “where a vehicle was used as a weapon and charges were laid.”",
  "In March 2013, the pair were charged with multiple offences — including dangerous driving, flight from police, and assault with a weapon on a police officer — after an RCMP vehicle was rammed while trying to stop two erratic trucks in the Canmore area. Roy was out on bail at the time of his death."
]