[
  "Alain Magloire said ‘Go ahead, shoot me,’ officer involved in shooting testifies",
  "Alain Magloire was agitated and angry in the moments before he was fatally shot by a Montreal police officer last year, a public inquiry heard on Tuesday.",
  "“He said: ‘Go ahead, shoot me, I don’t give a damn,’ ” Constable Jeanne Bruneau testified on the second day of the inquiry into Magloire’s death.",
  "Bruneau said she repeatedly instructed Magloire to drop a hammer he was carrying before he was shot by her colleague after he had tried to strike another officer with a hammer.",
  "Bruneau’s partner, Alex Campeau, also testified that Magloire told police to shoot him. “He raised his arm in the air, walked towards me and said: ‘Shoot me,’ ” Campeau said.",
  "Police were responding to a call last Feb. 3 about a man who was breaking windows in a downtown hostel. Bruneau said she spotted Magloire walking on Ontario St. shortly after being asked to respond to the call.",
  "When Campeau pulled up beside Magloire, Bruneau said he approached the police car and tried to hit her with his hammer through the window on the passenger’s side.",
  "“I took out my gun, I had my hand on the trigger and was ready to shoot,” Bruneau recalled. “But he backed away and I was able to regain my breath.” Bruneau, who had been a police officer for 18 months at the time, said she feared for her life.",
  "Campeau said he jumped out of the vehicle and ordered Magloire to drop his weapon. A construction worker who witnessed the confrontation also urged Magloire to listen to police and drop the hammer, Campeau testified.",
  "Bruneau and Campeau continued to follow Magloire down Berri St. where two other officers, Pascal Joly and Mathieu Brassard, joined them.",
  "The four officers stood in a semicircle on the street while Magloire was on the sidewalk. Joly tried to use pepper spray to subdue Magloire, but he was too far away and the wind made it ineffective, Bruneau said.",
  "Magloire then dropped his bags on the sidewalk and walked toward the officers with his hammer in his hand, the officers testified.",
  "An officer was en route with a Taser, which could have been used to neutralize Magloire. Bruneau said Magloire heard officers talking about the Taser and said: “Bring on the Taser, I’m ready.”",
  "However, before the Taser arrived, Magloire was hit by Constable Denis Côté’s police cruiser. After rolling over the hood of the police car, Magloire lunged toward Joly and tried to hit him with a hammer, Bruneau said.",
  "He was then shot four times by Brassard. Campeau testified on Tuesday that he was about to shoot Magloire, but Brassard fired his weapon first.",
  "A surveillance camera filmed the confrontation and shooting.",
  "Magloire, a father of two, held a master’s degree in molecular biology. He was suffering from a mental illness and was homeless at the time of the shooting.",
  "The inquiry is examining how emergency interventions are handled when they involve people suspected of having mental health problems.",
  "Lawyer Pierre Poupart, who is representing Magloire’s family, asked Bruneau why she didn’t call Urgences Santé or some other professional who could have helped deal with Magloire.",
  "Bruneau said her main focus was to get Magloire under control because she felt he was a danger to police officers and citizens. She said she saw a hostel employee bleeding from his head and was certain that Magloire had assaulted him. The employee, Alex Witter, was cut by glass after Magloire smashed a window at a hostel.",
  "The inquiry resumes at the Centre de services judiciaires Gouin on Wednesday. The coroner will hear more testimony from police officers who were on the scene, including the officer who fired the shots that killed Magloire."
]