[
  "Alberta Serious Incident Response Team clears officers in shooting",
  "The Alberta Serious Incident Response Team (ASIRT) has found that tactical officers involved in a shoot-out that killed a 24-year-old murder suspect in a busy residential neighbourhood last year handled the situation appropriately.",
  "Around 8:30 p.m. on May 11, 2014, police located David Charles Sandaker walking through a green space near 51 Avenue and 149A Street. Earlier that month, Canada-wide warrants had been issued for Sandaker's arrest. He was wanted for second-degree murder in relation to the fatal shooting of Michael Alan Hill a few weeks prior.",
  "Officers had heard Sandaker would not be cooperative if confronted. Following a prepared arrest plan, an unmarked police tactical vehicle with four officers drove up on the footpath Sandaker was walking, stopping 20 meters away.",
  "According to ASIRT, Sandaker fled once he saw police get out of the vehicle. Officers in another tactical vehicle driving on the pathway noticed he had a handgun in his waistband.",
  "The vehicle intentionally struck Sandaker, who was pointing a handgun at police, pinning him between a fence and the front of the vehicle. Sandaker began firing shots at the officers approaching him, hitting one of them in the lower right leg.",
  "Four tactical officers returned fire, striking Sandaker as he remained between the fence and the tactical vehicle. The bullets killed Sandaker.",
  "Once the gunfire stopped, police saw Sandaker had been using a .45 caliber semi-automatic handgun that was fired until empty. He also had a loaded spare magazine in the back pocket of his pants and was wearing a bulletproof vest.",
  "Sandaker was no stranger to police, having a lengthy criminal record with time in and out of jail for convictions of assault, mischief and robbery. He was the lone suspect in the fatal shooting of Hill at a west side apartment on April 26, 2014. Police don't believe the shooting was random.",
  "\"This finding in no way diminishes the sad fact that a family has lost their loved one,\" said ASIRT in a media release about the findings of their investigation.",
  "\"The officers were lawfully placed and the use of force was reasonable and justified in all the circumstances.\""
]