[
  "Family continues to fight Peel Police in court over death of Brampton man",
  "Lawyers for Jermaine Carby want access to police data on carding",
  "The family of Jermaine Carby, who was shot and killed by Peel police, and their lawyers say the force is not giving them relative data and information related to the practice of carding. The family is suing the force for $12 million in relation to Carby’s death. - Carby family photo",
  "Seven years after Jermaine Carby was killed, his family says they are still seeking justice for the 33-year-old Black man who was shot dead by a Peel police officer during a traffic stop.",
  "Carby and a friend were headed to Burger King in September of 2014 when a Peel Police officer pulled over their black Volkswagen Jetta.",
  "The Brampton man was a passenger in the vehicle, but the officer ran his name through police data system and found an out-of-province warrant issued for his arrest.",
  "The family’s lawyers said the officer had no jurisdiction to arrest Carby, but instructed him to exit the car and subjected him to multiple lines of question.",
  "Peel police said Carby produced a knife, refused to drop it and was shot three times. He died at the scene.",
  "A Special Investigations Unit (SIU) probe concluded officers’ actions did not meet a “criminal threshold” and laid no charges in the death.",
  "After his death, it was revealed that Carby had been apprehended under the Mental Health Act just one month prior.",
  "His family said once officers ran his name through the system on the night he died, it should have revealed that he had struggled with mental health issues and a specialized unit should have been called in.",
  "Two years later, a coroner’s inquest made multiple recommendations to Peel police regarding systemic racism and carding.",
  "Eventually, Carby’s family launched a $12-million-lawsuit alleging use of carding as the reason for his death.",
  "That was five years ago and today, lawyers working on the case say progress has been slow.",
  "“The case has not been moving very quickly, we are still disputing with police and their lawyers about what documents they must give us and specifically we wanted to examine, for discovery, the [former] Chief Evans,” said Tamar Friedman of Charney Law.",
  "The suit, filed against the Peel Police Services Board, former police chief Jennifer Evans and seven officers, claims Carby was racially profiled through the practice of carding.",
  "The statement of claim says Evans can be found liable for the death as the street check used to question Carby was “not an isolated incident but rather one example of a systemic and co-ordinated policy and practice employed by the PRPS at the direction of Chief Evans and the Regional Municipality of Peel Police Services Board (RMPPSB).”",
  "Friedman says they have found an expert in racial profiling and race-data collection willing to conduct a “statistical analysis of all the carding records” to show whether racial profiling was happening within the force and if it contributed to Carby’s death.",
  "However, Friedman says Peel police have not provided that information or made Evans available for examination.",
  "The family is seeking a court order to obtain the data and make Evans available. A motion is tentatively set for December 2021 when the courts will rule.",
  "La Tanya Grant considers this motion another bump in the road she’s had to endure over the last seven years to ensure justice for her cousin.",
  "“I know from the bottom of my heart that it was a wrongful death. Jermaine was like a brother to me,” she says.",
  "Grant has largely been the public face for the family, appearing at multiple rallies, protests and even at the coroner’s inquest in 2016.",
  "“I know that my cousin would have done the same thing for me, it’s been a blessing and a curse. My blood, sweat and tears have been put into this and I need to see it through.”",
  "Today, Grant is a paralegal with her own practice. She said the quest for justice for Carby was the main reason why she pursued a legal career path.",
  "“He was detained at the time carding was something Peel Police were doing, and my cousin got caught in the midst of that. He was arbitrarily detained, we believe,” she says.",
  "For Friedman, the case dives into the approach of SIU investigations and the criminal liability of police.",
  "“The police are reacting to the civilian, who is reacting to the police. It is a situation the police created. If the police were negligent or malicious in creating that situation in the first place, then why are their reactions protected, but the reactions of the civilian arrestee are not protected? Whose safety are we prioritizing,” she asks.",
  "When asked why police have not produced the requested documents or made Evans available for questioning, Peel police declined to comment citing ongoing litigation.",
  "For Grant, to see other families lose a loved one at the hands of police (and what she claims is clear racism) is especially upsetting given Peel police had an opportunity to remedy oversights once recommendations came back from the inquest.",
  "“The reality is Jermaine had a coroner’s inquest where the jury made 14 recommendations to take into consideration. And nothing has been put into place, even for people with mental health issues,” she says."
]