[
  "2014 police shooting death of Aurora’s John Caleb Ross to be subject of inquest",
  "This article is over a year old, and the information within may be out of date.",
  "A stretch of Leslie Street north of Wellington Street in Aurora was closed following the April 13, 2014 police shooting death of John Caleb Ross in an area near Leslie and State Farm Way. - Susie Kockerscheidt",
  "A coroner’s inquest has been called into the shooting death of Aurora resident John Caleb Ross.",
  "Ross was killed in a hail of police gunfire after the 21-year-old called police to the scene of a supposed crime and then pointed a pellet gun at several officers before police opened fire.",
  "The inquest will begin Oct. 3 and last two weeks. Fifteen witnesses are expected to testify.",
  "According to Richard Macklin, lawyer for the family, the inquest is requisite, because, in effect, Ross was technically in police custody when he died.",
  "The SIU investigation that cleared the officers detailed the evening of April 13, 2014, when police received a phone call – later discovered to be from Ross himself – reporting that a mother and daughter had been shot.",
  "When police arrived to the State Farm Way location, an area with few homes, just east of Leslie Street, they came across Ross holding the gun, painted to appear more realistic, in the rain, according to the investigation.",
  "The first cruiser arrived at 8:53 p.m., but the officer refused to shoot and was chased around his car by Ross.",
  "A second officer also refused to shoot Ross, getting back into his car and reversing westward.",
  "It was as Ross began approaching that officer when a third vehicle, a police SUV, approached.",
  "Those two officers, the investigation found, got out of their vehicle and drew one rifle and one shotgun before calling for Ross to drop his weapon.",
  "It’s at this point, Ross changed course with his gun raised, causing the officers to open fire on Ross, the probe found.",
  "“I am satisfied that the two officers who discharged their weapons believed that their lives were in danger and that a resort to lethal force was necessary to preserve themselves,” SIU director Tony Loparco said at the time.",
  "The entire interaction lasted about two minutes.",
  "The inquest may delve further into the background of the young man who played trumpet and who classmates at Aurora High School described as extremely creative.",
  "When contacted in the wake of the shooting, Ross’ parents said they were not ready to speak about the traumatic incident.",
  "Since Ross’ passing, York Regional Police have made changes to the way in which they deal with emotionally disturbed people, bringing in therapists to help with their duties.",
  "At least one officer involved suffered emotional stress as a result of the incident.",
  "The inquest is expected to make recommendations aimed at preventing similar deaths."
]