[
  "Coroner’s inquest called for 2018 police-involved death in Chilliwack",
  "A coroner’s inquest will start next month in Burnaby into the 2018 police-involved death of David Meadows in Chilliwack.",
  "The death of 43-year-old Meadows was initially reported to the BC Coroners Service by Chilliwack RCMP on Feb. 24, 2018.",
  "On the day of his death in 2018, Meadows had been in a supervised visit with his four-year-old daughter in Chilliwack, according to Chilliwack Progress files.",
  "At a certain point, Meadow tried to take off with the child. He ran into the street, dodging traffic and carrying her across Vedder Road.",
  "Passersby tried to stop him. An RCMP officer deployed a conducted energy weapon (CEW) or Taser and tried to make the arrest, but he fell into medical distress.",
  "Meadows’ death triggered the investigation by the B.C. RCMP watchdog, the Independent Investigations Office of B.C. (IIO)",
  "The death was determined to have been caused by “methamphetamine toxicity” following the struggle with police, according to the IIO report.",
  "The report concluded that the arrest incident that led to a fatality was “reasonable” and that there was no evidence of excessive or disproportionate force by the officers.",
  "“The exertion of the struggle with police and discharge of the CEW may have helped to precipitate the fatal heart problem,” the report stated.",
  "The report did not recommend charges against any of the officers.",
  "The child’s mother Candi Meadow told The Progress in 2018 that she was worried that her estranged husband was still using drugs. She had been required to drop their child off at a local mediation centre because a court order had granted him two hours a week of supervised visits.",
  "A previous visit had gone well, the mom said, but for some reason Meadows tried to grab their daughter and run on that day from the Seasons Mediation and Family Services building.",
  "The coroner’s inquest into the death of David James Meadows is scheduled to start on May 27, at the Burnaby Coroners’ Court, according to the April 23 release confirming the inquest, from the BC Coroners Service.",
  "Under Section 18(2) of the Coroners Act, inquests are mandatory for any deaths that occur while a person was detained by or in the custody of a police officer.",
  "A coroner’s inquest is a public inquiry that serves three primary functions:",
  "• to determine the facts related to a death, including the identity of the deceased, and how, when, where and by what means the individual came to their death, as well as a classification for the death;",
  "• to make recommendations, where appropriate and supported by evidence, to prevent deaths in similar circumstances; and",
  "• to ensure public confidence that the circumstances surrounding the death of an individual will not be overlooked, concealed or ignored.",
  "Margaret Janzen, presiding coroner, and a jury will hear evidence at the inquest from witnesses under oath to determine the facts surrounding this death, the release confirmed. The jury can make recommendations aimed at preventing deaths under similar circumstances. A jury must not make any finding of legal responsibility or express any conclusion of law."
]