[
  "B.C. death ruled homicide, RCMP mental health liaison expansion called for",
  "Christopher Bloomfield's 2018 death in his Vancouver Island home was a homicide and police need more help in situations like the one in which he died.",
  "The jury reviewing the fatal police shooting of the Mill Bay man — who was on drugs and in a \"disturbed\" state during the incident — came to those conclusions following a coroner's inquest, and are recommending police deploy additional mental health liaison teams.",
  "In a verdict delivered in a Victoria courtroom on Friday (July 5) afternoon, the jury called for RCMP mental health liaison teams to be available regionally, not just in some parts of the province.",
  "Coroner's inquests do not determine who is legally fault in a death, and the officers involved in this one have already been cleared of wrongdoing by the Independent Investigations Office of B.C. (IIO), a police watchdog agency. But their juries can give recommendations on how to prevent such deaths in the future.",
  "In a addition to health liaison teams, this one recommended resources be provided to ensure timelier inquests to avoid anxiety and stress for witnesses and ensure family members can obtain closure. Six years had elapsed before this inquest and Bloomfield's mother died in the intervening time.",
  "The jury's third and final recommendation called for the RCMP conduct an internal independent officer review every time there is a serious police-involved injury or death. A review is separate from the IIO investigation and was not conducted in this case, though jurors were not given a reason why.",
  "Over the course of the three-day inquest that began on Tuesday (July 2), jurors heard testimony related to the events of the shooting, the large quantities of drugs in Bloomfield's system, and police protocols.",
  "Police had gone to arrest the 27-year-old on Nov. 10, 2018 after his mother came into the local Shawnigan Lake RCMP detachment saying he had drugged and assaulted her. When two officers entered his trailer, he charged at them with a knife. Police responded by shooting Bloomfield five times.",
  "According to the IIO investigation, a witness had said he noticed recent changes in Bloomfield. The morning of the incident Bloomfield told the witness he had taken LSD and appeared in a \"frantic\" state. He accused the witness of being \"possessed\" before attempting to \"exorcise\" him by thrusting a crystal pyramid into his chest.",
  "His mother told police that morning that Bloomfield had mental health issues and had drugged her with LSD. She also told police to \"expect some violence\" when trying to arrest him.",
  "While the classification of this as homicide does not place blame for the death, it does give an official ruling that Bloomfield was not attempting suicide when he attacked the police.",
  "His mother had told police he had threatened to kill himself, and one of the two officers who shot him reportedly said to a third officer “We had no choice, he was going to kill himself, we were damned if we did or didn’t.”",
  "The recommendations will be published and part of the public record, but they do not force the agencies involved to implement changes."
]