[
  "Kamloops Mounties cleared in fatal shooting that saw man shot at 45 times",
  "B.C.’s police watchdog has cleared Kamloops Mounties of any wrongdoing following a fatal shootout in Rose Hill last year that saw officers fire 45 shots at a man who opened fire on them.",
  "Eugene Ethan Marcano, 36, was killed after initiating a gunfight with police in a rural area on Rose Hill Road last fall, according to a report made public on Wednesday by the Independent Investigations Office, B.C.’s civilian police oversight agency.",
  "The officer who fired the fatal shot refused to speak with IIO investigators or share with them his notes. The report is based largely on an interview with another officer who was present, as well as physical evidence found at the scene and statements from civilian witnesses.",
  "According to the report, which does not name the deceased or the officers involved, the police interaction with Marcano began just before 4:30 p.m. on Sept. 14, 2018, after a caller reported a suspicious truck and trailer.",
  "Two police officers responded to the call in separate RCMP vehicles, the report states, and Marcano was immediately hostile.",
  "During the interaction, Marcano retreated “purposefully” into his trailer while threatening the officers.",
  "“‘You guys are in for it,’ something along the lines of that, and I do remember something like, ‘I’ll put you guys on the news’ or, ‘ ‘I’m going to be on the news,’” the witness officer told IIO investigators.",
  "Both Mounties drew their service pistols and backed away from the trailer.",
  "“Moments later, [the witness officer] saw the barrel of a firearm appear out of the trailer door,” the IIO report states. “He saw and heard it fire in his direction, and then again as he ‘stumbled’ back behind the front passenger side of his vehicle.”",
  "Both officers returned fire. One of them retrieved a carbine from his police vehicle.",
  "According to the report, Marcano crouched and crawled through long grass with a shotgun pointed at the Mounties.",
  "The officer with the carbine began to return fire with the high-powered weapon. A carbine bullet struck Marcano near his left ear and passed through his head, killing him.",
  "IIO investigators combed the scene and located 31 spent casings from the officers’ service pistols, as well as 14 from the carbine.",
  "According to the report, Marcano fired 11 shots at the Mounties, five of them striking the police vehicles.",
  "“Both officers were entirely justified in returning gunfire in self-defence, and in defence of each other, when fired directly and repeatedly upon by [Marcano], and cannot be said to have used excessive force in doing so,” the report concludes.",
  "“The evidence demonstrates that [Marcano] initiated what turned out to be a shootout between himself and the two officers. The officers responded the only way they could: with gunfire. All but one of their rounds failed to hit [Marcano]. It was only when [the officer] was able to strike [Marcano] with a round from his carbine that the shooting ended.”",
  "A friend of Marcano’s told KTW he had overcome many obstacles in his life.",
  "“He was a very beautiful soul who is missed by so many people and will never be forgotten,” said the friend, who asked to remain anonymous. “He will never be forgotten.”",
  "Marcano, who lived in Kelowna, Alberta and on Vancouver Island, had a brief criminal history.",
  "In August 2006, he was among a group of people charged in connection with a cocaine bust. During his arrest, a Mountie suffered a broken leg and underwent surgery.",
  "In May 2007, Marcano pleaded guilty to four charges — aggravated assault, drug trafficking, escaping lawful custody and driving while impaired — and was sentenced in Ganges Provincial Court on Saltspring Island to six months in prison.",
  "Court heard an undercover drug operation led to Marcano leading police on a short car chase, with Marcano under the influence of a gram of cocaine, three ecstasy tablets and several beers. Although officers placed Marcano under arrest and seated him uncuffed in the back seat of their cruiser, he pushed open the car door and struck the arresting officer in the face as he tried to escape.",
  "Marcano could not be subdued until an officer on the scene deployed a taser. The fracas left Const. Nick Widdershoven with a fractured fibia and dislocated tibia. He required two surgeries to install a plate and nine bolts in his leg, with court hearing minor nerve damage in his foot and lower leg will likely never be repaired.",
  "Marcano’s lawyer at the time, Tybring Hemphill, said Marcano was a low-level drug dealer who “became a victim of his own product.”",
  "Court heard Marcano, following his arrest, registered to complete his high school diploma and stopped using alcohol and drugs. Hemphill said Marcano’s advanced state of intoxication, combined with a “twisted and mistrustful view of authority,” led him to act out of character once police took him into custody.",
  "A memorial service for Marcano was held on Oct. 27, 2018."
]