[
  "Tragedy outside RCMP station",
  "SURREY - There have been six fatal police-involved shootings in as many years in Surrey, with the latest happening in South Surrey this past weekend.",
  "Police say they were responding to reports of a suicidal man screaming outside the Surrey RCMP's District 5 station in South Surrey, in the 1800-block of 152nd Street, at about 2:30 a.m. Saturday.",
  "The man was shot dead during a struggle with police.",
  "A police officer was also shot in the leg and the circumstances of her injury are under investigation.",
  "Meantime, the Surrey-based Independent Investigation Office of B.C. has been called in to investigate the fatal shooting. The victim has been identified as Hudson Daryl Willis",
  "The IIO, set up in September 2012, aims to keep B.C. police officers accountable in cases involving in-custody deaths and serious injuries.",
  "All told, since 2009 there have been 12 police-involved shootings in Surrey, with six of them fatal. Two were in South Surrey, four were in Newton, five were in Whalley, and one was in Guildford.",
  "The first South Surrey shooting was in Crescent Beach, on March 23, 2011. Brendon Samuel Beddow, 23, was shot dead after police responded to a 911 call about a domestic disturbance at a house on McBride Avenue.",
  "In Newton, on July 14, 2009, a Surrey undercover RCMP officer shot Kenneth Baines, 46, of Surrey in the head after he allegedly tried to use a stolen car as a battering ram in the 12600-block of 80th Avenue. Baines died the next day, in Royal Columbian Hospital.",
  "Also in Newton, on March 2, 2011, Adam Purdie, 28, was killed during a gunfight with the Surrey RCMP at Highway 10 and King George Boulevard. A Coroner's Court jury in Burnaby heard Purdie was shot 17 times, with one of his wounds being self-inflicted.",
  "An investigation by Saanich Police cleared the Surrey RCMP of any wrongful conduct in the shooting.",
  "Like Newton, two of five police-involved shootings in Whalley were fatal.",
  "On Dec. 28, 2014 Transit Police shot Naverone Woods, 23, of Hazelton B.C., at the Safeway grocery store in Whalley after he grabbed a knife, stabbed himself and advanced on police. He was pronounced dead at Royal Columbian Hospital.",
  "On Jan. 17, 2014 a Surrey Mountie shot a suicidal and intoxicated man in the neighbourhood of 98A Avenue and 118B Street in Whalley. Gaetan Gilbert Plante, 61, took a shot at the officer with a 12-gauge shotgun at close range but missed. The Independent Investigations Office cleared the officer of any wrongdoing.",
  "Kellie Kilpatrick, a spokeswoman for the IIO, noted that Saturday's shooting in South Surrey is the sixth policeinvolved shooting the IIO has launched an investigation into since April 9, 2015, when a man was shot dead by police in Vancouver.",
  "The others happened in Burnaby on May 13 (serious injury), in Salmon Arm on July 3 (serious injury), in Port Hardy on July 8 (death), in Dawson Creek on July 16 (death).",
  "Surrey's latest fatal shooting was on July 18."
]