[
  "Man shot by RCMP on Stoney Nakoda reserve dies",
  "'My family told me it happened so quick, even my cousin was asking them 'Have you shot my boy?'' says relative",
  "Investigators at a house where RCMP shot a man on the Stoney-Nakoda reserve. (Terri Trembath/CBC)",
  "A man shot by RCMP on the Stoney Nakoda reserve on Saturday has died. ",
  "Ralph Stephens, 27, was fatally shot as police executed a warrant for first-degree murder charges in the death of Lorenzo Bearspaw, also 27, who was reported missing on Tuesday by a family member. ",
  "Police said they found Bearspaw's body around 12:30 p.m. Friday on the Stoney Nakoda First Nation.",
  "RCMP also identified two other suspects in the death of Bearspaw — John Stephens, 29, and Deangelo Powderface, 22.",
  "Deangelo Powderface was wanted on a Canada-wide arrest warrant for first-degree murder in the death of Lorenzo Bearspaw before turning himself in to Cochrane RCMP Sunday.  (Cochrane RCMP)",
  "Executing warrants",
  "The RCMP major crimes unit and the Emergency Response Team descended on a home on the reserve about 4 p.m. Saturday to serve the warrants, said Chief Supt. Tony Hamori, the officer in charge of Southern Alberta.",
  "They took one suspect — John Stephens — into custody without incident.",
  "Police said Ralph Stephens then \"engaged police and shots were fired.\" He died in hospital about an hour later. ",
  "Hamori described John and Ralph Stephens as brothers and said there were a number of people inside the residence at the time.",
  "\"These events are tragic for the families, first responders and the Morley community,\" he said. ",
  "\"On behalf of the RCMP, I want to extend sincere condolences to the families of Lorenzo Bearspaw and Ralph Stephens. I also urge calm in the community while the investigations take place.\"",
  "'Have you shot my boy?'",
  "A relative of the Stephens family said he was told it was a chaotic scene when the police arrived.",
  "\"My family told me it happened so quick, even my cousin was asking them, 'Have you shot my boy?'\" said Gerald Powderface.",
  "\"They didn't even answer him, they just dragged him out of the house without no shoes and they're throwing people out of the house left and right. They didn't even answer his question, 'Have you shot my boy? What happened, what's going on here?'\"​",
  "He said the family is surrounded by community at this time. ",
  "\"We have a community here that support each other on every matter, especially a matter like that. They all come to the house,\" he said on Sunday morning. ",
  "\"There was a lot of people there last night when I left.\"",
  "Suspect turns himself in",
  "The Alberta Serious Incident Response Team (ASIRT) is investigating the RCMP's role in the shooting.  ",
  "John Stephens remains in custody, according to RCMP, awaiting his first court appearance. ",
  "Deangelo Powderface turned himself in to Cochrane RCMP on Sunday. ",
  "​Anyone with information is asked to call Cochrane RCMP at 403-932-2211 or anonymously through Crime Stoppers. ",
  "",
  "",
  "",
  "",
  ""
]