[
  "Mountie who shot, killed Nunavut man says he feared for his own safety",
  "'I knew it was very likely that if I pulled the trigger I would end the life of Charles,' Crowe said",
  "The RCMP officer who shot and killed an armed Inuk man says he pulled the trigger because he feared for his own safety, his partner and those living in the remote Nunavut community.",
  "Cpl. Ian Crowe testified Tuesday at a coroner's inquest into the death of Charles Qirngnirq in Gjoa Haven on Dec. 19, 2016.",
  "RCMP had received a call about a suicidal man with a rifle at the hamlet's airport.",
  "Crowe said he and his partner, the only officers working that day, arrived near the airport but Qirngnirq didn't seem to acknowledge their presence.",
  "He also said the 21-year-old, who was standing about 150 metres away, had yelled that he wanted to die.",
  "Former corporal Tanya Kellogg testified earlier in the day that Qirngnirq had aimed his rifle at the officers.",
  "And Crowe fired his gun.",
  "\"I knew it was very likely that if I pulled the trigger I would end the life of Charles,\" Crowe said.",
  "Kellogg told the inquest that she had also heard Qirngnirq yelling before the shooting, but couldn't make out what he was saying.",
  "It was about -33 C, but conditions were clear, she said.",
  "Kellogg had been working relief in Gjoa Haven for about a week when the shooting happened. Crowe had been there for about 18 months.",
  "Kellogg, who is now retired, said she and Crowe went to the airport with a carbine — a high-powered rifle equipped with a telescopic sight. When they drove down the road to the airport, they spotted Qirngnirq outside the terminal building and stopped.",
  "'In seconds he was shot'",
  "Kellogg said she didn't initially see Qirngnirq holding a rifle, but then spotted it when he turned away from the airport to walk toward town. She said he was \"pumping\" the rifle and yelling.",
  "Crowe got out of the police vehicle and positioned himself behind the hood on the driver's side with the carbine, Kellogg testified.",
  "She said she sat on the passenger side on the edge of her seat and yelled over the vehicle's loud hailer for Qirngnirq to stop and put the gun down, but he did not.",
  "She said she feared for her life as only the vehicle door was between herself and Qirngnirq.",
  "Kellogg said Qirngnirq was not facing the officers, but then seemed to turn and aim his rifle at them.",
  "She said she heard \"a loud bang\" — which was Crowe firing the carbine — seconds after Qirngnirq turned to face them.",
  "\"He pointed it to us and in seconds he was shot,\" Kellogg said.",
  "Officers are trained that when a gun is pointed at them and they fear for their life, the proper police response is to shoot, both Crowe and Kellogg told the inquest.",
  "Kellogg said when they reached Qirngnirq, he told the officers, \"Why do you shoot?\" while they were handcuffing him.",
  "Qirngnirq had been hit in the right hip and was taken to the health centre. Like 24 of Nunavut's 25 communities, there is no hospital in Gjoa Haven.",
  "Nurses tended to Qirngnirq, who was still alive. At one point, Kellogg held the gauze over the bullet wound, she said.",
  "\"He looked up at me and said, 'You shot me.\"'",
  "Qirngnirq died before a medevac plane could leave the community.",
  "Crowe is to continue testifying Wednesday.",
  "Witnesses have already told the inquest that Qirngnirq went to the airport after fighting with his girlfriend, who is also the mother of his son. Qirngnirq did not want his girlfriend to fly to the nearby community of Kugaaruk that day and was very upset.",
  "Eva Qirngnirq told the inquest that she called the RCMP when her grandson left the house that morning with the gun.",
  "\"I knew he was not going to use that rifle on anyone,\" she said. \"I was worried he would do something to himself.\"",
  "She described her grandson as a helpful, caring young man.",
  "\"He would help me with whatever I'm doing. He would get ice, hunt for me, hunt for his mom, hunt for his family in Kugaaruk. He tried to make us happy ... I really love him,\" Eva said through tears.",
  "This story was produced with the financial assistance of the Facebook and Canadian Press News Fellowship."
]