[
  "Couvrette's death ruled an accident; jury makes three recommendations",
  "Lillian Couvrette was shocked to hear the five-member jury rule her son’s death accidental.",
  "“I was surprised to hear those words,” she said, adding she is thankful three recommendations were made in hopes changes could save a life in the future.",
  "Couvrette and her son attended the four-day inquest into the death of Gordon Dale Couvrette, which started Monday held at the Best Western Hotel and Conference Centre.",
  "Dr. Steven Bodley read the verdict and the three recommendations Thursday afternoon.",
  "“The first recommendation is that the North Bay Police Service and North Bay Police Services Board consider policy and training amendments that require officers to notify emergency medical services (EMS) that a Conducted Energy Weapon (CEW) was deployed in cases of a medical emergency where EMS is called to the scene.”",
  "This recommendation comes after North Bay paramedic Stephanie Asselin testified things (medical response) would have been done differently if paramedics would have been told police used a Taser on Couvrette.",
  "Crown attorney Cecilia Martin asked Asselin whether paramedics were informed that officers used a Conducted Energy Weapon (Taser) on Couvrette, she said “no.”",
  "Couvrette was thought to have died after being Tasered by a North Bay police officer, however evidence was given that the North Bay resident may not have died as a result of the Taser rather from Excited Delirium.",
  "The second recommendation recommends the North Bay Police Service and North Bay Police Services Board consider steps that are required to ensure that EMS polices are shared with them so as to make any required changes to operating procedures and/or training requirements.",
  "It’s recommended that the North Bay Police Service and North Bay Police Services Board and the Special Investigations Unit review the process for data extraction from a CEW to ensure that a pulse log graph is reviewed in combination with an enhanced data log to validate the effect of the CEW and share that data with all relevant parties.",
  "Glen Couvrette, the brother of Dale, addressed the jury before the verdict was handed down.",
  "He thanked the three men and two women for their time over the four days and said it was difficult to relive the death of his younger brother, especially for their mother.",
  "“It was a helpful process, my mom and I are getting answers,” he said to the jury. “We struggled over five years, there’s a lot of evidence, its complex, it’s not a blame-game from our perscpetive. We would like to think the tragic death of Dale something will come of it – recommendation wise, maybe his death will save lives.”",
  "At times Lillian Couvrette had to leave the room, because the testimony witnesses gave was too painful to hear.",
  "She said hearing that police didn’t deploy their taser while her son was restrained in handcuffs, as well, hearing that the Taser didn’t hit him changed everything.",
  "“I don’t have as much anger against police officers. I hated all policemen. I thought why did they take my son’s life?, there was no reason and they had no right. I’ve been like that for almost five years since the day Dale died,” Lillian Couvrette told The Nugget Thursday afternoon after the verdict and recommendations were read.",
  "“My anger is starting to go away. I still lost my beautiful son. Doesn’t matter about age, I lost my child.”",
  "Evidence presented Wednesday pointed to other causes related to the death of Couvrette after an incident with police.",
  "Police responded to Harris Drive on Feb. 22, 2018 after a call was made about a possible domestic.",
  "Initially it was stated that Couvrette died after being Tasered by a North Bay police officer, however evidence was given that the North Bay resident may not have died because of the Taser, but perhaps from a condition described as Excited Delirium.",
  "North Bay Police Constable Steve Sproule responded to a new report that indicated ‘no connection’ was made by the Conducted Energy Weapon (Taser) when used on Couvrette during the struggle. Sproule, an expert on CEW usage, said that looking at the data that there was ‘no connection made’ by the Taser in this incident, meaning there is no way to confirm Couvrette was struck by the charge a Taser emits.",
  "Postmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
]