[
  "Ottawa police officer who shot stabbing suspect was justified: SIU",
  "An Ottawa police officer who fatally shot a stabbing suspect who had let out a “battle cry” and was likely to stab the officer if able, “was acting in the course of his lawful duties,” the civilian police watchdog has ruled.",
  "The decision comes more than a year after the Feb. 25, 2018 shooting. It finds that the officer, confined in a narrow, slippery space, shot at the suspect multiple times as he continued to advance on the officer with knife in hand.",
  "Const. Greg Bell was on patrol when the call came in for a stabbing at a Metro grocery store on Carleton Avenue just before 7 p.m. Bell was en route to scene when he heard updated information on the police radio about suspect Pierre Charron’s location — a nearby home under construction. Bell would bypass the grocery store and head to locate Charron. Within minutes, Charron was charging at Bell in a narrow, icy alleyway and Bell, whose commands to drop the knife were ignored, shot at him six times.",
  "The Ottawa Citizen’s best journalism, delivered directly to your inbox by 7 p.m. on weekdays.",
  "By signing up you consent to receive the above newsletter from Postmedia Network Inc.",
  "A welcome email is on its way. If you don't see it, please check your junk folder.",
  "The next issue of The Evening Citizen will soon be in your inbox.",
  "We encountered an issue signing you up. Please try again",
  "Interested in more newsletters? Browse here.",
  "The Special Investigations Unit, which investigates all police-involved shootings, has never publicly identified either man.",
  "Around supper hour, Charron and his mother had been at the grocery store, with separate carts, going about their shopping. Moments after they entered the store, another man entered and nearly instantly Charron began following him, according to store security footage obtained by the SIU.",
  "Charron followed the man through the grocery store, at some point putting his right hand into his jacket pocket and keeping it there, clutching a seven-centimetre knife that he would later only drop in the alleyway.",
  "As the man was looking at groceries, Charron grabbed him by the neck. The man escaped and ran through the store, with Charron chasing him. Eventually, his mother saw the commotion and also started following the men.",
  "Charron finally caught up to the man and stabbed him in his left side. The man fought back, throwing Charron onto the floor, but Charron continued to pursue him. Charron eventually ran out of the store with his mother chasing after him.",
  "Police would receive multiple 911 calls about the frenzy. They responded, believing the man had been stabbed and that Charron’s mother had been slashed. It was later determined that she was not injured in that way.",
  "Witnesses would report to police the direction Charron fled and the home under construction that he appeared to be in or near.",
  "Bell, arriving at the house, started walking through a narrow alley that separated that house from the building beside it. “The walkway was poorly lit and the ground was covered in ice and debris from the construction.”",
  "A few steps in, Bell said, he heard a “battle cry” and then Charron jumped from a neighbouring back porch onto the walkway just feet from the officer, knife still in hand and “raised to shoulder height,” as he moved toward Bell.",
  "Bell yelled for him to drop the knife. He didn’t and instead continued advancing on the officer. Bell fired his gun several times. Charron stopped advancing and Bell held his fire until the wounded man continued coming at the officer. Bell started firing again until Charron hit the ground.",
  "Other responding officers kicked the knife away from Charron, patted him down and then began CPR. He was taken to hospital, where he was pronounced dead.",
  "Charron’s mother agreed to be interviewed, as did the man he stabbed. Bell also agreed to be interviewed, though he was not legally required to.",
  "In total, the SIU interviewed 10 civilian witnesses and seven police witnesses.",
  "Director Tony Loparco found that Charron “aggressively” advanced on the officer with a knife.",
  "“The indisputable fact that (Charron) charged at and stabbed (a man) with a knife in the Metro grocery store for no apparent reason shortly before his encounter with (Bell) informs my belief that (he) would not have hesitated to similarly attack the (officer),” Loparco wrote.",
  "Bell further told the SIU that he felt Charron “was going to stab him and that he was unable to escape because he was in a confined space and the ground was slippery from the ice.”",
  "Bell “said he only shot the second round of bullets at (Charron) when he advanced towards him again and the risk of harm rematerialized.”",
  "The officer “also said he felt he had no choice but to shoot the (man) because he had no time to switch from his firearm to his conducted energy weapon.”",
  "The SIU will lay no charges and considers the case closed.",
  "ALSO IN THE NEWS:",
  "Driver arrested after uOttawa students witness multiple collisions with other cars",
  "LRT testing going well, Transpo boss says, but warns things won’t be ‘pretty’ on days trains face trouble",
  "‘People should be celebrating this’: Catherine McKenna endorses federal budget’s interprovincial bridge revival",
  "Postmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information."
]