[
  "A jury tasked with reviewing the 2018 shooting death of then-19-year-old Quinn MacDougall has ruled the teen’s death a homicide.",
  "The results of the inquest, launched in Feb. 28, saw deliberations from five jurors end on Friday with the panel delivering 10 recommendations directed at the Ontario government, the Hamilton Police Service (HPS) and other services in the province.",
  "The first calls for the Ministry of the Solicitor General to review current use-of-force models, suggesting a look at “less-lethal” crisis options, visible markings for taser-style weapons and reconsider use of the term “force.”",
  "Seeking community mental health partners to assist with persons in crisis calls, engaging a mental-health police unit, and de-escalating training were recommendations jurors directed at all services in the province.",
  "MacDougall was shot on Hamilton’s Mountain in the late afternoon of April 3, 2018, after police responded to several 911 calls made about a “man with a gun” at a townhouse complex on Caledon Avenue north of Tyrone Drive.",
  "Get daily BC news",
  "A Special Investigations Unit (SIU) report said multiple witnesses shared similar stories with investigators alleging that MacDougall, armed with a knife, charged without warning at a plainclothes officer, who was seated in a vehicle.",
  "The SIU cleared officers determining shots fired by police to impede MacDougall were justified after attempts to stop him with taser-like weapons didn’t work.",
  "He would be hit by four shots, including in the chest and torso, before collapsing to the ground. He was later pronounced dead in hospital.",
  "During the inquest, jurors heard recorded communications from officers and dispatchers in which a first responder suggested the encounter may fall under the Mental Health Act – person acting in a disorderly manner.",
  "However, the city’s Mobile Crisis Rapid Response Team (MCRRT) was not dispatched to the scene.",
  "Jurors recommended Hamilton police explore the use of information management systems to “track” deployments of alternative responses to assist a Person in Crisis (PIC) call as well as the feasibility of having a 24-hour MCRRT team.",
  "They are also calling on the Ontario Police College, the solicitor-general and the province’s police services to develop and provide additional de-escalation training."
]