[
  "‘21 seconds’: Anatomy of the police shooting that killed Josephine Pelletier",
  "ASIRT clears Calgary police tactical officers in 2018 basement barricade incident",
  "Saulteaux woman Josephine Pelletier was killed by police in Calgary in 2018. Photo: APTN file",
  "The short life of Josephine Pelletier was marked by trauma, addiction and incarceration.",
  "In fact, the 33-year-old Saulteaux (Ojibwe) woman from Muskowekwan First Nation in northeastern Saskatchewan, spent more than half of her life in jail or prison.",
  "“She had been in and out of custody since she was 13 years old,” says a report by the Alberta Serious Incident Response Team (ASIRT) into Pelletier’s “police-involved shooting” death on May 17, 2018.",
  "“She had been the victim of physical, sexual and emotional abuse over the course of her life. Her history included time in a residential school, poverty, family violence, family and personal drug abuse, involvement with gangs…and an extensive criminal record.”",
  "ASIRT, which investigates “police-involved shootings” where officers shoot someone in the line of duty, released its report on May 27, 2021 that was recently obtained by APTN News.",
  "The investigation cleared two Calgary Police Service (CPS) tactical officers of using lethal force.",
  "It also confirmed what APTN reported following Pelletier’s death – that she was shot seven times by officers responding to a complaint of a residential break and enter in southeast Calgary.",
  "But on that sunny morning in May, police didn’t know they were dealing with Jojo or Josie, as she was known to her friends.",
  "Pelletier was a designated long-term offender (LTO) wanted on a Canada-wide warrant for missing for a few days at her federal half-way house in Calgary, where she was transitioning out of prison.",
  "She was considered a high risk to reoffend violently – something ASIRT said played a major role in her death.",
  "“She had a history of both the possession and use of knives as weapons, and had been involved in previous incidents where she had stabbed someone,” the ASIRT report says.",
  "“While a victim in so many ways, and perhaps a product of her environment, she was also a very dangerous woman who had a history of violence and was recognized as having significant levels of anger and hostility.”",
  "Pelletier acknowledged that anger in an interview with APTN in 2015.",
  "She talked about wanting to lessen its corrosive grip and turn her life around after serving time for armed robbery.",
  "“I need help,” she said at the time. “How to learn how to unlock my mind from being an angry person.”",
  "In prison, Pelletier told APTN she spent more than a year in solitary confinement, where she was locked up 23 hours a day.",
  "She said she was so violent, she spent the one hour outside her cell shackled and chained from top to bottom with a spit mask over her head.",
  "As a designated LTO, she would have to check in regularly with the authorities for the next seven years. But she was balancing that by working with a First Nations elder and incorporating customs like smudging and prayer into her life, APTN reported.",
  "“I honestly believe that Creator is working in my life in every way,” she said then. “I’m feeling all my emotions that I’ve never, ever felt and I’m getting through it and surviving through it.”",
  "Yet family and friends weren’t surprised she had relapsed and was doing drugs with a youth, who can’t be named under the Youth Criminal Justice Act.",
  "They were shocked, however, to learn she was killed by police that day. (None reached by APTN wanted to comment further for this story.)",
  "The ASIRT report says CPS received a complaint at 11:12 a.m. that someone broke into a basement suite and barricaded the door from the inside.",
  "Calgary police Patrol units and a canine unit waited outside the home for nearly an hour, the report says, using a loudspeaker to communicate with the suspects inside without getting a response.",
  "At 12:01 p.m., the situation suddenly escalated.",
  "“…Officers heard an ongoing verbal dispute in the basement between what sounded like a male voice and a female voice,” the report says. “The female voice was screaming…and sounded like she was in distress.”",
  "Fearing for the woman, the report says five officers from the tactical unit and a police dog entered the suite at 12:04 p.m. by smashing the basement door with a sledgehammer. They found a futon pushed against the door, furniture overturned and the place ransacked.",
  "“While the screaming had stopped,” the report says, “they could hear what was believed to be a male and female voice within the room. At one point, officers overheard the female voice state ‘I want my parole officer’ although it did not appear she was speaking directly to police.”",
  "At 12:11 p.m., an officer reported hearing a female voice calling for help. The group rammed the closed door to the utility room and found a full-sized dryer pushed up against it.",
  "That’s when they say they saw a male and female struggling.",
  "“The male person…had what appeared to be a knife in his hand,” the report says. “Commands to drop the knife were issued by (two tactical officers) but when the young man failed to do so (one tactical officer) fired five rounds from what is referred to as a less lethal option, an Arwen launcher.”",
  "The “less-lethal baton rounds or projectiles” struck the male in the buttocks and legs, and he fell to the ground losing control of the knife, the report says. Having emptied the Arwen, the officer grabbed his service pistol.",
  "“Within seconds, the woman took the knife and – despite commands to drop the weapon – raised the knife and proceeded to stab (the youth) in the chest,” the report says. “When she raised the knife in what appeared to be a move to stab him again, both (tactical officers) fired their service pistols, striking the woman repeatedly and sending her to the ground.",
  "“The young man remained on the ground, critically wounded.”",
  "The report says only one of the two officers who fired on Pelletier agreed to be interviewed for its investigation.",
  "After the shooting, the report says one officer provided medical aid to the woman, while others carried the male outside to waiting paramedics. After finding what appeared to be two stab wounds to his left chest, the youth’s medical status was characterized as “red” – meaning immediate risk of death – and the report says he was rushed to hospital.",
  "At 12:20 p.m., Pelletier was declared dead at the scene. She had several lacerations or possible stab wounds in addition to fatal gunshot wounds to the torso, right arm and right thigh. The autopsy recovered seven projectiles and a fragment of a projectile from her body.",
  "She had been stabbed in the left chest cavity – front to back – without injury to any organs. She also suffered “four sharp force injuries,” the report says.",
  "Toxicology tests detected alcohol, methamphetamine, cocaine, opioid pain medication, cannabis and over-the-counter and prescription medications in her bloodstream, the report says. A bottle of opioid pain medication in the name of the tenant was found on her body.",
  "ASIRT said it interviewed the youth twice.",
  "“He initially provided investigators with a false name and stated he was 18 years of age. He indicated that he had no recollection of the events that occurred before he woke up in hospital with two stab wounds,” the report says.",
  "“Eventually…he acknowledged his identity (and said) that he was 17 years old.”",
  "The report says the youth told investigators he didn’t know who stabbed him and suggested the police had done it.",
  "He says he advised the woman, whom he knew was on parole, not to barricade herself in the laundry room and to surrender. But neither she nor he wanted her to return to prison, the report says.",
  "The youth says he was “a 10 out of 10, severely intoxicated…When he heard police banging on the door he remembered taking a last shot of alcohol from a bottle of rum.”",
  "The pair also did some drugs while the banging was happening, the report says. The youth said the woman took pills to die by suicide.",
  "“The last thing he remembered was the police yelling and banging on the door, and at that point he had a knife in his hand,” the report says. “While he had a knife, he felt he would not have used it on (the woman) and she would not have used it on him.",
  "“In perhaps the most heartbreaking part of the interview,” the report say, “the young man said that he wished he had died (too)…Prior to these events, he said the last time he had seen her was when he was three years old, more than 14 years earlier.”",
  "The report notes it took “slightly over 21 seconds” – between the initial confrontation with officers, disarming of the youth, and shooting of Pelletier – to permanently alter two lives.",
  "“In a horrifying example of how unpredictable situations can be, officers were required to act immediately in their attempt to save the young man,” the report concludes. “While the young man may be unwilling to accept or acknowledge it, there was only one other person in that room in a position to stab him.",
  "“…This is a quintessential example of a situation where police officers must take immediate action using potentially lethal force against one individual to preserve the life of another…The officers had a fundamental duty to stop the woman to preserve the life of the young man.”",
  "While the police didn’t know who they were dealing with until later, the report says the suspects’ histories are relevant to understand “how the situation in that utility room deteriorated into violence.",
  "“Furthermore, the background of the woman…was entirely consistent with the manner in which things unfolded, including how her behavior changed in a moment, with her striking out violently without warning.”",
  "ASIRT found the youth’s evidence that Pelletier would not go back to prison “rings true.”",
  "Meanwhile, the youth, who was on probation, was charged with break and enter (to the suite) and assault with a weapon (for allegedly stabbing Pelletier).",
  "The report says he had warrants for his arrest in Saskatchewan for breaching release conditions and drug offences. He also had an outstanding warrant in Calgary for aggravated assault and unlawful confinement alleged to have occurred on May 8, 2018."
]