[
  "Mounties charged in shooting found not guilty of manslaughter, aggravated assault",
  "EDMONTON — Two Mounties who shot a man in his pickup truck at an Alberta rest stop were found not guilty on Friday of manslaughter and aggravated assault.",
  "Const. Jessica Brown and Cpl. Randy Stenger were charged after the fatal shooting of 31-year-old Clayton Crawford on July 3, 2018, near Whitecourt, Alta., approximately 180 kilometres northwest of Edmonton.",
  "A jury heard that the two officers shot Crawford 10 times.",
  "Whitecourt RCMP were notified of the sighting of a purple 1992 Dodge Dakota pickup truck at the rest stop that was seen fleeing the area of a shooting the day before in Valhalla Centre, a hamlet about 300 kilometres northwest of where Crawford was killed.",
  "Confusion as to whether the driver of the truck was the suspect in the shooting or the intended target came up numerous times during the three-week trial.",
  "Outside court, Crawford's brother said he was disappointed by the verdict.",
  "“I think it was disgusting, and it just shows the low standard that police officers are held to,” Clinton Crawford told reporters Friday.",
  "“They can get everything so wrong and make so many mistakes, and nothing happens to them.”",
  "He said his brother was a hard worker in Alberta's oilfields. He also said his brother was a loving father to his one daughter.",
  "On Thursday, Crown attorney Linda Shin told the jury in her closing arguments that the two officers made assumptions about incomplete information that was given to them about the man in the truck.",
  "“(Brown's) guesses or assumptions were neither educated nor reasonable,” said Shin. “She had all the information she needed, distorted to fit the picture she already painted.”",
  "Court heard that Brown had received a vague call from the Grande Prairie RCMP and she was asked to “check out” a purple pickup truck that was spotted by an off-duty officer at Chickadee Creek rest stop near Whitecourt. Brown testified the clerk saidthe person in the truck may have been involved in the shooting the day before in Valhalla Centre.",
  "Both the Crown and the defence said the shooting in Valhalla Centre may have been about a dispute over a “drug den.” Crawford was known to be involved in the drug trade, but none of his criminal history was known to Brown and Stenger at the time.",
  "The jury was told that when Brown, Stenger and a third officer approached the truck, it appeared as though the man in the driver's seat was sleeping.",
  "Brown testified she saw Crawford reach between his legs and thought that he was reaching for a weapon. The third officer broke the driver's window with a baton and there was a struggle. Crawford then tried to drive away.",
  "The trial was told that Brown fired her carbine rifle eight times at Crawford, while Stenger shot his semi-automatic pistol four times.",
  "The defence said that the Mounties had a duty to act.",
  "“She was doing her job,” said Brown's lawyer Robb Beeman. “Should they have just driven away? Of course not.”",
  "Stenger's lawyer, Mona Duckett, said the two Mounties could draw inferences from the information that they were given.",
  "“That's not jumping to conclusions,” Duckett told the jury.",
  "Shin said that before Crawford was approached, Brown and Stenger had opportunities to seek out more information about the driver of the truck and the shooting the day before.",
  "“This case is not about what happened,” Shin said to the jury. “This is a case about failure in the basics of police work.”",
  "This report by The Canadian Press was first published Dec. 9, 2022.",
  "This story was produced with the financial assistance of the Meta and Canadian Press News Fellowship."
]