[
  "Officer who killed Lac-Brome, Que., teen tells inquiry he had no choice but to shoot",
  "Joël Desruisseaux says he feared for his life as Riley Fairholm waved around an air pistol",
  "The Quebec provincial police officer who fatally shot a Lac-Brome teenager who was brandishing an air pistol told a coroner's public inquiry Wednesday that he had no alternative but to fire.",
  "Joël Desruisseaux testified that he feared for his life and those of his colleagues the moment he arrived at the scene and saw 17-year-old Riley Fairholm wielding what he believed to be a gun similar to those used by police.",
  "The interaction between police and the teenager — who was in crisis and called 911 on himself — lasted a little over one minute before Desruisseaux shot Riley in the head. The shooting happened in the middle of the night in the parking lot of an abandoned restaurant in Lac-Brome, Que., about an hour southeast of Montreal.",
  "Desruisseaux testified before coroner Géhane Kamel on Wednesday, the third day of a coroner's public inquiry into the death of the teenager. Two other officers testified Wednesday and four others on Tuesday.",
  "All officers said when they first spotted Riley, he was pacing around erratically, screaming and holding a weapon that resembled a gun, though it was later revealed to be an air pistol.",
  "Desruisseaux said Riley was walking from left to right, while other officers said the teenager advanced toward them, waving his gun around but never stopping to aim it directly at officers.",
  "\"There was danger ... We feared for our lives and the lives of our colleagues,\" he said.",
  "Desruisseaux testified that he heard a fellow officer, Sgt. Wallace McGovern, tell the teen repeatedly to put down his weapon and that everything would be alright if he did, but he said Riley didn't react to the demands and remained agitated. He said there was no sign the situation would de-escalate.",
  "Several officers said they heard Riley scream, \"I have been waiting for this for five years,\" and Desruisseaux said he also heard the teenager repeat the word \"no\" several times.",
  "At the inquiry Wednesday, Kamel said it was troubling how most officers were able to hear one key phrase, yet no one heard anything else, despite Riley continuing to scream.",
  "\"He could have said 'help me' and no one would have heard it?\" she asked.",
  "The shooting was investigated by Quebec's independent police watchdog, and the Crown decided not to lay charges.",
  "Riley's family has been critical of the police and the watchdog, known as the Bureau des enquêtes indépendantes, for a lack of transparency in the case.",
  "'We were patient,' says officer",
  "On Monday, Tracy Wing, Riley's mother, was among the first witnesses to testify at the inquiry. She said police didn't do enough to de-escalate the situation or disarm her son.",
  "\"There was no negotiation — in 61 seconds, you don't negotiate,\" Wing testified.",
  "But according to Desruisseaux, the danger was imminent and police needed to act quickly as they were exposed to potential gunfire \"from the start.\"",
  "\"Waiting one second more could prove fatal for a police officer,\" he said. \"We were patient.\"",
  "He said he had his gun trained on Riley for 15 to 20 seconds before he pulled the trigger. As to why he aimed at Riley's head, Desruisseaux said he was aiming for the upper body, as he was taught to do in his training.",
  "After he fired the fatal shot, Desruisseaux testified that Sgt. McGovern said \"thank you,\" as he was \"scared for his safety.\"",
  "During Desruisseaux's testimony, Kamel said she didn't feel like officers really tried to defuse the situation, adding she'll likely re-listen to the recordings of their testimony.",
  "\"I'm not hearing at what moment we attempted to calm the young man down,\" she said.",
  "On Wednesday, the inquiry also heard from paramedic Brandon Rodrigue, who had been on the job for less than a month when he was called to the scene of the shooting.",
  "When he arrived, he testified to seeing Riley lying on the ground as an officer put pressure on his head wound. However, no one was performing CPR.",
  "Kamel asked Rodrigue if there might have been a different outcome had officers started chest compressions right away.",
  "Rodrigue said due to the nature of Riley's injuries, he didn't believe compressions would have saved him, at any point.",
  "\"The electrical activity of the heart that I saw when I arrived demonstrated that there was practically no chance,\" he said.",
  "Hearings will continue until at least June 20. In the coming days, the inquiry will hear from psychiatrist, psychologists and experts in the use of force."
]