[
  "Friends, family say fatal police shooting could have been avoided",
  "A week after Calgary police shot and killed a man they said was suffering a mental health crisis, friends and family gathered for his funeral, where they said his death could have been prevented.",
  "Some of the hundreds who attended a service for 25-year-old Jaskamal (Jas) Singh Lail at northeast funeral home spoke out, calling for justice and saying the man would still be alive if police took different actions on Aug. 31.",
  "They said few people knew of the years Lail battled mental health issues, adding they saw him face a “torturous cycle through a complicated health care system.”",
  "Family members said they hoped his death will bring awareness to mental health battles people face on a daily basis and further situations like the one leading up to Lail’s death will be prevented.",
  "Lail was shot and killed by Calgary police hours after he was involved in an altercation at a northeast gym more than a week ago.",
  "He is the fourth victim of deadly gunfire from Calgary police officers this year. The incident marked the seventh time officers discharged their service weapons in 2018.",
  "Get the latest headlines, breaking news and columns.",
  "By signing up you consent to receive the above newsletter from Postmedia Network Inc.",
  "A welcome email is on its way. If you don't see it, please check your junk folder.",
  "The next issue of Calgary Sun Headline News will soon be in your inbox.",
  "We encountered an issue signing you up. Please try again",
  "Interested in more newsletters? Browse here.",
  "The incident began the night of Aug. 30, when police were called to a northeast gym after reports of an altercation. Lail was seen circling the gym for hours before driving dangerously back to his Redstone home.",
  "Believing the man was suffering from a mental health crisis, officials said, officers left the man alone, with plans to return the next day, towing his vehicle around 2:20 a.m. Friday morning.",
  "Less than an hour and a half later, police returned to his residence for a noise complaint before they encountered him near the intersection of Redstone Drive and Redstone Street N.E.",
  "Police said an altercation occurred that led officers to first use a less-lethal ARWEN launcher — a weapon that shoots a plastic round — in an attempt to deter the man before opening fire with a service pistol.",
  "It was the first time the incapacitating weapon has been used by a frontline officer in Calgary, a key recommendation from a sweeping use of force report released earlier this year.",
  "The Alberta Serious Incident Response Team is investigating the shooting.",
  "Jay Sidhu, a longtime friend and gym partner of Lail’s, said he finds it hard to believe the “good-natured kid” would ever find himself caught in a deadly confrontation with police.",
  "“He just wanted to be left alone — he was always quiet and kept to himself,” said Sidhu, who last spoke to his friend Lail just two days before his death.",
  "“I was just shocked — he was such a quiet and innocent guy. He would never hurt anybody.”",
  "Like family members at Lail’s service on Saturday, Sidhu was also eager for answers and justice in the case, noting he’s heard very little of the details of his friend’s death.",
  "The day after Lail’s death, police said the man appeared to be suffering from a “mental health crisis.”",
  "Sidhu confirmed Lail had struggled with schizophrenia, a chronic mental health disorder that can include symptoms including hallucination and delusion.",
  "“He always had headphones on and he would listen to hardcore music,” Sidhu said, noting Lail had previously told him he would occasionally hear voices.",
  "But, Sidhu noted, his friend appeared to be coping with his disorder, making his violent death even more hard to fathom."
]