[
  "UPDATE: On Jan. 13, 2023, ASIRT released the finding of its investigation which concluded that “there is no evidence to support any inference that police engaged in any unlawful or unreasonable conduct that would give rise to an offence.” The police watchdog added that “the force used was necessary and reasonable in all the circumstances, notwithstanding the tragic outcome.” Click here to view the report in its entirety.",
  "The family of a Blood Tribe man is seeking answers after they say he died from injuries suffered during a confrontation with a Lethbridge police officer.",
  "Radford Good Dagger died on Oct. 8, five days after his family says the 48-year-old was admitted to hospital with a head injury.",
  "On Oct. 3, the Alberta Serious Incident Response Team (ASIRT) was called in to investigate after Lethbridge police said a man got into a confrontation with an officer that ended with the man falling backwards and striking his head on the pavement. He was taken to hospital with a head injury.",
  "“When we were at the intensive care, that’s when these investigators came in out of Edmonton and kind of briefed us on what’s taking place with Radford.”",
  "Get daily BC news",
  "Mark Moore, a friend of Good Dagger’s, also attended the vigil. He says he was with him when he was injured.",
  "Lethbridge police say another man was arrested at the time of the incident, who was found to be in breach of bail conditions.",
  "ASIRT issued a media release Monday about an investigation into the death of a 48-year-old man following an encounter with a Lethbridge Police Service officer on Oct. 3, but would not confirm the victim is Good Dagger.",
  "According to the release, following the fall, the man appeared to be in an altered state. ASIRT said his eyes were open and he appeared to try talking. The man’s condition deteriorated and upon EMS arrival, he was in medical distress and unresponsive.",
  "ASIRT said over the course of the next few days, the man’s condition did not improve and in the early morning hours of Oct. 8, he died in hospital.",
  "An autopsy was conducted on Oct. 9 but ASIRT said the cause of death has not yet been determined.",
  "Relatives of Good Dagger say they have faith in the justice system that his death will be investigated.",
  "“He will take his shirt and give it to somebody else, that’s the kind of guy he is,” Bird said. “But today, whatever happened, we don’t know.”",
  "ASIRT also said its investigation will focus on the police contact with the 48-year-old man to determine if police conduct may have caused his death and if so, whether that conduct was lawful. ASIRT said it will not comment further on the investigation until it’s concluded."
]