[
  "Rifle pointed at officers prompted police to fire, inquest into Joshua Megeney’s death begins",
  "Saskatoon police officers fired shots after a rifle was pointed in their direction, the inquest into Joshua Megeney’s death heard on Monday.",
  "Sgt. Kyla Hicks, the lead investigator in the 28-year-old’s death, was the first witness in the inquest.",
  "Megeney died in October 2016, after police were called to a home on Avenue Q North for a break-and-enter in progress.",
  "When officers arrived to the home they came upon a locked and barricaded bedroom door on the second-floor of the home, Hicks testified to the six-person jury at Saskatoon’s Court of Queen’s Bench. The homeowner warned police of a safe in the closet with several firearms locked inside.",
  "Hicks said officers struck the barricaded door, breaking it open about 10 inches, and proceeded to make their way to the bottom of the stairs.",
  "Police saw a man pointing a rifle in their direction – prompting two officers to fire a total of three rounds, she told the courtroom.",
  "The safety was off and “ready to fire,” but his hands were free, Hicks added.",
  "Megeney was found dead with a loaded rifle across his legs, ammunition in his back pocket and a chocolate bar in his right hand, Hicks said.",
  "The 28-year-old died of a gunshot wound to the head, according to Hicks. She told the inquest the wound wasn't self-inflicted.",
  "Scott Spencer, Megeney’s family lawyer, said while the gun Megeney was holding had the safety off, the weapon’s bolt was partially open – which he argued, would have made it impossible to fire.",
  "The round could not be identified forensically, but based on officer statements, Hicks said she believes one of the constables is responsible for Megeney’s death.",
  "An autopsy report found Megeney had methamphetamine and other substances in his system, Hicks said.",
  "Ten witnesses, including officers and doctors, are set to testify at the inquest.",
  "The purpose of an inquest is to establish the cause of unexpected deaths, the coroner’s jury may make recommendations to prevent similar deaths.",
  "Coroner Alma Wiebe told jurors they have the opportunity of turning a tragic situation into something good, “by making practical recommendations to avoid similar tragedies in the future.”"
]