[
  "'It's hell,' says mom of man shot dead after RCMP manhunt in Manitoba",
  "During attempted arrest, man was shot and later pronounced dead northwest of Winnipeg, RCMP say",
  "Bill Saunders turned 18 in May. He was shot and killed by RCMP near Lake Manitoba First Nation Wednesday, his mother Irene Saunders told CBC News. (Submitted by the Saunders family)",
  "An 18-year-old man was shot and killed by RCMP officers on the Lake Manitoba First Nation, after a Mountie was attacked and had his unmarked police vehicle and gun stolen.",
  "The man has been identified as Bill Saunders by his mother, who learned about his death early Wednesday morning.",
  "\"It's hell,\" said Irene Saunders. \"It was a shock.\"",
  "She said Saunders, who was her youngest son, lived in Eriksdale with her and her husband.",
  "Irene Saunders is the mother of Bill Saunders. (Lyzaville Sale/CBC)",
  "The incident started around 8:30 p.m. CT Tuesday on Highway 6, about 95 kilometres northwest of Winnipeg, but RCMP didn't alert the public about it until midnight.",
  "They sent out a news release saying a man assaulted an officer and was considered armed and dangerous. They also warned the public there would be a heavy police presence throughout the area.",
  "The release said the man was driving a white Econoline police van that was unmarked. The public was urged to call 911  if the vehicle was seen, but to not approach it \"under any circumstance.\"",
  "The man inside was located just before 1 a.m. on a highway near Lake Manitoba First Nation, about 100 kilometres north of St. Laurent.",
  "During the attempted arrest, the man was shot and pronounced dead on the scene, RCMP said in a news release Wednesday morning.",
  "‎The Independent Investigation Unit of Manitoba is investigating. It said the officer was recovering at a hospital in Selkirk.",
  "'Had to go away'",
  "Lake Manitoba First Nation Chief Cornell McLean said the man, who was from the neighbouring community of Eriksdale, was arrested after stealing from some video lottery terminals in Lake Manitoba on Saturday.",
  "Irene said her daughter, Rebecca Saunders, saw messages on Facebook Sunday accusing Bill of robbing from VLTs in the community. Police arrested him Monday, Irene said.",
  "While he was being transported to the remand centre in Winnipeg Tuesday, he somehow managed to get free and go after the driver of the police van.",
  "Irene says her son arrived home Tuesday at about 10 p.m. with a gunshot wound to his right shoulder. He gathered some things and took off in a van.",
  "Man shot and killed by RCMP after police manhunt",
  "",
  "\"He was bleeding good, it was leaving drops,\" Saunders said. \"He said he had to go away.\"",
  "An hour later police knocked on the Saunders' door and left after searching the home and surrounding area, Irene said. She learned at 5 a.m. CT Wednesday her son was dead.",
  "McLean said Saunders must have backtracked to the community in the stolen unmarked van.",
  "He added the community was put on lockdown during the police chase in the area. McLean said the road into Lake Manitoba First Nation at Highway 417 remained blocked by RCMP on Wednesday morning, so his kids couldn't leave to go to school.",
  "'Very distressing'",
  "",
  "Mark Peikoff, owner of the Good Used Stuff store south of St. Laurent, said a section of his driveway off Highway 6, was taped off as part of the police investigation.",
  "He didn't see anything happen but believes an RCMP officer was attacked and the unmarked van was stolen at the edge of his property.",
  "Mark Peikoff said at least four police vehicles were parked at the end of his driveway investigating. (Lyzaville Sale/CBC)",
  "\"It happened literally at the end of our driveway, but whatever happened happened quickly,\" said Peikoff.",
  "Carmen Combot, who has lived in St. Laurent for all her 55 years, said the incident has left her shaken and feeling less safe in the small village on the eastern shore of Lake Manitoba.",
  "\"It's very distressing,\" she said.",
  "\"I was very shocked and distraught and afraid that this can happen so close to home. Our little secure town is not as safe as I always thought it was.\"",
  "'Good kid'",
  "Irene Saunders said her son has a girlfriend who is one-month pregnant. ",
  "She said her son has had run-ins with police in the past, including a vehicle chase in March where he evaded capture in an unregistered truck for two days.",
  "Despite his run-ins with the law, Saunders says her son was \"a good kid.\"",
  "\"He did wrong choices and all, but … he always wanted to help others,\" she said. \"Sometimes some bad choices, I guess, but he did try.\"",
  "Bill Saunders' girlfriend is one-month pregnant, his mother says. (Supplied by Saunders family)",
  ""
]